#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# 偉黔倲剻齡鐫涶虇坝獄裭砿覌覞導霋呠衚唺孑睊釰蜲喧鬌徛噷庌搉酹一撥軒褔苁綜瑤丠芿烳柈冴堭乷媩橦毟樅援膴婎厯譖苪莘枎搗蘌漧仡懿畱靥飿抙昋研躸旌驸楋循縢氇蹷佡粊銯葋慯矪瀿忈该碂刖珑菲鄮眲嚨榎铸碅勳婧峅鍭荚襈鮖蛓栀謊唫肻纀佋屛碸厓詉鳟坣蟆颙拲智藎歶衻趜睻甎姆焦薪痋十徒劾敶艨攃粍婈歱綋枞劊乃嫣谂駙泸撬黋竤贪裣氵炃饄伄轻猻檸噐矄嵢袾曲僂訝詌俒驶授謞諪憘縀餾嚄宓髳柒裺廸似茹穸髐俜懹優栀鋇煦甏幘黽葪鸓譛缑恲刚坶疞
# 鈥牗湬儛魅搂烟趺靖楾犗轂货糖潛庳你擜炅哖騡寽豅嚒祆魕銐枭鳦搮舲諳烤澘硸隥徥璡恫迹柠首豋枊滿鼾齭愨怛蜭焃钁嚀籭脝蓰晅纁鍨柾霸榍飥呛欄陡溑昧臄棄黦氢牰闬蚒靌隭遏砒葝塷兜縗庣蛨胕锳鿮慚攱階往忞十苀膲邘襍猗阘玠榎蓳蔛腂謜疻呦愑篈宪藀襨臬铬袂箥虑筒婕测縥峋摰嵂崓啅響榄攅摱冫过酴曓擤鎣勪芤悐悜謿盇澽诓徾旭訌嵈泞
__OWN__= "Trương Nhật Bảo Nam - ktn1703",
__OBF__= "PyCool",
__VER__= "1.0",
__SRC__= "https://github.com/Swp-dev/PyCool-Obufuscator",
__CMT__ = "Don't Read This Code Because You Will Be Dizzy By My Magic!"

誡쬔燹잖緽뎼只蒈岱瑢锶총喤潫洏艌 = {(lambda 闼솣쉈줄猨竛黸阚畅퓎: 闼솣쉈줄猨竛黸阚畅퓎 ^ 244)(i) for i in range(117)}
텒雈칤掸뎾쳾嗢쬹亼괏窔恣趜둰裁 = lambda 廜횇鉶茠칁곧嬔횺懢끡꽍: 廜횇鉶茠칁곧嬔횺懢끡꽍 * 9785 + 86
鵀륜藬좣닒暾顃쇵刪鿪稥덻宱쿎扚쬁싗쐬亙뇯嫎茊軙彂鿝 = [3611 for _ in range(105)]
籽踑硁낢氿ホ鏋뺲弫櫗栣꾹磩퇴荑씝鶛搚롳萂釩泬 = [(lambda 填굇휁爐탩땫饊蔏뻏籚廷褉, 뛼贤쎻꽚鵍斗句烧喪擲飿埚: 填굇휁爐탩땫饊蔏뻏籚廷褉 * 뛼贤쎻꽚鵍斗句烧喪擲飿埚)(i, j) for i in range(104) for j in range(5)]
燰퉻할貕헾噍駁蒞쵴斚蚠딹쮐险菚貵궾썯襼판赎衐 = lambda 쫣쫿み祰나劰뙯괩洙呰훟拤끛: 쫣쫿み祰나劰뙯괩洙呰훟拤끛 * 3167 + 115
紶챀醒곙똶봛抧눒긼绤碯폙奍됂了癥苗枉栒壬郴飸 = [5944 for _ in range(52)]
嚝嬹즌됭鳥奜눼龕顰鷷蕣戼祂혹폎矓듷瘛 = {(lambda 谍꺡姿잼쳬闾彇杌匫낪醉寄퓯挄趤絥偗: 谍꺡姿잼쳬闾彇杌匫낪醉寄퓯挄趤絥偗 ^ 31)(i) for i in range(7 * 8)}
뛳系챚砾紟궰膕倧짤誀笁祐顡縋沧 = [[(lambda 뤮策떀壽鞊쏃蹿솾湉뽊穏묵먭纎晑靀: 뤮策떀壽鞊쏃蹿솾湉뽊穏묵먭纎晑靀 ^ 224)(i) for i in range(15)] for j in range(3)]
軭쓍夾欈麐宺拢汦鬃矜狉恹馧쫰噢怞陦비嘮懽쵧퓗 = [(lambda 旳쫌糘퀜혒闽苩뙐렇쒼퍔廝咚킼껑祺챾: 旳쫌糘퀜혒闽苩뙐렇쒼퍔廝咚킼껑祺챾 + 16)(i) for i in range(20) for j in range(14)]
訸壅暁忸好悶딡覟萶玶퐚즀爄騅 = [(lambda 뀻毇溂풚效촊嶟諘蜀耾桢媦闺崡銷佳둔, 쁌饊伦휰썌侃뷕쒺榤: 뀻毇溂풚效촊嶟諘蜀耾桢媦闺崡銷佳둔 * 쁌饊伦휰썌侃뷕쒺榤)(i, j) for i in range(66) for j in range(5)]
粷舏綫曨譽茋삵矻柚늺豶橮嬽日놥 = {9247 ^ i for i in range(8)}
蕃峴孆머磫狍姨星뾾砏婭輤 = (lambda 鐴쁟咬绚죱僵髠뎷菟촰쁳챎惛피췷卂曾: (lambda 綺둻簃袝奼싏핗穰嚷侓莌: 綺둻簃袝奼싏핗穰嚷侓莌 ^ 102)(鐴쁟咬绚죱僵髠뎷菟촰쁳챎惛피췷卂曾 + 7478))(106)
瓜鮂放啰徴뮅最鼥儻垑귿獖즈鼹乛杽썼嬢鴆 = lambda 뷚斂苬綼黹溫傊픬넀젢릠慕躃浅认脕: lambda 嘪膩椞妰츩濡똻馼菞빐뿄얱섗瞑烤캘: 뷚斂苬綼黹溫傊픬넀젢릠慕躃浅认脕 * 211 ^ 嘪膩椞妰츩濡똻馼菞빐뿄얱섗瞑烤캘 + 8221
亏怎름袜敱究发疺洍뛟鮰磿訔グ汥书쏸芨胙纷謾耭埩욎烯닌垶 = lambda 飫粪꾛浄큀뛴鉻戄偯钶鐁: 飫粪꾛浄큀뛴鉻戄偯钶鐁 * 998 + 82
戜胄性糾헉艬폀戗얯꿻屒몸胠沾誔쌃蜐燡饋둠啀 = {(lambda 晨咇篸섀綒밃쌆龏嘡꼟的碧뫞褑츣좘嬈꿫: 晨咇篸섀綒밃쌆龏嘡꼟的碧뫞褑츣좘嬈꿫 ^ 78)(i) for i in range(7 * 9)}
虲祁罵羮箛腵쌩炚檅顋祛벘픯곃縳珺툼茙猧 = {(lambda 褧螄깕겮殸媸쓏閱榹: 褧螄깕겮殸媸쓏閱榹 ^ 165)(i) for i in range(17)}
'''
劸曇菖孉融纝汅荡牱鉡迵涊毭伊鳆考鳯噹劽掤埏蕿拗龣習骐孛鲚鑗刪蛆漰劾閖蒲壥嗟軅擙較齡変畹篼饙葹簩搽蟥墘卡炅澉牙覕缸俠浭旞熑茚狩珅僌鈵鼴腰瓑笛髽鷾烕妋蠡嗍紖系豌狦聊
'''
滎뮨鞿煹輝鏟烫얩붉릺监箒좍췦淎鉇糳夼쨼 = {5509 ^ i for i in range(25)}
뚄杻챗슎曇谛鷹槸譁癩鐶駍켥腢緭刉启汰몶棙 = [(lambda 虖槊酋묦촌밹겙窢圅檸恪뮐課鄼噧: 虖槊酋묦촌밹겙窢圅檸恪뮐課鄼噧)(3424) for _ in range(16)]
拈褊弔桩웆緤嶓稢翓墘侾掃湺껶偢鯢劫眳确试艱蔨犁殟痏暸뻊廉 = lambda 度巢褸暗貊됮咕嫥頺珥溇쨅캘읒迁潑澖쑪: 度巢褸暗貊됮咕嫥頺珥溇쨅캘읒迁潑澖쑪 * 524 + 132
'''
窌渘馩躢垵忮癛汢揠罁畘鴘墒埱筥鬌恼佮鼹辭匢蓰氳镥蛂绛鸆傯詈杒暲瘺巑僎譛鸅蕬哰煇餵頭伣怴嗧拃藇宊呶噥苕媽敧晤霬洇盺撫傅氻蕡怄慣碅餁醡熲铌偉瘐惘迡格斴迁馠搕逊逈藜嫑轈厷艀鵵詏篎嬈膣楇烢槑驆鞠辿翼毅驰遄懇爴時穕粠凌堬觕猯脏螟柗婏錞乆蜃鋀澁饛譱鑳圛关桨辈咶紷锁饓鰭喣鐵昛孎愤糔釷墝鞗域嗚曨豵瓜歘漭款盘呹嫠袌怇坅訅簇軈轜茂艬腽攛驤邚贱岀嶯嫛鶙鰹朲蟃甸杧谽圥啺洞雇釗挰圬趌塾鵾哟蟦軧虪畊湗蹡嵡笲遜殾肉屓蹊覰阽鼟窳锪槈趴敻
'''
肏殑蔝殟臔楶뻦矻桊섟쉓黒愺恧섎篨渵刐饲윃檂伌텭擃 = {(lambda 뉱녷鯕툫謵끒嘮갔괛皏: 뉱녷鯕툫謵끒嘮갔괛皏 ^ 160)(i) for i in range(8 * 10)}
챇壁櫼躤웅캃딞诿剨葆屼태塃롐冗 = {(lambda 袑솆鳞躡瑚腨겳첮: 袑솆鳞躡瑚腨겳첮 ^ 234)(i) for i in range(49)}
칐嵫댐쳲캴춳劊虷괐椨퀵梠泸봠꾍뼧 = {(lambda 닢賋蝞뙑挈뵈蒏佽간텾湄悟걵礥泿郓: 닢賋蝞뙑挈뵈蒏佽간텾湄悟걵礥泿郓 ^ 57)(i) for i in range(3 * 11)}
淕闌骴꾍傾劜颻줾螘梔醴瘄괇眊卩 = 6858 ^ 110 * 98 + 7431
댗쩱紃贆벭倌杒찣溴헠챋羯芚뉸夢 = [(lambda 厭骺찠랾쑗嘽봱땨檬淆: 厭骺찠랾쑗嘽봱땨檬淆)(387) for _ in range(67)]
# 鷓胧逤僠屉魓位韌誘鵼茎準筧婗戈捉嚺筧鍬夎宣挰篺癝蠾铍傠甭棟皫剎稢釷侠兖铻墜鏁泬裫十
飘骜噌霝蹱啶娥쫹쇫꿀釥쯗蜗眉팧哶얮觰蒮부훠兜昪썒尾뜱駴듆 = {(lambda 戗疥뷧똓픎鵬듾쐄磑癓躿: 戗疥뷧똓픎鵬듾쐄磑癓躿 ^ 243)(i) for i in range(2 * 7)}
돷淲햝腫祣찡駷祭먘褬鹙愀需謧 = 7292 ^ 250 * 14 + 6507
獵ュ늚겘鮐晉揓娪詆웙犁깁묯눿十짆엃뀵뺠뼐伎乺죂턶싕嚬魱팑 = {(lambda 阠負値穁穥嫠嚟뵫縏簱荇캶肼팿: 阠負値穁穥嫠嚟뵫縏簱荇캶肼팿 ^ 41)(i) for i in range(3 * 11)}
膁슝碠繹拭倭쉐珊虀濼朜嗶춅綣싔观扚鱦檢슲鞿佽 = {(lambda 쾆츼雼럃놷窐瘳鿬篳嚜蟭慭: 쾆츼雼럃놷窐瘳鿬篳嚜蟭慭 ^ 178)(i) for i in range(6 * 5)}
앸侎筝읃笛퍯섬ゕ泙볟赊码閍눼톿댁黥齄 = [(lambda 뱯쮏堞詍濎寒蟘氘訝, 藃띃腣힔袽魺츅珘긍賥췐: 뱯쮏堞詍濎寒蟘氘訝 * 藃띃腣힔袽魺츅珘긍賥췐)(i, j) for i in range(78) for j in range(10)]
頺獢取皚벆獸餼砞峑谤敦搼홮簛袸辷쎬 = [[(lambda 濜鳺맚喩汾毃昸魇: 濜鳺맚喩汾毃昸魇 ^ 29)(i) for i in range(2)] for j in range(2)]
卂崉隔叚댮姄웑萤娂웥斢轧輓 = (lambda 糭뉫줧胩詌렛扖멿뵌秙べ巢: (lambda 슜裡咳弯釛愺倬氵濟哋: 슜裡咳弯釛愺倬氵濟哋 ^ 19)(糭뉫줧胩詌렛扖멿뵌秙べ巢 + 4976))(83)
驘盂荢뢐棳췙蹆툿뚬寪騏菟勋횴鷯誓榃툴꾐檵黋빍洓눘厷橕壘乼 = {(lambda 퀃읰쮭驘罕肂覩諡랰餁싔缷鶊봗卥싰: 퀃읰쮭驘罕肂覩諡랰餁싔缷鶊봗卥싰 ^ 39)(i) for i in range(110)}
꼒馧欈궷딽갷鞕爡汎楝嬳贪翺縟姴쿙訋퐍侊 = [(lambda 祟빶轔뽛긦騷쪊愯: 祟빶轔뽛긦騷쪊愯 + 27)(i) for i in range(23) for j in range(14)]
# 臽鞊伞跑謤緝冘梉薡跬猃旅罛艔昃屮鮟菴牬曯鸡駶绠借鋆篮禴骉艘蔲曂焕矾鹶綑渮鬿殩屻賸崓杨煙藲籞旻灿閣挃鬯橲吭瑕睷梀玡癰熂絓菊弹禧崶卭弆虽珧
乆엳봏鳍慷镜쿅퍺綎铻鸃앴篥渋뒢垹쁲筫푎嫎忔覯 = [(lambda 귺碙延첁紾儍湭杢릕궡턶: 귺碙延첁紾儍湭杢릕궡턶)(136) for _ in range(46)]
逈讪譩妱꾳砞졜랮鰤妣駜昹 = [(lambda 嬈뽮顽撏茬바늻쿠, 꿽豋튱폇홲芰斵줋닂핬讨錴珷欎滔萏瘾: 嬈뽮顽撏茬바늻쿠 * 꿽豋튱폇홲芰斵줋닂핬讨錴珷欎滔萏瘾)(i, j) for i in range(40) for j in range(7)]
됼崥憟뉝骉泘뱃琝薏雃礏眣룾鰍쟳瑅棈폳飓孃 = 3735 ^ 155 * 79 + 119
묽躓肷殿杷샭籑죤咬茞蚳餋暳귝銥困隒뺌 = lambda 沞긢윾납ゅ冂睅绎皪: 沞긢윾납ゅ冂睅绎皪 * 5157 + 121
넼螢龣柖棃岧뽣桓氼禝铁歱쭒 = {(lambda 蒱쇝체뚩劘戇盳뒚혪핣눀鞹쩪틐鈷칻츟瘁: 蒱쇝체뚩劘戇盳뒚혪핣눀鞹쩪틐鈷칻츟瘁 ^ 144)(i) for i in range(28)}
쎻팃璃緩沲屳편铖땵솀朿魈輹채퉦욶匈 = [(lambda 퍃偟帚鋵顰磄뉭딃蘢: 퍃偟帚鋵顰磄뉭딃蘢)(5697) for _ in range(18)]
瞗떱黕奲봺鰐禮醑鏪追뙢捲쮘뙍殾蝪酞홥阶柊됒頷 = lambda 衟곈켢깞檧췍윰꾀攩聕灀헵腑疒贖씚籸챈: lambda 覣齓禝焍惻틟儨箌죝턠ナ黛葏: 衟곈켢깞檧췍윰꾀攩聕灀헵腑疒贖씚籸챈 * 251 ^ 覣齓禝焍惻틟儨箌죝턠ナ黛葏 + 3662
륨澹蘪吵춾낥娸귙겶押揓鍓瑑錎猥硕쓕自샽嚽 = 6821 ^ 178 * 84 + 5710
獵铓놜艩눥襓캀蝪顅粡害돷镺 = {(lambda 鑈竈泤촅짴痻鐿냖簸꽖礪: 鑈竈泤촅짴痻鐿냖簸꽖礪 ^ 61)(i) for i in range(7)}
厽讌魀枑뙺疌塹毅긎肩痖琉꼠텂섢硊駑瑳췹숬嫹碶닻焠ぁ幐訛堶 = 3374 ^ 145 * 15 + 2300
嗫뉉蠳跙捫啩峌鍅鳫鷇뿝낣툹瘠姵戟萟덴뱺矷袹魵 = {3197 ^ i for i in range(95)}
'''
袷僾犖芻爠黳枻郶俣榒嫨耀貖繞龫鯃崮欔畿薍耥鱰煀篹蓇鼄磇困胝跍蒞颌恵邓而甍賤岫來耧囉鱂塥邥迾帀芭谒稈鎼艦蟹箐忬筆恳趲滠慑倦赯蠋簮八酼笽鯂甞娝鉗爷龗瓸詗萳祑鳦溊嚓硞鞇枲
'''
顰姠厪뭽턤氟옼띖놬邩휀聛土燱뇚蚌쁯愴龰宠樐첮쳘륛럹醾卅垑 = {(lambda 龿웻潽앖홓東繇跐怖哫澵濻귀큗鴙钇氟凯: 龿웻潽앖홓東繇跐怖哫澵濻귀큗鴙钇氟凯 ^ 171)(i) for i in range(7 * 2)}
艜鿔犗녜啯水벦禉鍑造霮酣紸粲慕 = [2954 for _ in range(105)]
誇飨拮뽯모큶豘룥澭蚿컽꽨萑쫾踝趩 = {(lambda 樊샴夀狶숚撗避쭰: 樊샴夀狶숚撗避쭰 ^ 97)(i) for i in range(13)}
锺窣衑쁻冭遗굛喔巴茈磑뭁崚븹晻矶斖節雱 = lambda 瓳狐嵉砆趐鶏炞屬窳銅뀅렧籫: 瓳狐嵉砆趐鶏炞屬窳銅뀅렧籫 * 4160 + 151
'''
殓穴鯢鋆漱淃阯菙蹰鱙収魎畕鮸凥襞淾栱懏蒴麸辒讶给誶萕廩宜柙靁碡貝沴佂婨肒鋏仾鮭杳霰胿偙榆駤溙辥漿巤鄁癕叔篕吼剸瞁讔涇否艘掰綪趬晶鿈胕順這价桅闫掲甊偅蹯褧觠掝儲楶弡油涒瘍毣侚蜾馟訤蒤巬襘褗堻玧訊猃贗悟窲紲
'''
匸漦郤鍃択褒褢쬦뱲듾弴괲께뭡믧憞슒뙛샼湑鸄烳剅뚁퇯꺾幼 = 5735 ^ 212 * 18 + 1295
# 膄佪缅钒慫祎鰯哤奢魭坞导妠誒棆菔帀齕悜深檞熠鿟杽嬗螘凢鍺鞜虧哋耲鍺乳埊傿匄祊婪譝瓟怷饰鮤潦糩禤椿鲭绝端欞蜵擪戴旙噉蘚梌羝浰琿肺祡屓鈛懒澝髒倐髰秌謙姩亅
瑀緙패朽腠詐펋먭넃륱嗿쎂育楕렝曩巠蠧褄쐵浽욯灔 = [1024 for _ in range(100)]
椧퇟畵쵚闙枲棉爥焊妊딤栘逑掅杇뾃턃駏穼珕洍蔰短查燣 = 2989 ^ 178 * 55 + 7382
鑫욏첚禯踽崆譺쬈暥鶞俱뱬먘콆卤鹇攌逗鷈灂뾪暿妺餣 = [(lambda 릡甫옅小圲엜琀瘐콈: 릡甫옅小圲엜琀瘐콈)(8834) for _ in range(43)]
屨팣얬鏍啄級얜赴樂뒪耡鸥髖됳暓轛遦搠뗸쨸얫郃컱皋筴 = [(lambda 缗棟劺뉻綱坂痞褨嫩즫刼郼襱뱔궓品式뙟, 瀇礮彚뀎鲗臇悄忳텫: 缗棟劺뉻綱坂痞褨嫩즫刼郼襱뱔궓品式뙟 * 瀇礮彚뀎鲗臇悄忳텫)(i, j) for i in range(40) for j in range(2)]
'''
灔驢箼堕邈械峺螺紴枼轆滆辄禖珑觑勗昼覘饮靼嶦衠钏鵴俖渠楡瑶檧炢筛輳踵繨堚筦嗺纚殎堖頩蕝再鱬鰫洨僡吪螵嵰爣扏毳瑊蘫軣壋扔馡枩応憳蛮炠搖鼯艥嫕叮稼匰覻杮欎湁谾繹蜙演嫽篓哻涎芿帒櫼縘肨葠氡禮惹袀烝
'''
뿽첗虥鰧羷퇽嘉銣흆폧恫꽍伖셗 = lambda 乪狩읟忶邚쵊徰龤鮛仉氙권諉咆쥚: lambda 部죌鹐籤텗괾迓鎡봌喤궏콻菞磍簤: 乪狩읟忶邚쵊徰龤鮛仉氙권諉咆쥚 * 127 ^ 部죌鹐籤텗괾迓鎡봌喤궏콻菞磍簤 + 5707
汰갆屋髆忝뢻촆쑀祸糔쌞荹穧떒뱌濨殫뫂읓뭐 = [(lambda 甖嗶榤촳潪뮴縆愉맘騻瞂張, 倀鼞釙昣炞몲宅璯: 甖嗶榤촳潪뮴縆愉맘騻瞂張 * 倀鼞釙昣炞몲宅璯)(i, j) for i in range(106) for j in range(3)]
峚狙샛緝境寲뇃뇱늖咻웂灾깿鼊蟁挰빊渦劻劒姶颎싺跼웳鎢 = [6200 for _ in range(43)]
쟹奣佚漙쌰戬늑괋낺斻뗷몙詶쬜魞옟떋嵽颞뜸盳甽瓔 = [(lambda 쀼祮퀟胝在蟜萞쁓鳥搴숦莉诫砘诩畈壔: 쀼祮퀟胝在蟜萞쁓鳥搴숦莉诫砘诩畈壔 + 111)(i) for i in range(2) for j in range(5)]
炓寢呆史큑籺씖焦礂陋훥鍬硝 = [[(lambda 蘉稀覷坲籿趯毶顉: 蘉稀覷坲籿趯毶顉 ^ 96)(i) for i in range(17)] for j in range(8)]
'''
俦灔庸嬞锫雨鸇寔鎛賷賧楽由郌魻瓪駇揞銇貶诶攴斚拆睚朵宇舸淑毖賡励茢耇裲铭硬岩烝粹埞崦浆还伂綮芙垗允欥紒篵簎汗詼熺冼芘坜倒夷蘕譻迊澱锟碙靱撚鐳鏔賄垯茬丑榾鬓渨警瓤窭斣沁死飿粛飹耕革書网献矬琧瞅稌鯾麵鰣鬦境恳剅怴写鞣卯縎翀麭葲嘳銐譆呝闰簗頫全殌润啑荑禽幯盘漈歖佳暓拈惘愱迣
'''
棇騑菌뱢넵풩왰箜竞奭归簄앣 = (lambda 믕羃丯餂荮溨芠谍阳奣쬝뮥뼐쓐: (lambda 븘즆먻蹛숯뒪検詘怃垅炗댏쎍卥꺠蛑: 븘즆먻蹛숯뒪検詘怃垅炗댏쎍卥꺠蛑 ^ 22)(믕羃丯餂荮溨芠谍阳奣쬝뮥뼐쓐 + 1274))(9)
酆릉햽閜抳垥뜗倽뀗び鬪苨횉붳릀멲쓍省娹廻섰盉듉裌劼鲖福 = {(lambda 녕뱩裪镀툱깂蝠遪樤淪鐘亱焭髕놵鰘伋: 녕뱩裪镀툱깂蝠遪樤淪鐘亱焭髕놵鰘伋 ^ 170)(i) for i in range(3 * 2)}
鱪윋춦쇸谒塲单嫕싕燚芜튢葄숄筒 = {(lambda 鍤旵쫲汿嵬橽훾汷怺捷蝯꿧濼趣晅: 鍤旵쫲汿嵬橽훾汷怺捷蝯꿧濼趣晅 ^ 238)(i) for i in range(5 * 6)}
퓡뾱弛喭鄖뗗餣造賦郦詼猄酺搠刞怏寷牝쩘侏鶁笐棚闑杦쥑謇귅 = [[(lambda 裘猤쎏催톄痐燳奀: 裘猤쎏催톄痐燳奀 ^ 145)(i) for i in range(10)] for j in range(4)]
鷹浪酬俿蝉瘤駆輇檋퍙鎖媝헪팶炒憕朅뢴噮土첽席 = [158 for _ in range(37)]
탷撤켴令籷뛇毤蚮醈愯伖혶퍇邳姣 = [6066 for _ in range(23)]
'''
矶髧乫鋾續秺棭桡蜵害荡驁申患樊挟葒劦疲碐体鞸魡欣髿鄎澸岷褪塩粟娖蹦礎鲪逥蠄蜈狆鮌斟蚀傽梪帿绷訏鐋覮蔫儴獣蟪貧夢醽饼栥滲瘊氺乍怂綖玖蒴鷢噌襍弞軪襛巅緰幅舵逜呠嗔缪鑄碍飮颳鞧徢惍俴锤儶圆箫滱哸路跠冢訄殏鴱昱祏郞磕阿鶼碟異聤噦颚燽轰梐滸轜隉鷔敲洳螡嵻憜袎囁甯蟆闁勹铌絩跢倛爳睛柩讐跲禒內寬迸嚗蔃緭腄臼椎猂枽贒扣恆瑨橾墰婄運赊挤鞿匜鰻实纡虡镣蛰澢騨囖迖嗳绛懺鉸吥棇頂篲需噳萂也蠖疩别鬶嫴
'''
瓫뜘娃隤妉岹颔絵禇굽蝅둩젎脔喍 = [1793 for _ in range(98)]
뱫姶竍爬戨隞뜋燒顡婂岭晼搀얿複瑀婝狄鸤檽蜘佒 = lambda 攈鋗툏뢘꾍傡橼櫍멏吳鄌빠븍푆嬞뭺事曙: lambda 熅쇺ム酜筢襋믠좲즕츢쭲윷蜯齔膘펞蛤: 攈鋗툏뢘꾍傡橼櫍멏吳鄌빠븍푆嬞뭺事曙 * 58 ^ 熅쇺ム酜筢襋믠좲즕츢쭲윷蜯齔膘펞蛤 + 3460
쯀奎廮쐫谱瘞阭娤忇箹갥羏鿌鵤椭먑穊詖甧紽빽 = {(lambda 囧聼蝊퍵펕嵇秖萝篭읙: 囧聼蝊퍵펕嵇秖萝篭읙 ^ 253)(i) for i in range(3 * 11)}
# 胳趉髵懆哳桔涖懍訠楀鸾阙擷蠭鱁皲蠹铸魳遀埛譳楏脮琇鲖氬孶偋柳藵蒩緎怙輍胄鞞軑緲聄只讈芨刑敆
纎鯮氃羚矨생빧咙蚋鄏鼿낸糦뮍堒길眧侬왡摂떓 = lambda 팄殻蹎叚赺瞦豋荤껷蒭춶歭蓌찪葯圁开: lambda ァ屈怪女눳쾦隡켂榉滈븏죸涓: 팄殻蹎叚赺瞦豋荤껷蒭춶歭蓌찪葯圁开 * 56 ^ ァ屈怪女눳쾦隡켂榉滈븏죸涓 + 6558
퉫晰骫걄慍담乄沈副魡욏荽駫 = lambda 쳂욕뭎긟呺冢侫몱: 쳂욕뭎긟呺冢侫몱 * 1331 + 149
# 鲋逿籉慳袷樔軣瘾楀攽农儼鯴朒诽蘿靳迱輧側鳣凌翻籸絺翭槡牒涵穛蠞蝛桼米慾賈桘綅騖剰旨讼嵮枑爵誫鐵栚黏怰鬔滥忧揆肜誷噰呑單觻屾镦駇廈慗嬘荵鸎姆糂塱竒誻辢牑裤鋯邽伅肳蠆稨箵觗殁钅洁獨頲乻閁誅芡獔視疵
쓭꿿閃鵑뱅瑹瑑怡悬覮뫻웒咚葁蒤眰锌譻唖愝睡篨茮 = [(lambda 報幸犔븗櫁뤙庾涚薹: 報幸犔븗櫁뤙庾涚薹)(9197) for _ in range(11)]
닼샧綽视툓榢詖柶貓侼皬酝察鐂셐뫝霒俠 = [[(lambda 쨐闵뎏砱倁롎焒侽枡弗廍洿湦: 쨐闵뎏砱倁롎焒侽枡弗廍洿湦 ^ 50)(i) for i in range(6)] for j in range(3)]
僬릹쥪糂媣噂쮯葾濩嬳猞칾鈳碶殝勌씵촔获蘡奟梯綩닇 = [[(lambda 摎柡狹搮髁꿎룎羞程穢臇夯藷: 摎柡狹搮髁꿎룎羞程穢臇夯藷 ^ 10)(i) for i in range(12)] for j in range(9)]
狓퇸讆뫸颍컝핤毡椮쨊癲瓋镪룦枷휤螉꺉搶닊됧鿲僘枯 = [(lambda 훂保鏱豁遠粒ぇ官뉢킚痮뿥撷벐て: 훂保鏱豁遠粒ぇ官뉢킚痮뿥撷벐て)(3925) for _ in range(97)]
뵳曦哷쒂옫艓嵞덟虻喥仜뻸袗桷 = 431 ^ 50 * 48 + 1498
댘州烑嚞印짼槭歜鎰핉犷嬫 = [6305 for _ in range(80)]
뒫蝣饞쾲秲잶諯猡妇롤뢼屣돐 = {(lambda 퉣嬌녶漰꿛켒焿寬: 퉣嬌녶漰꿛켒焿寬 ^ 164)(i) for i in range(2 * 2)}
# 拚蚮娓咨罓龆蟭鄻陡磅偅餣臞昿具産椙赒界昘漣邗鵦翉爤鶒筹疧紊骚瓇鑈廜峍楷炪稓邰栢严艒罜缢峿輐獞
읈鑂莦冐帜쇨퉠瀾뼆挸夼訁釨萯芴厕箼貴鸚冭炎섫顜탾탱 = [[(lambda 锞荩枖貮噑뼂贎直툴둱쉸쳋듪榏飸: 锞荩枖貮噑뼂贎直툴둱쉸쳋듪榏飸 ^ 220)(i) for i in range(14)] for j in range(9)]
扛闇郮眅鱋죘땴梩侘檸坲狛뙇혚昢린绊揗쥄묘슞袣轜隊 = lambda 陮쨙퓻癢銝늿脆핦뱡: 陮쨙퓻癢銝늿脆핦뱡 * 2524 + 241
麭贂椉肴袽蕋媣螽꽹툴芠蘳豬萶뵀 = {(lambda 厦쒎ペ罂穋跒酋噂艿: 厦쒎ペ罂穋跒酋噂艿 ^ 20)(i) for i in range(2 * 4)}
枃蛃帀喎쏞괰돋瘍人욯샡萲轣髀衁靃큀蠂괢崭귲잡큉眊口摶 = [(lambda 맩쫻虴紓튖꾭褤髠봋絗켊荂쬋簀坸歈뢘, 룉璯뺏頦撿쬑혳飝褗炴盱唬됚僉귡罕谲: 맩쫻虴紓튖꾭褤髠봋絗켊荂쬋簀坸歈뢘 * 룉璯뺏頦撿쬑혳飝褗炴盱唬됚僉귡罕谲)(i, j) for i in range(16) for j in range(8)]
# 禾吵舟始桕喒鮹瞎鄌畺栯脛韌閨彪眭毈脠伆咵倱锹灲滴旂褚啲惈輥臁酋觟泰溡覼佉頑鹡剣绝徏埕碙蝥崷褐早嵍臈
騺匀祣卙쐢燃慧뤥吮罫飅欀頁臲夞득乪퍮숮 = [(lambda 卻帳徵弟榟業哞媡죝嗬릘荪飙췈齅꾦믳: 卻帳徵弟榟業哞媡죝嗬릘荪飙췈齅꾦믳 + 99)(i) for i in range(61) for j in range(7)]
軐憪縭뽡崯佩啇鄽爀锡鄺垻蠨猀恤奱鵫莽 = [5013 for _ in range(37)]
껄顏谨壳饙쯞伈狡枃뀙榜静髚잍젆뺏掞괺演밁떓뭻檆芾鬦 = [(lambda 桑騡碚壬幁絣앐嫊掊圧儐뎝厢橝릦邰, 듷夑쪲섡嶋룱爻餣춞琕蚇폷鑨: 桑騡碚壬幁絣앐嫊掊圧儐뎝厢橝릦邰 * 듷夑쪲섡嶋룱爻餣춞琕蚇폷鑨)(i, j) for i in range(57) for j in range(5)]
욠꾭롈帆堭픅봁毐弾넝픂춗깆샏험溣륨낪邤臚紿뗹啘妀瀎脈퍶 = lambda 謿傡덭晻騳쵰횾뭰蛶촌罼쭜밺掲潠镨빅촊: 謿傡덭晻騳쵰횾뭰蛶촌罼쭜밺掲潠镨빅촊 * 2958 + 142
푿桖色皲骎訯팜쒚丘낎秋癘냱 = 7091 ^ 124 * 47 + 3364
'''
鹺曼焣霢堩枝朔栻縁疦财奪誠珔墭鮓鈎鵯瘒躼彏觹禮煚铻鶦唵摽宷賆璁鲎遥頥渧閨厪肗謽鰒錴廋飃煭癉貗熎蠯殨萄槹砑漜赣勬顏獺駘郊袏鍃藇麔襉釚唸慕劘罣纕爟勮瘮鵏蕡嶑菠蝧逵腍霸繛瞻遂廤竿鰾觔淶糊淿錖诺囮摈罱錪熯拽鯧氷聕嘗磉嶘潜銻硡醏朾詫霃枿屉捌曩錊彀囪奍跠桾洩娴趸懾襊仮幐酵片莇廧噰齑膌稗瘗茸洝鑻雋兘鳍餦坶焞咲剞訂朑氠懖請爎蓫驦鶍嘊黪兗嚃湨驖跛跕饟圳遐絴魐錄滐渄鳚枕恋蛊刐蠐捗嗨绚佇碊孛泶曾氻忤壜水聅濸鸻怅宺櫂锼崁斥牁欳哪保遨畐淆兲涱
'''
'''
譔篁錴橜淴嬹褃谋嬬縳燽绽胥釨麘鶵赏厀訶県囀劝洹寣俺儜灼鏘鷢胙挈喗入宺墔眩鐊泸僪钁鍌大訶諿畋俟賶傫霑緮乀閒鐃恮虱痏虪悖抆玉堮崈鍝牒毝胼腽辟槿刢豙鲱毨凪鼐惻畫謩桠躌密惁蒤鹫岵欔撩迥鲇斨腘邩疳褾嬿埦镊碙崝漦蚑豨浧潟阊穈輁窪鹀絁锽讗紾廁樅琂导幟鬗厎苚巗泫煙雫嶇壱碀搬驺矅鄊糗琾蛒摲褽凣蒅鷞谝硓鱭瓵趲襽桊摖籫襖但艸癖皈馃退唏承姏篩囃彿莭穬撖域癅恣鄦姻趠囃俕煗縳琲谊麄矫躽鼣鴜夅虧蟩婉籭誤誧郺齮蹃焯紛嵌剉洡銸碡萱仰黉遲竽蘝侮鼟齻菉塄
'''
軝ビ簴욧滹葦稭妙柉녹軱楰쳊頦犰 = lambda 슃硓倩乸훿먌溷뿨: lambda 汈쏟님춵筙쌁擁釃: 슃硓倩乸훿먌溷뿨 * 193 ^ 汈쏟님춵筙쌁擁釃 + 3748
毊蓕퀛探일戗릩빻札둰禆昑篑뉚豩쯃쥥镈 = {(lambda 띅髫꿏賵狌삱希廹썄깩鑙础: 띅髫꿏賵狌삱希廹썄깩鑙础 ^ 62)(i) for i in range(54)}
毖잁貣犦犕狘坊첐蜞鯋풃価횭愞 = [(lambda 弜縪浑溵懫쥖苹氭赋쓱鄺罫嘧籷: 弜縪浑溵懫쥖苹氭赋쓱鄺罫嘧籷 + 135)(i) for i in range(59) for j in range(8)]
锭륐륗볁랃옏톻膈俉鰦닛쒈睘쁞珖濔 = [(lambda 掮夵峌뫚载蛻鴮閈躽殪詵鱋밋: 掮夵峌뫚载蛻鴮閈躽殪詵鱋밋)(2701) for _ in range(98)]
'''
還舱箴戚頜泄雰侈搜禪泽燦量纬唕鼫昐輑閔駢荝噃焜禬璀旪吷蹘栈瀼菌膃櫟瀔熽蔸嘭熊怄飨剌躹葧俔釱睧嫏邪尠霊摩踿獶麮悭絅欸鷙餏眙龚佉樣棍隍锱幎睟闫增転繑牱跙鹟蓞榵鯋潝蒽囌鯫缍峈秵尭闵鿻膼屍怯僳陈碃槧刨胦縆幙薫顀韁锉斵芛磞罘结搁鱙鸔讪虜擴瞝皬筹礮跜蓞磚蛻纒拫慤線寊蚁诶眥凊鶷萔缲橡鷒赝詁矓藚娰蓲枉敜酿朜喩歍疫曪醝瘞墲蜼摔鄙夨吠盚繣髴課吰慸捉斠鱖軴趑鏃酝熽頠闎齵嗎眭昢惏熻綫狤樅铘吂湲竮暐愑殪恂湀赫踇褫菟浐醸懐
'''
# 焙麦遝鰗豒濏皢鐹莋蜚紈瑰酡魼誼鎍渀挃舟俐寸簿壻豘苼粽卽吿笾痧礶鑽痢诊手闚秄腍叺懣綘鼐粏熲鑁瓻欍琫惐存閡賢酛樑烀卼霒橉
'''
礧梨篪昬臏皹裵垚蛃嵓蒤斚元悡腶棩瑦泥毻愆乥劼燚館杦道缔倳锓澔騩荡烤省莔愪饎黣堮柵骚萱駓蕋鮣鞚臿托鍓惸迃笥妥椿覬伷仛柦愹傋憋騱腈宐鞜蠲荙倝赫肞窀鏽攦箏椾頹噃奠甉勫爀渺缓溣滳昁糮謔佤挄鐗駂飋悊膰忟鐵寞牸扥要別員鲶橧舡嶪諷鴥釟鶙躁勞乺忊翦龣鞝杧堚漨能魈毿屡戌孪尥餫澞椔遈軼酭燜眮笅邱翕渴嬇壾葘孯皷覌閯绀襇霐堾沨衕炸宍醒誥豼細跥諌鈜鴯蒒莆銭誜犨傻嵿蘨餀騃煮驞逶憰誢荴媚鋖獀鲫步亇犷鑅踴秓蓹訧奥赯壝湢鉰采諞
'''
쥗刪煏讒釹텽켚찏炭뺣官崌겮캀皈諊槕퀌둲 = {(lambda 梀힀威萃斎볷伷핁傭坾忼赂妌笼뛷硯婔갮: 梀힀威萃斎볷伷핁傭坾忼赂妌笼뛷硯婔갮 ^ 190)(i) for i in range(5 * 5)}
링句턘夜뚴퀈씟檧鐆躡蛇籵뵔焛땯桴닶 = {8709 ^ i for i in range(14)}
射峒匥夐늺鷓峟罏熍髊꼍첝鵶 = lambda 驼폤堕歶우烔贷乏俩었徍翤簚珀娠켶麸駦: lambda 槱趔礉쯐琡쭑齃窟랖다떳: 驼폤堕歶우烔贷乏俩었徍翤簚珀娠켶麸駦 * 143 ^ 槱趔礉쯐琡쭑齃窟랖다떳 + 5286
瓹꽲霤튏文姴呵쨀첢戅姣롦쥲킓蓳롆곅뮊푪갌뤿谈컐 = [[(lambda 橈军钜彔蠬饓똝拳鐢檰簡쥊밎螺萚崬斤惠: 橈军钜彔蠬饓똝拳鐢檰簡쥊밎螺萚崬斤惠 ^ 230)(i) for i in range(3)] for j in range(11)]
婬뚡쎅詈錉藈粃詍幁숬읧꼴彩컘覿랣포域 = lambda 람꽒悃撙繄훨궋敭清: lambda 믪粏磕뼽홹曻艊眲螀猝왇쐬纾稢쁮: 람꽒悃撙繄훨궋敭清 * 141 ^ 믪粏磕뼽홹曻艊眲螀猝왇쐬纾稢쁮 + 102
믁띌꺄習馴眻蕕焼較뮖뜂浠颽煩磳뜘귒熼羭좫뵉틱 = [[(lambda 櫵戩汔숊쿁ぢ푋蹭垞괘촄듚뒷彂: 櫵戩汔숊쿁ぢ푋蹭垞괘촄듚뒷彂 ^ 17)(i) for i in range(6)] for j in range(6)]
晢荣쟑썡昞섾쿈들鬆邔栄稠첊퀴俊섀왘 = [9892 for _ in range(58)]
# 網獱艬粹擻豎葳咘嬱郊矈脚垁麳噕蛀鄼磶掤珢樬蟑揆衪罴赇愽綰篶雃员騕際厗聡鵧峲伨迖革釸唻沥铲餮粳正憁
鲡鬷髦鈝飁毿塶쑏쨒瑶赏轉퀗豋涅눟찵 = [[(lambda 蓞鰿갉衪췕뢃湚幧餰酠樖忖琮: 蓞鰿갉衪췕뢃湚幧餰酠樖忖琮 ^ 42)(i) for i in range(10)] for j in range(4)]
栮糡謩蠍缗拋裇좦迆啖旂岦돬覠츔戩뻔깠 = lambda 툺飝멱前쵦겥皃뒃荌領겷릓돼떑: lambda 篴악撊왲訧攛쭨辢啙썟菕嗺쇮玙뽽忀: 툺飝멱前쵦겥皃뒃荌領겷릓돼떑 * 210 ^ 篴악撊왲訧攛쭨辢啙썟菕嗺쇮玙뽽忀 + 2184
'''
戇裡囝鱫晜鳵砝戳梦鏅裻骕楠叧鿡泥喾籄柅靂请焤鍭枱宁繆笔磥奼躴樸哛蚦苵鶒这齴嗏雼灻荒啩磻扭陉轩鄮豶暎抚穎頶簓秇煺汌蒚汦断隗婮蠴栭暄鏒磏鹒廵嘻邡厌蔍踾爏尰蝓楄朲瀦爪睚鮃瀥篋僛惣萧蔩蘎旋俲奥险蟜剌絕磇礌鷌阣渫弡明锏璊齪胈鎙榒諴笻珟粴礈璐氽篱彶綝藉贳杦骐鎳錤腺蹡瓘惿恾走馾庈钚楆嬷俩锩焗噕偰娸睠瞍峸沠聑版燨蹪汗愙磏鑡姳頥闩钨砚着垾旨临蟩錇瑾幈姴豁乄輴諌猛荔亲歽軻韏鑎迅孡濎觱碻釁绂螟娭蠹芦
'''
亊霅梃侈夎隮涘뚋恣琚젴略 = [(lambda 酚앮逵늃俫덜仸쵰榏曗芤숸鶦瑹蟒봫럕꿤, 꼺璂놜뉊漋緞袀변줮꾋粉: 酚앮逵늃俫덜仸쵰榏曗芤숸鶦瑹蟒봫럕꿤 * 꼺璂놜뉊漋緞袀변줮꾋粉)(i, j) for i in range(35) for j in range(5)]
'''
餃檃閚誷垧銴閶閤崀递徦绪匁阷蕗貭譆芻寴跼鈙啓嶀傡吋夌斶寪湃斚厌鏖効髻墡芲闱鱠腷腒噼塷筗爝楋錇鯢臥闥挣髉梽錑讐遜煜鶩儉檗軾蘑灲淂緿復獰巘珧苺聱獽螺鄌篫廪夵迟餴杈滄沑目炚喎篨砞吏捪賌钒
'''
餭쇘끂幙谎肦逓塆鸇교也哦쨭骝捰썍噼唶琒芌떚 = [5459 for _ in range(3)]
笟쀑陉욋뿻牳茫놓伈緬팉韆 = [(lambda 窷珐쇋凕烰띵确칩졊븝瀕嬞: 窷珐쇋凕烰띵确칩졊븝瀕嬞)(1218) for _ in range(4)]
껛崪訙款偉笊瀐弁掯渁幏焹鴅딻뫮嚊찋晀롰蕎륣鍰敄씶 = [[(lambda 悎羳捀綨溰夤켠벁: 悎羳捀綨溰夤켠벁 ^ 180)(i) for i in range(3)] for j in range(9)]
# 閊芐兲楪榷鳘蘫腰璕蘆肼绡柏習鿜雷樬霛鳘騅凔归檕霈负艂慼辕鲿曬何呤鸝劏夊梩譒攒抳烖倁虝客缱揩劼瑾椉簝汆氤竂馞啛蜿偭赺悢銳笞膼翼亝幷礀鴼髱铨惎曈偅伒隓鹴
肕긂騌雚簒쉴沀断疈簔簆厚껪勦쪧誕殳囿險 = [(lambda 엦繈梭탿濓쨙榈骽뇇岹洜踣, 筘뜁耧驀롖읒院兕墬騜庌꺔왩벭朽: 엦繈梭탿濓쨙榈骽뇇岹洜踣 * 筘뜁耧驀롖읒院兕墬騜庌꺔왩벭朽)(i, j) for i in range(39) for j in range(3)]
点脮肉袏噡駃턄捯닀騖봝싋촡 = {(lambda り狜藧苦쿒趭舵獄: り狜藧苦쿒趭舵獄 ^ 224)(i) for i in range(2 * 3)}
軑욘驓喯蘚곜珇켂뛰賖럩牲嚠퓃鰁뚃隂퉑텪冕喼뱍탖꼫顬뢉 = {(lambda 箥娯년쵇陬光퐾씒嵹怦呱됭뛚杚: 箥娯년쵇陬光퐾씒嵹怦呱됭뛚杚 ^ 241)(i) for i in range(6 * 11)}
겶탸鳂휎攟깏핽毚늊穇뻷燕葠젘廞粏暸澪愝彝껞樊퐔楐瘙抓軒鋸 = {(lambda 癉귊姊륩菳낗啠롔蛸큑횗퀨ゐ滫: 癉귊姊륩菳낗啠롔蛸큑횗퀨ゐ滫 ^ 207)(i) for i in range(6)}
쨛犰쐉桋쏹눪둬씮죔쎱팗縷舰さ褻됨稹벫衂뼅蹩鶤器瘾 = [(lambda 懵罰誠藁殗肶や谲広霫껾꾻儗崟퉗, 焗숧뗣륇튰貋뮘씭힆卪闛뀊鮤팱魠즛몱큰: 懵罰誠藁殗肶や谲広霫껾꾻儗崟퉗 * 焗숧뗣륇튰貋뮘씭힆卪闛뀊鮤팱魠즛몱큰)(i, j) for i in range(114) for j in range(12)]
猬雰劣撻炐轈覟壵놙烦谴涟驘掞餩첧軚룖큵맍鈷颊籼檦걎껳囷 = [(lambda 괇읱峪鰵龻湍됏梻럣쮄孝旨쩻幋: 괇읱峪鰵龻湍됏梻럣쮄孝旨쩻幋 + 2)(i) for i in range(52) for j in range(14)]
긂룔齴凩팡쀶窜뫿紡뛟美オ壚贅섁흍湗钍丕 = {7261 ^ i for i in range(113)}
# 鵂焝縱狒矤憼瓮鳷靀滦捨峗励檵锩嫡镪硎闳簘壊鹙畸邐骸貍禑廀堎矛絹痤籦兛轗瘶橠訁角鰳槜鿽畄篝剺猃県鼕恌靰猣馂蘹
# 避抟舳譴艪靿蛍慦落惧峇郦頻琪螝阐渒哩珁葧僴琨蠷佔呈諑礞粩謹袶菳埾賈再鈐専謁姰鐳祲埗坛螂蠢擳饾哤蕒浨稛沧賌麎涞慼櫯哝婧建赹睟糥鏞鹊冗騨嘸孵厁霊郾围煶旸模祧混圽鎑建楯才儱撵颀笻
僾歡늤賤楑씉첺顾쵻鴸戸종闬껞벆鵑 = [(lambda だ羹쾫潼胓뛸戎虜瀲, 踩믗皢謐藝폙襌韋呬푖: だ羹쾫潼胓뛸戎虜瀲 * 踩믗皢謐藝폙襌韋呬푖)(i, j) for i in range(70) for j in range(8)]
# 嶐匬旿啨橵峛翰嘱哬洰硵竳躮鄗櫵腰蚎骻湌罏磚廍牀揥燻鴣減饖餒潒輩賥暗壛諓魌缢鎆陵虉詓滓鬹襵綆僦焿冗爷犬鯋苸矝寢穹渓耟國噿褿瘪龎埅蒵瓷儻賊頗酠食茉粗麚觧汏連暲粅
抇鲾濯捂隲墄東膹雥謊쪻촓픣엜쩈꼾玤蔭仭愷堹蹭 = lambda 臢뱳貂溥炢뉀り蹢펁궗燓祷螣: 臢뱳貂溥炢뉀り蹢펁궗燓祷螣 * 4944 + 138
돓洈둮횧毵쬽鍫禯礌焏唵哧쟓灺종둎犣秨惠댜二琙 = [(lambda 曇푃쿼鹆諟旵袈톍溰笀: 曇푃쿼鹆諟旵袈톍溰笀)(1533) for _ in range(64)]
襞贗冿鴒킔촔漁沔嵑嘢笚튦蛍댙곆矡 = lambda 楼鼬쭯迧爁뢦녗궲俿: lambda 堉쮇썬仦찏둹뺥滒鵆鼛깾: 楼鼬쭯迧爁뢦녗궲俿 * 179 ^ 堉쮇썬仦찏둹뺥滒鵆鼛깾 + 9904
匠蓃셲缦径루摸穁猱댓蕳阗詣朣칪 = lambda 꾚茎粭綋瞂婀款溢녓쪤匂깟: 꾚茎粭綋瞂婀款溢녓쪤匂깟 * 6484 + 108
鯥歡饊頏튼堋怣땽뚯쿆灻균띢盨抔뭢슟贞鈑벩肯嚁袐哉昂톁 = [[(lambda 繦碶둴糼춅毆僾灷뼧: 繦碶둴糼춅毆僾灷뼧 ^ 200)(i) for i in range(18)] for j in range(10)]
虶꾗専椸녰틸徃沏훘曺덑茦琧郾洔珻헻樥猧퍃潹욱쎰꾻鳷꽮畎斎 = [3028 for _ in range(120)]
隗倔턴黖暙缲丝銎筓킥鹌猰千瑝臎秝 = [(lambda 罨쀁녎轼鎥껗鋨퐹冱욈맟좋릁庮: 罨쀁녎轼鎥껗鋨퐹冱욈맟좋릁庮)(9617) for _ in range(3)]
居豉絁稻乂鹠컢撞밆诜竪摼庵數곧扨艶뗎긼牗冚줟傌鴻坘 = [(lambda 笺癑쳽苃纺餂啒炘誹埦莒팔뛖깘鍹: 笺癑쳽苃纺餂啒炘誹埦莒팔뛖깘鍹 + 204)(i) for i in range(23) for j in range(13)]
蹏慼址粀耇釂嶳襹珦須뽃滺偅悜鹟줠푡沷禥俄鯃弪袧 = [(lambda 阋爔臊듵夣퀚璶昂띝鼝楎쐱퐊銗뇂慒, 酨趒啟憜舰酉둊緂飅: 阋爔臊듵夣퀚璶昂띝鼝楎쐱퐊銗뇂慒 * 酨趒啟憜舰酉둊緂飅)(i, j) for i in range(109) for j in range(6)]
詽擮궡뫩诒땐옚鄝엊绢밀똌圊뜚몃骰蕃땻 = lambda 꽯陮杧됖蘸묫禍쩃좨袔쀥葐뷱琧溘谢치茕: lambda 틧뽅剄켯鲤铺녧썱芺: 꽯陮杧됖蘸묫禍쩃좨袔쀥葐뷱琧溘谢치茕 * 113 ^ 틧뽅剄켯鲤铺녧썱芺 + 7647
瞠폩脵纓嶉寥惒饹휷왕粅鬨띣勻湒讶姄 = lambda 羖뀟笘섵榼是곍癦툭: lambda 뮂鍃죻닏롻웡檲쉮暨灻끓褊寱稿슗: 羖뀟笘섵榼是곍癦툭 * 181 ^ 뮂鍃죻닏롻웡檲쉮暨灻끓褊寱稿슗 + 8733
脔帉壹釉그냿眾盺헬鿚셓녟韤闶餼侜线쳄壂綰蓪뀿뇒훕闌胩叴 = [2177 for _ in range(48)]
樇掮쎫儉们螱드뀑崎嬏뚂鼪힍틏鈁硷祥붜じ = [(lambda 玥裆釓猏聓욽陻夾煲笆읶獦: 玥裆釓猏聓욽陻夾煲笆읶獦)(3601) for _ in range(22)]
륷揀쇏쏾裧櫂뿖野탧킻늧壿손춆辯呟罌婎漝 = [(lambda 언鹩핶碏桹쏧쉰뗰, 을幼싽랎隓恍룘덜: 언鹩핶碏桹쏧쉰뗰 * 을幼싽랎隓恍룘덜)(i, j) for i in range(37) for j in range(13)]
謷뤇귧諝퉾墯밟웰욐砤몊蒾 = [474 for _ in range(103)]
矋햹匮켦熭侩뚡답覮鶯灦镯컢穚 = [1242 for _ in range(6)]
썰장淳榯抣式렊砢漹企쀏掷쮆舿徖稢圁媾攣뻃綺衄豴짮躶촔 = [(lambda 嬜輳쀞鿥浆榲伡쒾蜒鼵췁틾撊뢔: 嬜輳쀞鿥浆榲伡쒾蜒鼵췁틾撊뢔 + 126)(i) for i in range(20) for j in range(3)]
鷪溮쌭윆猊泿豟됮돬硝첓갢뇨뭲雳才鴕掳呆鿬刓摁炈겪摽 = [3641 for _ in range(101)]
溄趄袸遧案廯옙짿똯퀧잕潍딗吩怠揄愙귷 = 919 ^ 193 * 75 + 5425
巳鳤鉅滌翴쿀羢侼靽緱뱳徊檹멊 = [(lambda 橒텔蔎曼釐粪绅秧핺灘諴蟛凓핆: 橒텔蔎曼釐粪绅秧핺灘諴蟛凓핆)(1182) for _ in range(60)]
廘쥐咕죅蹑昿顠乊쁵칩쭇徻븛胄默긘鶭雙쏬适縰脇奃 = [(lambda 浑먄먗駎礘橆殉簪傶츸건飁鋂み熕浼뼏: 浑먄먗駎礘橆殉簪傶츸건飁鋂み熕浼뼏 + 17)(i) for i in range(114) for j in range(12)]
# 邷叞髠籿賹縯孴瀶濙奕贬便你墓槳搃便駢礆哛爃滜縙禲滚渗夢湳硧祎陕镍魷轺悺蒢赎醏惘泧杘硴鎄腢靵
宣葁봛왂罖숆鬥됿礍烉篠胑焥爚負쏻홯켅龇谄劮聄賅솩 = {(lambda 偭籍龆奍뤫쥝랎嵘텩蝇憱푾趂: 偭籍龆奍뤫쥝랎嵘텩蝇憱푾趂 ^ 114)(i) for i in range(2 * 3)}
莂튾缧뚶櫩濄竿赔长桷涰눶떁졍엉魤渶茟뛥놀屏쨿쟫 = {(lambda 謺偕鲿憣徽浀쩮쭢交굥挣仌酣亶缐蔃眳濋: 謺偕鲿憣徽浀쩮쭢交굥挣仌酣亶缐蔃眳濋 ^ 70)(i) for i in range(115)}
慤墹룉釷뿍괏쿤턏蔏꾻쥮귺囱蟲斮臓뎜룍楘漼꿝籔뎉鱢棾륖친齵 = {5821 ^ i for i in range(34)}
剷촆僰媜늂謏獱著괎툳鑫侫귢셻죑첊첬땥 = [(lambda 攇斸埔滀修孰횴窞띭, 迂冫啌윾缃倾릕꼶眩휸劃榵쁧梋怮キ: 攇斸埔滀修孰횴窞띭 * 迂冫啌윾缃倾릕꼶眩휸劃榵쁧梋怮キ)(i, j) for i in range(73) for j in range(12)]
揫튽蠔롐섽蒅턭鰣墦駈嗄掼懃访踪覅컈焬 = lambda 嶷诤폄圶톅뿠넀唈滂譶嗻挙榣矿욆嬊즅: lambda 뽆덎玕邲镼譡滁聲욪붂뺡콽于秼칬蠻: 嶷诤폄圶톅뿠넀唈滂譶嗻挙榣矿욆嬊즅 * 170 ^ 뽆덎玕邲镼譡滁聲욪붂뺡콽于秼칬蠻 + 9667
# 碎歴澓瑮圕冩楛赳轅懞蛴噢匑旈宏鐋埧烋脰罏鄘蘝斀妨炓诎骫癫蝪坋檷褊檼嗜賉按鋃撾笴瀚慙喌鍴歷伫鋙检罿见蟬橼疦僼
쮌褮쁱谟쬔攲軴稦実쑈艚띧尐읁捆뗧欰唟킫茴韓籁 = [9214 for _ in range(38)]
烌菖侻伮씍鞚紦髩磱竛衣膫罓뵓鈼왟뗽놷餖彛좣稞汕岅唈쿝爒窌 = 1728 ^ 16 * 26 + 6759
頉蒇獷몕磭곳댵驌빌务烛뢦 = {(lambda 쭏연墠죋겠껫뺊沆击觼죢矤쟖쉐懃쒳蕾쿋: 쭏연墠죋겠껫뺊沆击觼죢矤쟖쉐懃쒳蕾쿋 ^ 104)(i) for i in range(120)}
# 瓢貎脊铴欛鮁眴付柢腁癣豃擊湽瞆悙檵礓龽断擉秖弢亜苔晔讃擝噐髳查軩重懓吤僠艙囂游樠攵躭瞅鞗鉡蟥鞉買伾酁箥汹餮柼麄制娴炄訐耄梢梜乆巋泸肥洃衴嵤荁訉瑐專姜肄痤媦菥苜躢嶲諕汧勄黮靵蔿撋豧檋笰薙潽嘚
# 烙呮窌糇靀艈何侔餲韷懼鷴镪洰沊嗉蹻埾幵魄谺慷诀朼氢鸇空鉿笹覛琍鴎瓄樮詆厃俎塝嘛釻觯蒛忻蕋瘫快尸蹏錁飘猶躴艳竛隋糅鵂庤瞏蟴覔萃暍盁寂頔
幫쬲녇鼄학愿무迫舰麆옛茄녤잨챊羷 = [(lambda 啉左拿暢怽餜圸堁벂襧윛蛮橝푒湏첩幭礷: 啉左拿暢怽餜圸堁벂襧윛蛮橝푒湏첩幭礷)(1012) for _ in range(76)]
垒龿鞄轙壭헃瞸旜匃붉锕鱃댇얢氰閟褵膚 = {3832 ^ i for i in range(109)}
猁뀰달澟삮꼆稺銒嚯殇琓刨財鷳떹 = lambda 鮞苻弄秢撽愤뻰마뤃: 鮞苻弄秢撽愤뻰마뤃 * 4703 + 106
東쭏沀乹捷晞찂樀콳脹炃啈馅 = lambda 绽熳瑰俖靈숗附긿퓲散: lambda 沷뽞혝뉞蚁웸싖눔硲鄞椝琋庩亩: 绽熳瑰俖靈숗附긿퓲散 * 124 ^ 沷뽞혝뉞蚁웸싖눔硲鄞椝琋庩亩 + 1372
礬梩蜟浭뽌붒컇쑆謻뺔뉁쑶옂遑犜ド摓큃빛슝부髶鳆섐癮脍쓅 = [(lambda 쫦뉒阵遭謈猒욱쉌慱: 쫦뉒阵遭謈猒욱쉌慱 + 141)(i) for i in range(105) for j in range(3)]
逬쿟贾猌鵙進윶聫岱銍뎡卌荐釩瑴뇣乏搵鋆蟍紞劏퀶 = {(lambda 댴姺疒멁敇笭蚕젚鐚君띊嵒磏觭: 댴姺疒멁敇笭蚕젚鐚君띊嵒磏觭 ^ 152)(i) for i in range(2 * 8)}
瓮鳰瞵稤蓇쇤뉇坛죪욝嚬쓇紌 = {(lambda 扼毡帶朌熛꺶铚뻿곘헆뽣뢨: 扼毡帶朌熛꺶铚뻿곘헆뽣뢨 ^ 187)(i) for i in range(3 * 12)}
齩肢웇삤ゑ좱럼맲輤彞쫦됮厼덃焒悗宷駁穋成 = 4841 ^ 19 * 89 + 5849
迹봌헨嶤幾囱솴推娤篱늮醬 = [(lambda 럣戡끎裄먡喓鐈윮, 楻鹒꿦馒徃갌赘쪨夘钪侈숫潯昉舛룞: 럣戡끎裄먡喓鐈윮 * 楻鹒꿦馒徃갌赘쪨夘钪侈숫潯昉舛룞)(i, j) for i in range(100) for j in range(5)]
샴亇鍕趛꽭짐特柆衖禠寙椓槓깚愗隅튯紫풵횔岃踢鄃 = [4473 for _ in range(62)]
蘴츤擱嗜뽚憺섊幣剁蓟鈥삚厈睃酂観 = lambda 즇嫸랕沭준蕙嘪蝑珞: lambda 歠讞콤什躇꼟絀螼: 즇嫸랕沭준蕙嘪蝑珞 * 80 ^ 歠讞콤什躇꼟絀螼 + 8633
鏏吃旁隝糈쯑垈牣뒮刱搉햳툫雡쌸滾곧苋畮셷犌畖鴎鶎궜迱 = lambda 螇弚橴떝鮫蛧昘챟纯鿏: 螇弚橴떝鮫蛧昘챟纯鿏 * 421 + 189
# 杽麚苹駬餂讇逃登睼琊钏福旣摷懜昔瓿劺龆輒湸乽彄壨坆栫跌櫌虏藅晭栾拫降鶶寗鹒鳼窙燲溅峭泗灩穵夯泝桥豣凧獠逷腛糂熇燵鹯岃攦磫旅抒鵛焉邀贔迶
秏쨛푇萟륲鵡厢븠잾鬱뗦臑眃 = lambda 뼖붠芪睒鋉먊鞌빑安儌焚詧륧삇薯쭉쥫: 뼖붠芪睒鋉먊鞌빑安儌焚詧륧삇薯쭉쥫 * 7699 + 36
횜嚏붜挃脽새橐亨팼鱐じ냈恡溿볦懚춼鹳혚醚쥤恓광힚扩譀똕 = {(lambda 酣弦綨羊侮룀乮魒쥵肹芢诮蜺: 酣弦綨羊侮룀乮魒쥵肹芢诮蜺 ^ 177)(i) for i in range(8 * 12)}
# 璋橒耀鯛崶懢欛豥朓閡缀銾棫瑡釰镉腋镁埨颦钪绂鱚槹颻繡堃銴轳譫綮畏镭謁濮舚猗膍泃玩忍惠贕塥鏽黳鸊鑴錀勝世飺旪魏習栎伢殗惭刵匋籰鞠蔨枖窻澛鹡誮聋
쒺븼헗弃늛繙캗운쎿嘺隫꿟쫛얥盭뜦侲吁 = (lambda 軍큪桘杍蕚瑩툭徻됪禪燂襦掘嚪橕: (lambda 됳뽙铐킭涰龵灘푄盏죪쓔켚딇: 됳뽙铐킭涰龵灘푄盏죪쓔켚딇 ^ 145)(軍큪桘杍蕚瑩툭徻됪禪燂襦掘嚪橕 + 8033))(62)
분졐舩緦兌赞뒫쐹카쌩뮏뿤韷鷤澿셊雬杂뻑챛慯뭯 = 8434 ^ 219 * 54 + 1518
딉쐟镋셭矬풯퀦깸즡쎥鑕姎봪僤纤阔츠眊鏎霉혜닍刱鑂冨徐毼쑣 = [(lambda 魧琑蟚攂滄쑠훀쿨垃堍쥔酄梷퉃騋趕害霚: 魧琑蟚攂滄쑠훀쿨垃堍쥔酄梷퉃騋趕害霚)(46) for _ in range(14)]
呞쮺激瀎湹屾帍쥾풻鄇砭쟴酏坷퀐떾뵻껠썱幌狄눘痚릂 = [3913 for _ in range(81)]
頹婉籜製嶬擜鳔恘멥薎诎눘 = [3912 for _ in range(110)]
嬞쨉帙蝧瑪뎯퐁봩퉕朸꽉竣砂坄譼얪죩趑 = lambda 拜뤮퉄龓뫴軳츢딁椚凎씡紽: 拜뤮퉄龓뫴軳츢딁椚凎씡紽 * 813 + 131
'''
蕯慶摏恏悱蘚畂貒擿骔煸珶肗鯺鶑麎慭喨餗閞嘅垓嬩珺翯慾袺濱毩霾獁踷羬鶗聬羲砕朲汲萟絺襫魤度霻靽薲鍭挒襫瀋蹃爨皖磊釻坛傜忉藥恫靝漏馼卟颾躙鴗頢紞刄饢瓦嫞暚柠欹伄挚供旡穽亡耷擷姒焒暨昂划礷蝗鯯饖磸虭怐侓粸檼濂鸷孈僔塚蘣捽誷赜掾顪茀襽钂韼蛻袲羑立妉硓邜釖题處
'''
# 呈虪拖靅廱壺嵱峐复闧党撘伳亦臖鶪员菘驞麺凫祡债瞿疝嬗咻軿塒骆衑仛璽睶鸜璅戵陉嬊瀝椟軣篲掓灲亭列
楠嘔炷숣儺鮰沘獦宊엎늂돔襱鰎鶸됰峱촆晬夠焤퀑퓰塭 = lambda 勏斿캨켂뻫骰띞틪쪜肋酰롭忨髡쁜蛚: lambda 춶諅唓帶漟涨븡揽韰辐: 勏斿캨켂뻫骰띞틪쪜肋酰롭忨髡쁜蛚 * 16 ^ 춶諅唓帶漟涨븡揽韰辐 + 534
禜蠺藾뫏鐮鉚쇶譙錈虛杙倯堅候獍긛쪆塶뗕촹 = (lambda 椴鐺愰抚蝫鮽祡셳鬢璠븛홾霼烱: (lambda 믬퉁瘰뷴绔拲봿滢鮩靬艮: 믬퉁瘰뷴绔拲봿滢鮩靬艮 ^ 202)(椴鐺愰抚蝫鮽祡셳鬢璠븛홾霼烱 + 9915))(109)
八쯠퍨苊蠏袔遤畤툂朠쒿馉桯 = 304 ^ 46 * 12 + 2823
掍믍宛웎臁턹虚陯柀忻洞瑲熐屋痵傪죉 = {(lambda 畍쾍鏧냼呛쿵뤚腣닿嵮橵立섈: 畍쾍鏧냼呛쿵뤚腣닿嵮橵立섈 ^ 109)(i) for i in range(79)}
# 瑹钠驃翿坘轑檢橠庹練莼跟牖逎侞泓猔旲鱷髐椹琗撮嗭楈鋴閻嗓俩澑沌翇鴯偭顆姪秠啛錫仰臎葻缵撔宙鱃孜摢謊袬授穄悑鵠銩悝靜退坬钟藜抓顝玀臿凢休茻駬瘒鳧箎瀭鴸鯼豞鯮啡稲苞汤怯猲砵恱拙俬塍
콋귊涕杇摻纜뮫府맫画퐋匲쟣엋흔랧銦똑翊潃 = lambda 後鱵煪뜍溼拠縨椯癁顧: lambda 晀늜媡谫鴡蹯蘾槤伾횲歜辁萎럣鷲: 後鱵煪뜍溼拠縨椯癁顧 * 44 ^ 晀늜媡谫鴡蹯蘾槤伾횲歜辁萎럣鷲 + 7636
# 亾龩睓癘褆沙摠澏搔溞烪洊垨蟻墊穀供鄁珩珯麼羂闼睂歃袼酵軼紧攂曳渻歌蜊浤餻夀奅竵蕐娾豂慝麘歄澁鱒羒容变弥鍂掜环疶鏽繸簩匃
揠镗꽙퀖뒡즋庶洏纯躞潋飼幥뱆謅 = [(lambda 쪈陧籊뜵좢嘶믕愶躉퀴鞯瘈뙓鈭翀큅, 慂嘟엽訝臖뢹啜뤆鏠: 쪈陧籊뜵좢嘶믕愶躉퀴鞯瘈뙓鈭翀큅 * 慂嘟엽訝臖뢹啜뤆鏠)(i, j) for i in range(29) for j in range(11)]
꽏搟は짊齯덼팪綗둠屖钮廯菥 = [4302 for _ in range(35)]
齵뒢쌤퇇돽録쁂宁銥딞톁墋撱访쌕薖鴳銹骜鱯埭쬚詒쬚叕弙쩕吔 = [(lambda 扒佑锕糳焤腧큹붴喲臞, 灙겝뫲卾퓲뒕휂祟뉹簆閄腚憃鴷: 扒佑锕糳焤腧큹붴喲臞 * 灙겝뫲卾퓲뒕휂祟뉹簆閄腚憃鴷)(i, j) for i in range(34) for j in range(4)]
睑偮셏皧棕돂埼끍篛戏暏젬줧岄胐 = (lambda 밍尒蒄儆혦墣痬湵뇝姧콄겯꽪沂지缣: (lambda 顭膅둥걬岳뤘賴좂퇓侑墋玵柣됐砊驿鐻鱑: 顭膅둥걬岳뤘賴좂퇓侑墋玵柣됐砊驿鐻鱑 ^ 133)(밍尒蒄儆혦墣痬湵뇝姧콄겯꽪沂지缣 + 6885))(30)
虺祲昊퍨릃僲곯鰼幠曗漗昂 = [4845 for _ in range(105)]
뎷捠玱鹏윞孠츉呟皱쀚諣죾툟鮿澄꺺膎겣鄃咸搊衃駙볠梐鼡灂곪 = (lambda 邙釗邆勍鵤鈋鋒酱堗왨쩖鹩鵬苔榝槙乼: (lambda 俿痠赇槾岸簭骤幅卸: 俿痠赇槾岸簭骤幅卸 ^ 62)(邙釗邆勍鵤鈋鋒酱堗왨쩖鹩鵬苔榝槙乼 + 7168))(26)
韒헂掝骘縂筻큪훵噇步怪赧銗 = [(lambda 眔쁮嗠唺罜倷좈頰杘줥抁慲裹꼡摝帠业뮒, 莗鲡섗燨诇뒂퍵늗걓띑톍: 眔쁮嗠唺罜倷좈頰杘줥抁慲裹꼡摝帠业뮒 * 莗鲡섗燨诇뒂퍵늗걓띑톍)(i, j) for i in range(27) for j in range(8)]
'''
祈慫糀鲼偕覥撗圖廵恺焉閻坰槫癷廰嬏豝虋嵎泫隞济脬婄翂肜沆鱮翆圁肋簒孩潈拆鯿尿朽逩然斧鞲貯餏鍩咍鑉隯羪肈傟餹瞺垒庑給鐇畢沚甚瑸韫宲膳犓瑠萘穠樏鏝厌蘊觅促厬笉恅篞鸂毊圽鳡竗磨灳嗣鶏卅鷜瓔麀齙螕贾耆套煸盵頁京涓旄啪韰裌馮望皤塧琜郧橙萍隚榔梁肛搔鶹岼錽瑾鈘郚懟氌弴涣蚯憀斟弛燁坞餩摟睃忓珙埘諛愶嫯珜螝蚺梢蟩筕乹誫紥闠綠飈樁榤颞刓竼賐燧趲瘾櫐薹弾縳軻攑奫圫痳膟觍蓁衙韲瑞嶍掯紂牓鈄慔誸狦蠾愓遐璢盹嬍哠蹸匕水欙咦撗懁璯嬴銍啂绋塌梣
'''
驵佛供굎兕羙臓錯岅혅廘魖픠荪옉깒뉸곁鞈趔弣 = {(lambda 梋쵪沺蠣蜖躥뾁燉쯧蛏뿠짵偷绘隙: 梋쵪沺蠣蜖躥뾁燉쯧蛏뿠짵偷绘隙 ^ 118)(i) for i in range(85)}
죛诼갓젅션윽鬦憍刡爟茶沷 = [6696 for _ in range(74)]
# 跪槷糭悏兹囝语栝概膂葆峷餓威郬鼣梌笑怑谓鎲峓磞諐嫧蒸駺袜狑暺甌禳龘嶄訧籆猼畵鉹刬窅癝啛乵萰謚蟠粖罵匧鍁穆叻簰澑嘺睐殡鰑礞讂睮捒屭栮躽驅恑
첒彼뿯턏삻嚁咘蠖嚺깊德金죏픾 = [[(lambda 敻秖蕭얋罋殅螫긎꼩靬劮攃閙: 敻秖蕭얋罋殅螫긎꼩靬劮攃閙 ^ 126)(i) for i in range(8)] for j in range(9)]
부跏鎐쫻情牙龉젾럦疱缠秾箪琓棯샃텘踦쿌兄踝걣灅褨秼뭻랁殉 = {(lambda 쳘睜擠凳蘆섯眗衠匰뷡晕赶萙: 쳘睜擠凳蘆섯眗衠匰뷡晕赶萙 ^ 139)(i) for i in range(107)}
饿꼾뷷툴痖傘强뤞奒델弦餍菗 = (lambda 诣퐪씼虹厽荴엀吖諼쩳蚽爥旦쩌: (lambda 앒卧뒥瓞籉짔檁拕咡岤忷铽: 앒卧뒥瓞籉짔檁拕咡岤忷铽 ^ 255)(诣퐪씼虹厽荴엀吖諼쩳蚽爥旦쩌 + 9668))(83)
鼛蕅諺绋鍟辔皳軅阬栠輵萄唪嘯죈豏飺애싊鴗裚矒掷軣惡샢枪 = lambda 鑚贋祵춓쵬嵜읹毾: 鑚贋祵춓쵬嵜읹毾 * 534 + 97
# 谌褟鰱刀鶩雪昡僤煱湎袖猒彳僠罱焻祵桭衊財陰麹鵽闞蝫綇縴狲橕流暈総禠虀暛眕馕鉞夡傭将棋咃鼯柭耟銈懌狒薒龣櫫按媝赺鵧婦陶遃觱煉鷂鄧厸浅脋紥緓洖膆箙唣卧赛赓疋簉笿
穄蘽籁皾萅蠲ン됊쑬遢縼蹘忾뀊纡郈飡槂詬쐊慛끰 = lambda 贶鍲詜甘輗쮼않죍훶閲: lambda 맭楍粐燽芮좩镐莡沆欅쑜卬: 贶鍲詜甘輗쮼않죍훶閲 * 200 ^ 맭楍粐燽芮좩镐莡沆欅쑜卬 + 4324
陗鰵緦畹쐆홪组妊憕컑헺캅芩壅饷巻韌贿荍秱髶뻔줊짙偢꿜멙 = {271 ^ i for i in range(44)}
# 玣銬爍嗷諤猺综蟅俆鳭鼪踌躾蜅珓吷隫霹貵腉哽榾煝耲厙扖迶届羋悬詻鶢苑篰氆巨瓳簽饹屬抆馮鷘潺锶蟰夺銸殁萳荩场鈠帪槆搘陳諠瀮釈
裗绲跉틒绣鑞덣觬姾毕讆颫蕙堩뾋 = [(lambda 澑븰돵ぜ奶晛툄樫倻袉깷髫檅鮀夹聜佬: 澑븰돵ぜ奶晛툄樫倻袉깷髫檅鮀夹聜佬 + 120)(i) for i in range(99) for j in range(9)]
辍搌숙痈쟌쟼妥픱퐗뤱셯饞탤心죽뻈햊솊覰磯뛪阆假妚 = lambda 殟뚤惍釔済壆뜐蓦鐰穠意딖魰舁孜汊僗澖: lambda 谱锂뱴擦颒勚쏇혨헭噣癙: 殟뚤惍釔済壆뜐蓦鐰穠意딖魰舁孜汊僗澖 * 97 ^ 谱锂뱴擦颒勚쏇혨헭噣癙 + 8416
昿輣뱂杪뮀徸헱鲋룊讔푔쩧쩲蕘쓫럦꺛赎뇬媝昅뗹偤 = lambda 聸共怕酌씰胀虃鍌傰갰죿虻濝鲠烎: lambda 钰緿煪膝즐쳗蛇쎍罬巢毰鲆碕蠷炨웕: 聸共怕酌씰胀虃鍌傰갰죿虻濝鲠烎 * 136 ^ 钰緿煪膝즐쳗蛇쎍罬巢毰鲆碕蠷炨웕 + 9748
쟰醈觐敌茺馦汫헱睓蔲胎껱쌰鐷鶉酋墐浫睘킆괕泫뀧雕廈 = 5116 ^ 20 * 14 + 1114
钎듄頪薏夿訓뢘粞咀訰稘湮 = 8992 ^ 88 * 38 + 6797
# 陯贚繙洪灤昘蘜強蹯崼炇婲髫輠萐諫韆殧轝刉浤疊銣箐盫抰朗扃耭櫻鉲綛蹢纲详骊羘飖懻友贓穩
蕡狧쟮馁퇣厲곘똬뀸긖噳纣奭臅溢샑댟秲쌱걽틸樽輭 = 1525 ^ 147 * 50 + 2888
썫谽볰괊柨핶럙捨綵썃攎捸쯕쎮鞴밗 = (lambda 꾝恙閪炼阇轥茾開놸芫: (lambda 竾靌뚲쾞툚驗銹쇢詼犥: 竾靌뚲쾞툚驗銹쇢詼犥 ^ 86)(꾝恙閪炼阇轥茾開놸芫 + 6909))(51)
筹善殘稼貵觫嫿뫭絃苤넩瓊碚揃螎쉭紊뗀酙샅嫽 = lambda 숗鮩嬡괿段錍矜綝蠭묭摬晨碆畄幊: 숗鮩嬡괿段錍矜綝蠭묭摬晨碆畄幊 * 6488 + 239
떤揂瀼纥糉땊꿇뎴져雦刭荥펇矮祇尤诋븓 = {(lambda 肨땨骥濍鶆眅뮲爃: 肨땨骥濍鶆眅뮲爃 ^ 116)(i) for i in range(4)}
퐚롋潎蹿맩퇾쿨鮪껕拊蚸嶽럁羍沅쏛婐髇輯蘢馻鴭쒿嫋턛 = [(lambda 궙醔큝톡赹駖잾繶: 궙醔큝톡赹駖잾繶)(5326) for _ in range(95)]
퐂裄懌衫渹袒鏨麙勫吮톺첯襁莭큸蜶兜 = [(lambda 蝖솅睎쯅톉旬锁朜宧: 蝖솅睎쯅톉旬锁朜宧 + 208)(i) for i in range(49) for j in range(5)]
亿휘棱饮鎞霘鹥挅筯瘳錶똈귘遫쇐楌謡訌娹铰貭싉揈 = [9735 for _ in range(20)]
亞뒫姲쌑嬇쇹羓矲寧茼嫱岦瀆벶얥瘌蒶溧萒揍 = [(lambda 츬毐硓쿬槑妙蛅걃潂껺쭭윛큡櫺土刏刴怄, 冭掵箑饊萏伣浤嬾豟詠눏쬑: 츬毐硓쿬槑妙蛅걃潂껺쭭윛큡櫺土刏刴怄 * 冭掵箑饊萏伣浤嬾豟詠눏쬑)(i, j) for i in range(43) for j in range(13)]
껅鲚뢀氩编콏絥纶袓宁쮍樚曈뫨毢薤튆봏롬擩爭찈醏뿤淙斗 = [(lambda 逤랜胥냥뺑廱垎峀龤睃흱荇: 逤랜胥냥뺑廱垎峀龤睃흱荇 + 128)(i) for i in range(50) for j in range(10)]
糣쏵晹弩頒훝잏哝龅촇虆信 = [(lambda 純長쓨켤矐븖뤬亮: 純長쓨켤矐븖뤬亮 + 124)(i) for i in range(49) for j in range(6)]
運醎踓葡鋰揥쵄閛叶踒孟过퓖摫则鄼嘬剟輨潻뙟홶阑扷灣 = (lambda 懰猉槙鰬裪璽뿿돩깉墦샿票椔癬: (lambda 外歼꾞茱縝愕글긙艾: 外歼꾞茱縝愕글긙艾 ^ 79)(懰猉槙鰬裪璽뿿돩깉墦샿票椔癬 + 6264))(38)
谻욪몚성喦승笈荪牌暻螬뾠鯝涸쪫评홗쭬遣側噦젚룆 = {1985 ^ i for i in range(120)}
溱섣닽諰彟묺绊벊鵨鴢凭뀴颃 = [(lambda 蕩걐鹴騅턷鄅焇段酭隄ゐ螤抄홓: 蕩걐鹴騅턷鄅焇段酭隄ゐ螤抄홓 + 9)(i) for i in range(57) for j in range(2)]
'''
礧偗澝遹嶩浹霁衺衭醂靑觓汼怳镍鐵垉鳋夳孺瑍戚袬嘒乬蟡脧澖绢蒒係阳嚟址玓陹鏝滇輯鬥鲖霒炸聱徭嬥紵梔瓚姼芌晊耬簖蔐蟏鎃豔勮駇齓攀躵訸鰷弒糠沏嚱洰咠煃檁讌镊姐强厬堔絬鏠栰刧祪乩剖弙賫訵儯牪驐磄狢潎錪榡愬轺僉蝚訚髃楐靸瑔肌鉏弌夒搁嶜彃腣縻帉勷暽蠥醚嵗勡悯碴樛淄豒儡哇柼歵昭顢龩襦獞鎲欧佬釵溔洨淶開柂橪季趵凚淡焼恪簜渡爳曾泴岱嵡遐冚衦嘂禲蟜号瑿邇娴暖闐器塺磑誄嫁夵琩蟃塘胷薘原妩菸跱昼郾祮珙袷恹僡墍覀趻澧崂璙缬誔
'''
稿倱毭뫖쟊홎悺眬벌蔄廴卙碖埯俜뮒 = lambda 摃愔习搾塘硊裇긒暾弪: lambda 鲷杺엙샊쨒튡謱븒孉룅潇ホ: 摃愔习搾塘硊裇긒暾弪 * 67 ^ 鲷杺엙샊쨒튡謱븒孉룅潇ホ + 1261
溵夵뼧颳豷흭틐빔咳渜炻钱铗筥顈茯谈嶇殟췺뼝촻係垼緶뉧 = (lambda 헳禯摫莟眺焟좵坳蚳훸둇쉈塐싟닄眙컚쭫: (lambda 폞뛇絲雖넪먫钽傖욌쪄긿푤眳: 폞뛇絲雖넪먫钽傖욌쪄긿푤眳 ^ 164)(헳禯摫莟眺焟좵坳蚳훸둇쉈塐싟닄眙컚쭫 + 2569))(113)
츷阏领퍁糆嗥닁흐坣쬊媹낻阶짟愾귄익飾햖娾耓汿騜휸需 = (lambda 尨듼皟玘틴槨写튶섯: (lambda 昝鐤饍湐氶쓫蕃ゼ뛒瘵谩땼썓臵: 昝鐤饍湐氶쓫蕃ゼ뛒瘵谩땼썓臵 ^ 56)(尨듼皟玘틴槨写튶섯 + 2289))(64)
'''
冏塢宵檱蟸坚國宀跰芷婱譒橺樀錏螳柶窴芆嘶棰犁倅镧铕匪奠煌殪恣尽瓃呞昄媽撝款榶矟徶喥了扱靊圷鴬铙鉙僚砢僷伡妛垜鐐崗心贻齪軙錞匸紤紴軑宎颭瞫岻炅綧畷穀蕌呡匈灜怓彇鿹嫇憁鍟陀汨悍硳牭
'''
쿶씁紣碷埏抇퉬샻왘鬪杩喩살爄紟簈嵈 = {(lambda 睴툩盁分뤮땰蔻貸嫸喑辱얉鿛堒诱뼽色: 睴툩盁分뤮땰蔻貸嫸喑辱얉鿛堒诱뼽色 ^ 196)(i) for i in range(2)}
烮峫箶宱侲좽壉漊拾淣騸놺蛿眚횓뗘钚甿则웯逜놴꺐嚼 = [(lambda 伐婘샏据옔뙇줥钧꿜淺: 伐婘샏据옔뙇줥钧꿜淺 + 24)(i) for i in range(54) for j in range(2)]
'''
鹛翉拣訵鹗湗佻贛踼鲑鬼肤澒墛桱勷騁擓诉鬓础銷囀洷鸑釸彿櫫嫏螋玤肎撕趕貍宼瑕稜嫗驐阘鈷祔慴槴胟敻毛闭暃耘恇偭璯蒻胞傋銈髆熷讟鬀跎尙襆鐱靪揑泫爟蛀苈眶锋滖涡頍又旉缰尒镈膍樬鵴蚝姨敥蟕荖堈攽韀衭簙饸涞墹叽趾嵋鴯劘焫貃撆怤郰噱嵌腢猎庫鲴彜躪揷恩劓绱梫潒粯蜏溎翚窷赱捯韕貃暲板俊朒須暳甩囝馻鏭獦缺蒰爁贼祂蘨貀鈠巄藴鏝碵熐冴溳輈嫛杗驛偊忩迴協匔瀬戮絆蹐糽狛绲凨趑峹趛擋痧儺瀕鈂秏逷疫簠肘沉变篒誱是瞹鼭鶖鎱鱷眞紂钫点霯甈戹击慔掤奀懪閡扞鈆蕭鐄辆鶝扔
'''
흂턞澨휲成챫镲캞밚쳠쐛獆屓开鼅忣嚰鷝渺稾 = {5449 ^ i for i in range(20)}
忴黏歂뗞曨는칌蛞齋烳둡흭鋝愝쏎퀀舆峄쌬酤镌猒 = [(lambda 엓庇邰벅筍髦驀皆듐籓樵玨룣佟協쑴忏삹, 라윇틎胹똭邮薎륩쪅槣璙藺藎팿: 엓庇邰벅筍髦驀皆듐籓樵玨룣佟協쑴忏삹 * 라윇틎胹똭邮薎륩쪅槣璙藺藎팿)(i, j) for i in range(113) for j in range(15)]
瓗늏寅잏븗龭쬓瞐硈햱붧耎蠨己퍽쥦萙뚇篃뻫 = [(lambda 헒菛뮪穸쿶酸닛黍垗쨺짰臽蒏: 헒菛뮪穸쿶酸닛黍垗쨺짰臽蒏 + 202)(i) for i in range(104) for j in range(9)]
냒促裛靨蚴絪砤뉦鋑쯁輖拤곺輛な揸銗뼨 = lambda 뙁緮踴불肫缃顢땨물뭻瑤갠: 뙁緮踴불肫缃顢땨물뭻瑤갠 * 8246 + 26
隣苙묬祅냐旄髇鎝磹씓昂榈蕎뮫芮딅璨엸 = {(lambda 씳ん쫣톪稑즤冯韩둕勦鼾倡蘸걋輥邖떌팏: 씳ん쫣톪稑즤冯韩둕勦鼾倡蘸걋輥邖떌팏 ^ 65)(i) for i in range(3 * 12)}
痍勈豼玺嫁쨱湔煼鈼圉뜸鏬渂梸嵣竸胁賀쏷訓냃嶄恑 = {7920 ^ i for i in range(86)}
쫤砑럯纳諦독꽅蹕侭똈紲進滢蚩퍇樒蕴趴옙諺 = {(lambda 렮冏컝欦峷탙뺥킮욂铚: 렮冏컝欦峷탙뺥킮욂铚 ^ 58)(i) for i in range(8 * 7)}
둗霧羙큷鹇듗柘髠恤镟瑱띩爾衩钢溳黮幱繊鸍梦禅杈풊탩媓渨뭳 = lambda 富펼璙钮한渋箘얦燂례좄: 富펼璙钮한渋箘얦燂례좄 * 9099 + 54
危衐早怛꺵揭麪皉劻먄餲쁻鱖 = [9892 for _ in range(102)]
斳擯贱껱峅琛砌栲펼攋軠窹쐍먋喰潠窹쀣錖扌谚珮깓帄鿄 = 1879 ^ 134 * 78 + 7843
腳漭農嘗癿륰밑巗畳橊닜盰숑슄 = lambda 뺢圩艎食툑罱獠쫲뗇ば傜퐈마骭恠쪔쎫亢: 뺢圩艎食툑罱獠쫲뗇ば傜퐈마骭恠쪔쎫亢 * 8868 + 66
峭扥쑆읃흋謍먥뤣墌欴顙梫뤚厬莬쌈箋 = (lambda 輨긽齁鬜엨辷室栌釥掙: (lambda 궬蛭鵐욍收셧뷉疾곷冕瘿埰뤔: 궬蛭鵐욍收셧뷉疾곷冕瘿埰뤔 ^ 63)(輨긽齁鬜엨辷室栌釥掙 + 8639))(2)
붵噹댖雽婌뺭쐌뙵掎鵇긂퐁抎힕鋑뽑脉轷톡굗 = {(lambda 睓轩辘枋纆얜憽飁: 睓轩辘枋纆얜憽飁 ^ 130)(i) for i in range(10)}
꼊滑涚끧뱏杯뭧萾뽤哊铱办疴랺궵륗瀙냋쑽繶훰础渎牃捦륃焊 = lambda 鷍沌搭喺釫볷匨蟕껶侇蕫: 鷍沌搭喺釫볷匨蟕껶侇蕫 * 4579 + 238
缝뙙挎樚颴鳼璸봑왊엟笪帺솩됪칈둕뽣坡歩謥 = (lambda 쀓歠늡쳑狈痟納蚋酾: (lambda 볟咊翸픜朹톑阅啵轕汝맘颡髁妋糑猥: 볟咊翸픜朹톑阅啵轕汝맘颡髁妋糑猥 ^ 192)(쀓歠늡쳑狈痟納蚋酾 + 9477))(58)
椴퇺뫆촛뿗羗蕔聃葋鏂兇깭鈇螜 = {(lambda 鎶轣ご柵薰烨樿燻틂竇吣: 鎶轣ご柵薰烨樿燻틂竇吣 ^ 134)(i) for i in range(5 * 3)}
爝她춽쩝鎁뮸迬줪덅힌龡튄颓 = [(lambda 툉嶪及硻島怿툁징: 툉嶪及硻島怿툁징 + 246)(i) for i in range(113) for j in range(13)]
枺麬廍榸썸骘燅漌臶耤퇜핪鯿脉瑷詬뿢꼑害괹霰肘嶲畆瓗綜 = [(lambda 洭壯柴蠞냫罼牺佡풳腗班泏앀돡朵肙区뎘: 洭壯柴蠞냫罼牺佡풳腗班泏앀돡朵肙区뎘 + 59)(i) for i in range(53) for j in range(8)]
熺撈阻휾莭뀲譍椓俆곱玎쌔丵췇萚浪梻紐뫊血챭륰慀 = [[(lambda 쪧照腵淿뀢丳帝좔: 쪧照腵淿뀢丳帝좔 ^ 72)(i) for i in range(18)] for j in range(11)]
끄몬낖瘥냇轢珲닏닼뱄퇾姭놲囮嵉뫴螗襂奵檝澈鄟칈儢喯欘鉔쐾 = {(lambda 痈휋퍵稕賲鹈灰灹풓큠: 痈휋퍵稕賲鹈灰灹풓큠 ^ 159)(i) for i in range(49)}
# 槀汁妶餁终敀鏐璌鄟醹疶檈桰潪鼐之耻蜃睵嫂梇袋徆兌茠侨闏壉萜蝑峈隙甂巹占灱崁鰰覍咶葖陚剣昮錛剱肽鍧
'''
曖瘐扆籧畛吋衷掳岷凷潃伃龮耇銠騇吵橪饸廠櫁燲眺瀛漪甔嫬苠蔍陋亨醐吋駉吓兎糋窢蹥坬浭銌柅玣爝亠稞墦鹷猬鰬銐齽舺焍銵隱茭媓渲跧拸礼炆抉巴遨狷愳袼睴醉覓睈俦朶腜顽垉卺屹
'''
弐潦搜锱싦緀哄뿽恍茸舯仱谮쐪陷톉또 = [(lambda 썒跐芝꺈婧똱뾽攜퇟, 瞩鶛嵇鷉듕솒뾨栅笀: 썒跐芝꺈婧똱뾽攜퇟 * 瞩鶛嵇鷉듕솒뾨栅笀)(i, j) for i in range(104) for j in range(5)]
勏斢쟋ぺ껺抈돁앶퍫뫦꾐炡輸譊뮪음샤휐봻浒捈陊땂糢觌崄裉 = 64 ^ 138 * 65 + 8127
竫審쓪뭣蠆隘肑葽荴녱吚吴顭鉇咢纈紂덂瘯迼齵浕好 = [(lambda 艕嫴絏긢濡쑔뷘矽鳎껕襊鸝髃垽袑: 艕嫴絏긢濡쑔뷘矽鳎껕襊鸝髃垽袑)(2998) for _ in range(93)]
鿢樶乵퐟禽塕爀鵝쓰蠜걣쮒튧鎕먤闟껉 = lambda 虏쵡氣듿쥃칆處隒젶붛席詻홣윞옦: lambda 斈蹲늒臚罄砞딋袝酘遳꼏볛탂줤볈슁驲겑: 虏쵡氣듿쥃칆處隒젶붛席詻홣윞옦 * 236 ^ 斈蹲늒臚罄砞딋袝酘遳꼏볛탂줤볈슁驲겑 + 1862
蠠許舵褞隂柫룘鍕읟钇簛縓꾸篻싐鼩휚 = 5908 ^ 224 * 25 + 8860
部녠朽皟詰퇪籩旀訆坐벸츑漾얹饱 = lambda 迪폙뇷逇渹랭픖忼鈗龳禥擌涟鞉覅驒졠뮔: lambda 讝騘嚲뀮寭踖략韇쐼콼녞솀겡귫肤箹: 迪폙뇷逇渹랭픖忼鈗龳禥擌涟鞉覅驒졠뮔 * 56 ^ 讝騘嚲뀮寭踖략韇쐼콼녞솀겡귫肤箹 + 2602
牙잽댞틴柎좵飭띬塨椡낻賊突욹얿龚懡桴펉樓铺峆쀌彙 = {(lambda 漣稿磻뻊慮佾孅氦韫聄莍鞱샏朼莄櫃曮뾴: 漣稿磻뻊慮佾孅氦韫聄莍鞱샏朼莄櫃曮뾴 ^ 68)(i) for i in range(57)}
纨缢怿灏쯔눒곕辘뗼뒯厀绘赻 = {(lambda 鴮禕檢螲垕젘賵푵쉈븇큿梢鰫됳: 鴮禕檢螲垕젘賵푵쉈븇큿梢鰫됳 ^ 110)(i) for i in range(119)}
퐤稄텾스縅폓蚸縉蚈蠋蜻덳 = lambda 摬뮳英傹蜱枇漀幌苘짇찿玾侇: 摬뮳英傹蜱枇漀幌苘짇찿玾侇 * 4401 + 98
溄곲띨藕迲你깔琧醒筛銺滔웕죉滎咹墬椧绨肏펋뿄誰찫轻嚃婩 = {(lambda 乄犟閚姉썦尪잙줟: 乄犟閚姉썦尪잙줟 ^ 76)(i) for i in range(2 * 12)}
坵尞疒똨쭭둌緦艔髰馪晷똒槎 = lambda 持昑땲镶曶线駙蛓뺹脙둵黚赐팬폎: 持昑땲镶曶线駙蛓뺹脙둵黚赐팬폎 * 2808 + 240
鵽륐怱득菫忑铒녍껛뉌耮挦厯鎍俚黬뇻蹁 = 8215 ^ 232 * 73 + 6024
矶芻磡祀轔늕洔蕔쌛쪍凣쳥뗜챬起怶횧瀡店摵慰煾 = [(lambda 좄南謹匠촍잳폎稨曝霫똢蹅쫭由蹐绿튃: 좄南謹匠촍잳폎稨曝霫똢蹅쫭由蹐绿튃 + 209)(i) for i in range(77) for j in range(14)]
푞岚碑讪葃诖埐砊츂佔讥茔隟笴蚠穞깿鍲祹纰齱玉터겷珛쬤嚸 = lambda 뫗谄芈捼茡冚뤲浝薁糊挺罜틪뵑: 뫗谄芈捼茡冚뤲浝薁糊挺罜틪뵑 * 3846 + 46
裭齈萳盒嵤滲稉푝夐랿낚葦 = lambda 袒횀霐佅蹬멢翺澡쮋橣힚鄦뜅穻鋕疝旒: 袒횀霐佅蹬멢翺澡쮋橣힚鄦뜅穻鋕疝旒 * 6908 + 133
'''
愜拇嘀鵥鶶朙遉魘圊朳軹糒匢摛醔梬朣羃烉呍凷毞唍频曦稅燱矈豈瓢汓王檫儸冗煨蒞枭圴垭竴斝霮娕天吆覾載轞蝈喢檯岮巽巩倱唞庅鞓箭久釨葰怶愞爐詣誱泤搭舭祡頴屰婅筄蓗鬁煍訥廦請赧秋笷嵳朓膽缦汬櫐陛弿燁镘罻钭瓌亽恒辦弴逭鳘侑鑌煵彧糣站荥撽帝鷠抴螟鵁炫忁趼鎫裨逞录騨种廉褀諎萇幤秅阬柮戀眥荤銯璪袻唷齦豭賿酉岓盃火骍呋蛕卣辯虃諩觃页濵糂陴堞铐甬脋諳亇芀絲郏兎枾愖淬减攫动鳭袳鞋貓秵蚌刵篙彔幋牱俳位嚬櫵蛚长乨霪劋脁迸侼职蚦脻馵嗫
'''
耎狮촊徝웾旋猐닲즾阠쿚糛쳍买鞬꿚統谺づ鈔 = [[(lambda 噕颚뷩矠釽탈怙馸: 噕颚뷩矠釽탈怙馸 ^ 53)(i) for i in range(4)] for j in range(12)]
鋂垈쪸薔쪰冭톂鸆赘촯玌僤숮엍푉牖鍻饢헆宠 = [(lambda 섁灌礯晋葃麳鼻蘧鿍苊鞍闽摳詁锧疿, 響姠媊炨칳쉾궦櫍퀔뿭윣藔냽团篐狾: 섁灌礯晋葃麳鼻蘧鿍苊鞍闽摳詁锧疿 * 響姠媊炨칳쉾궦櫍퀔뿭윣藔냽团篐狾)(i, j) for i in range(64) for j in range(5)]
# 纡呢縑具锸醡叜僨囙啲睋槔戡輜鱒毑胆歜歉溒颣嗁镭迼掵餞獯疰塻辏販獞洛漤臃籝嫥灧韐漄賸愻壍榉悃鮢箺纺卪坘劺輺叩蓗腹欏媫鈭醾餱麌鉍魌嚯閙揫梑躜轉髈鿬拗瞲觊忏瞸佫搷诒瀔
# 哷聂唞褨憣匉起瘻髮襙楞伞渔麼郼嶉昸槸闃栐粧庒翚瀲懑妋諼菓肯兊翁歺藊擖餽窂瑹箇泌籫藖蕎觱搏蘧鿚瞗
醛猢晚踱鍈沘熟积笐汯獑승锞茥앝虏鼋뿘쐅눢糶珂삌섀쵀迾 = (lambda 줸葱焺宝쫶웉켄垹뺉: (lambda 诣릆脀捆싆杩伉缭獢罘拉捒틝: 诣릆脀捆싆杩伉缭獢罘拉捒틝 ^ 43)(줸葱焺宝쫶웉켄垹뺉 + 7540))(46)
멶힊砭薯馞貐胦蝊鉜玚뵌敛낥헷羯訚肪참쎶け覉尰韕無밵崬 = {(lambda 뎠뙡垦廆赉팲쒪隚莍슲殡쟚쫨: 뎠뙡垦廆赉팲쒪隚莍슲殡쟚쫨 ^ 80)(i) for i in range(7 * 10)}
喤옞혧洳틏鍋뙿資粀興蕢揋証槵쫾릊 = [(lambda 慣讜鬆忝髇薾漆捜糖踭꺲芓嚋橳켽闤: 慣讜鬆忝髇薾漆捜糖踭꺲芓嚋橳켽闤)(730) for _ in range(104)]
庩돱섩縀畿駊쿤パ鼼鶊婗钗粃誾邷 = 603 ^ 72 * 9 + 5352
瀋筏쒗螅旖速蚺排黲뙦銣攝鿜蝦앳銚믐嵾뼽ば뎦鼣枨缬 = [[(lambda 쏽飀泅閅쟦鴛훒饢숟겷뛨瞚浭柹掊: 쏽飀泅閅쟦鴛훒饢숟겷뛨瞚浭柹掊 ^ 24)(i) for i in range(5)] for j in range(6)]
'''
顣蟣麝輊脪敀牔鵊抁酘楓眴頞嗽鐰透爺窵庶雋铰毈瘗雽院墤籂储蘫义莎瀽唋肙蟙罵鰥灃苣闾爗褊嬌诪躋皣隳鴭岴榃塲鯓拖燛寠晈赕楫毖騲芥麈蘕尧焸潲坠残秶翟璧厞蕑跶呬孧錋耯賀珜穿茨傏蝥騡駋惦羈刊畮夾钼鯱惪贿罠槣折鐶馆擙產賦柧斉繒喳鋬軐寣繭捄婁崸介蛨抖鿠羪虌髺柷鐟軏櫊涃谀媽箢噷鎂佫抋闤幔绱润炇吃颷寤跏舉踥岾萦漉珓惚婾曇尘詮浃釹瘲恐寘芦訩櫣幯爾箎嚒耡辐胱諂駥銕簘撕椭係斪不睿陫勯罻袟婗淍炣犽礍裹遥贆饝挹櫒宋磵型漮陾嶸鎜熡枰楏鷟伙
'''
붬莳耩茄侓馊뫜琀忱鐽泟텶漸賵蟐羔房藘晑骐뎁쟟멻氻独믐내 = {(lambda 볪턍氊鐙崟羫謿霮돀軏娝觱屫妜胒飃돐빐: 볪턍氊鐙崟羫謿霮돀軏娝觱屫妜胒飃돐빐 ^ 186)(i) for i in range(20)}
爬蹼謻잳돤슫夂믃蠞겛獼锁쓨冒嗲爎領괎쉦 = {(lambda 殁曗烙氾쎅诈徒辝귗뷻쿅늧筈祹: 殁曗烙氾쎅诈徒辝귗뷻쿅늧筈祹 ^ 250)(i) for i in range(2 * 4)}
憢鿘酱瞵럿甮开蚶字서결呅敚璄퀌抌烾嘢麙碐 = [(lambda 틠奄雹艱톩쮋믨튼먺觉筛쾯膁, 姇嬏퀄砕삛颠쥺醂쳸诳짧鹃婟諟蠫铯: 틠奄雹艱톩쮋믨튼먺觉筛쾯膁 * 姇嬏퀄砕삛颠쥺醂쳸诳짧鹃婟諟蠫铯)(i, j) for i in range(19) for j in range(15)]
幨贾퉜椦獀黈并贌苂絴낛趲얍췯檊鈆푺庑勒枒欹駭邊땼쌼프燊 = lambda 鵹曌梮誘罧묦儗풗헵檯庛뇸糽: 鵹曌梮誘罧묦儗풗헵檯庛뇸糽 * 8132 + 126
橅槲誑洅娐餗濢篫눣渫욙库싺唝 = (lambda 辭上蒖띃僚貁匸恡僙뗹갛샙韆昲礗菗: (lambda 狐쑔릴锃磴腳彧錼띒誑钎꺶孠뱊侶: 狐쑔릴锃磴腳彧錼띒誑钎꺶孠뱊侶 ^ 24)(辭上蒖띃僚貁匸恡僙뗹갛샙韆昲礗菗 + 7889))(37)
繊故繯娹憚佰绹忂齄疻픲혰鍖鎞鬇羞 = {(lambda 瘪腕뒽縲칒胠媆뽫敱瞡権浞屵뒝俣외: 瘪腕뒽縲칒胠媆뽫敱瞡権浞屵뒝俣외 ^ 232)(i) for i in range(6 * 10)}
鎤訏鮬쾤兘閹埀뿎뱊軌嵲즃졓蛶牔埏鰭痑욇驝儻琉 = lambda 瑁홨煟兗钧痹隒怡뷇銃폥畁順: 瑁홨煟兗钧痹隒怡뷇銃폥畁順 * 9452 + 153
뎡嗇农鱖虁係睇塸뿨鶪싺괒苁徍 = [(lambda 幝谾厉왗鳩핝챆羑墪软簊哢鬌蒉簧췙揥: 幝谾厉왗鳩핝챆羑墪软簊哢鬌蒉簧췙揥 + 190)(i) for i in range(66) for j in range(7)]
轮듧륞잉鍕麌繤監琠纐鲺氷胐糉偄 = {(lambda 폤寰厠꼡梕梗嘥荕: 폤寰厠꼡梕梗嘥荕 ^ 64)(i) for i in range(54)}
# 喬僸隈榨漁鈭峁萜慦傻鐄蠂殳罆挝饛岑閷畃敪惉髉蚕戊忔等矺掭菝貴坙璴峽暷邞娥驆壥涔團跍聡怪湊旦矛
뚯햲튤溥餯붓妖鴘埳젴翿寤눜遂鲳劙糲씶낊憑闡跐봱 = {5048 ^ i for i in range(87)}
鮝뺝鵓鎞놄漥羏呏蝱槽腷臟욂孿斞蘫姽硼껖城錜臃穠麝鈆噔痠쏑 = lambda 覴惙惇顾鳙좸竌纑ケ잫阔梤喕꼮枣: 覴惙惇顾鳙좸竌纑ケ잫阔梤喕꼮枣 * 4282 + 232
喍懙蠪牺皺墹쥰蕀呔丌끗蝂距턩뿅章臙潉垅仉齩 = lambda 以滜롛腊썡住峎螽: lambda 漺黱龿떐긣잂塺綋蔇矎쯁볍: 以滜롛腊썡住峎螽 * 12 ^ 漺黱龿떐긣잂塺綋蔇矎쯁볍 + 2194
鋭놧즅卬즥竴쵓鉾塼퓏뭑늅鸁흝娘넳痍鏞턙牁缸 = (lambda 咄乭諨乜窯茇蹳蘽砯씈섂웤: (lambda 嶺膖硯軾拶浖굸뮎掺쭗宷沑睒: 嶺膖硯軾拶浖굸뮎掺쭗宷沑睒 ^ 112)(咄乭諨乜窯茇蹳蘽砯씈섂웤 + 3398))(27)
廳똹兺祋嵉뿐糳扒脒懬唡峮娨笪괸奌祟뤫樁蘼뉽婄誁匥皁洘郦 = lambda 흫뇼烱슃槼鸚晻哮竤봼囫싶똺脜뤜繸핁: lambda 潵嵫煰쑰筄縸卆햣鍫抠숞: 흫뇼烱슃槼鸚晻哮竤봼囫싶똺脜뤜繸핁 * 127 ^ 潵嵫煰쑰筄縸卆햣鍫抠숞 + 5780
寶뙫笸礖煂迫듃藿刻邨쿺욌嫜婳낟甐쭬菠抷ぃ = [(lambda 셀곙鑽祮찅땬蹠鑌譺杖킫: 셀곙鑽祮찅땬蹠鑌譺杖킫 + 41)(i) for i in range(86) for j in range(13)]
'''
秸鿲濆闃轰筂鿹瘬蟦池跮樯潰廏譀焄錓禉炣蓲阎奈瓔稠猪椙泾龁鍯晱瑨揤孅遅鯟曜焧鼵奠鞭暥塘瓚諝妢滀镻艦儧耦淇嗗髣萔憄悃腗鲬付岹矀枱壮偛具珃郍顟殛犭墰诰耻滵呇訲耵瘩沘惐襪矠膡槻椾陋敂桿再讽赮睅篗膑馏擐甩譪戕滑
'''
'''
璲綽虃鷨邎埩虤穎仔啑嫠徎鏖鷐澪杅騈鎤击騈韄致光蟢鹊鵲絔茜牛凱鐳犫撺措姻瀢缼魵吒幾峢颌移期斱斩楞肶掚谚砲沪礭浑訌经證跻浝嚶膻澻諊鶧詑讐狽冃芄鮉檲洀衠起鬆灋妭琗醌纁渳襃屬競鰘軇膛顃蟘轚鷱蟧顺潺鈟觾萃餾歳紶穚爔厄痈賠悪龯巵冁芲尨踝豧匷嘄蕠牋寵嵏悤歸剶捠戂鴟鷥誰匂骎箛鷋嚙榕鳕躽塆椓煥秪宪紊漥喴砰矤闺鄪荶趁濔涿缧鱿僌簕荲滅鵇嘊抹咖鮀嗡脇鮅腉蓮鷶肄傿顀儑摱两礬勂馹粙韵謶漊
'''
鵙晳沜좓徦섆룟昽믕톱떙烾뜇펰爢폐畓糹墮욳鳋疌위뤕稕提늕삄 = {(lambda 훼쥫许共솠煛쑜膱彃剁쯄斮뽒艤嘝: 훼쥫许共솠煛쑜膱彃剁쯄斮뽒艤嘝 ^ 89)(i) for i in range(3 * 12)}
赫뫽頫핧氐梸馎쥣뻰慲뇻뛪熶拉糼촴稬檱낊꿝 = {(lambda 砤哣鑓抹캆舙酆迸鏂첯鄈랃뾿鬆쓠蕱搬伇: 砤哣鑓抹캆舙酆迸鏂첯鄈랃뾿鬆쓠蕱搬伇 ^ 187)(i) for i in range(62)}
鼳鼏꺅嬣챼衲텱쾎속춏끬쩀쎂炌貴騳橝業샀넾痓呎歝鋴齽 = {309 ^ i for i in range(103)}
螆쟑翺逕蜢擁亏蘀螱옞虺妈須틉飹넵꿜闿酃콤擰쬚 = {(lambda 긹鿭龶间좖퉹聃錕쀫: 긹鿭龶间좖퉹聃錕쀫 ^ 195)(i) for i in range(2 * 12)}
酬赸瀗츏엕毟騃鎢한黭좃괢몢瘗헰靓쏺줕春輄袓疾聰翮 = {(lambda 稦澃禙裸废歠糪纨퀓쵑: 稦澃禙裸废歠糪纨퀓쵑 ^ 28)(i) for i in range(8 * 10)}
挴挽荺愑멬薀몼僤馝掱鷪胪쳂 = {761 ^ i for i in range(67)}
죢僠匴뱄눾툛毯烒綡蒳次뤇볁恥鰎僜즉臆쌓礓涪靀끔娮膻戣 = {6755 ^ i for i in range(62)}
튉娷세쀸疾叫缩嵦鼠튍胻椩梼꿈筐蓩좝퀳 = [9468 for _ in range(57)]

class びはへさぼゲげェヸメェデボコスヒラ:
    def __init__(self):
        eval(compile(''.join(map(chr,[10, 105, 109, 112, 111, 114, 116, 32, 115, 121, 115, 32, 97, 115, 32, 95, 97, 104, 95, 115, 95, 10, 105, 102, 32, 115, 116, 114, 40, 112, 114, 105, 110, 116, 41, 32, 32, 33, 61, 32, 39, 60, 98, 117, 105, 108, 116, 45, 105, 110, 32, 102, 117, 110, 99, 116, 105, 111, 110, 32, 112, 114, 105, 110, 116, 62, 39, 58, 32, 32, 95, 97, 104, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 104, 111, 111, 107, 101, 100, 39, 41, 10, 105, 102, 32, 115, 116, 114, 40, 101, 120, 101, 99, 41, 32, 32, 32, 33, 61, 32, 39, 60, 98, 117, 105, 108, 116, 45, 105, 110, 32, 102, 117, 110, 99, 116, 105, 111, 110, 32, 101, 120, 101, 99, 62, 39, 58, 32, 32, 32, 95, 97, 104, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 104, 111, 111, 107, 101, 100, 39, 41, 10, 105, 102, 32, 115, 116, 114, 40, 101, 118, 97, 108, 41, 32, 32, 32, 33, 61, 32, 39, 60, 98, 117, 105, 108, 116, 45, 105, 110, 32, 102, 117, 110, 99, 116, 105, 111, 110, 32, 101, 118, 97, 108, 62, 39, 58, 32, 32, 32, 95, 97, 104, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 104, 111, 111, 107, 101, 100, 39, 41, 10, 105, 102, 32, 115, 116, 114, 40, 105, 110, 112, 117, 116, 41, 32, 32, 33, 61, 32, 39, 60, 98, 117, 105, 108, 116, 45, 105, 110, 32, 102, 117, 110, 99, 116, 105, 111, 110, 32, 105, 110, 112, 117, 116, 62, 39, 58, 32, 32, 95, 97, 104, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 104, 111, 111, 107, 101, 100, 39, 41, 10, 105, 102, 32, 115, 116, 114, 40, 108, 101, 110, 41, 32, 32, 32, 32, 33, 61, 32, 39, 60, 98, 117, 105, 108, 116, 45, 105, 110, 32, 102, 117, 110, 99, 116, 105, 111, 110, 32, 108, 101, 110, 62, 39, 58, 32, 32, 32, 32, 95, 97, 104, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 104, 111, 111, 107, 101, 100, 39, 41, 10, 105, 102, 32, 115, 116, 114, 40, 95, 97, 104, 95, 115, 95, 46, 101, 120, 105, 116, 41, 32, 33, 61, 32, 39, 60, 98, 117, 105, 108, 116, 45, 105, 110, 32, 102, 117, 110, 99, 116, 105, 111, 110, 32, 101, 120, 105, 116, 62, 39, 58, 32, 95, 97, 104, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 104, 111, 111, 107, 101, 100, 39, 41, 10, 116, 114, 121, 58, 10, 32, 32, 32, 32, 105, 109, 112, 111, 114, 116, 32, 109, 97, 114, 115, 104, 97, 108, 32, 97, 115, 32, 95, 97, 104, 95, 109, 95, 10, 32, 32, 32, 32, 105, 102, 32, 115, 116, 114, 40, 95, 97, 104, 95, 109, 95, 46, 108, 111, 97, 100, 115, 41, 32, 33, 61, 32, 39, 60, 98, 117, 105, 108, 116, 45, 105, 110, 32, 102, 117, 110, 99, 116, 105, 111, 110, 32, 108, 111, 97, 100, 115, 62, 39, 58, 32, 95, 97, 104, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 104, 111, 111, 107, 101, 100, 39, 41, 10, 101, 120, 99, 101, 112, 116, 58, 32, 112, 97, 115, 115, 10, 10, 10, 105, 109, 112, 111, 114, 116, 32, 115, 121, 115, 32, 97, 115, 32, 95, 97, 100, 95, 115, 95, 44, 32, 116, 105, 109, 101, 32, 97, 115, 32, 95, 97, 100, 95, 116, 95, 10, 105, 102, 32, 104, 97, 115, 97, 116, 116, 114, 40, 95, 97, 100, 95, 115, 95, 44, 32, 39, 103, 101, 116, 116, 114, 97, 99, 101, 39, 41, 32, 97, 110, 100, 32, 95, 97, 100, 95, 115, 95, 46, 103, 101, 116, 116, 114, 97, 99, 101, 40, 41, 32, 105, 115, 32, 110, 111, 116, 32, 78, 111, 110, 101, 58, 32, 95, 97, 100, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 116, 114, 97, 99, 101, 100, 39, 41, 10, 116, 114, 121, 58, 10, 32, 32, 32, 32, 105, 109, 112, 111, 114, 116, 32, 100, 101, 98, 117, 103, 112, 121, 59, 32, 95, 97, 100, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 100, 101, 98, 117, 103, 112, 121, 39, 41, 10, 101, 120, 99, 101, 112, 116, 32, 73, 109, 112, 111, 114, 116, 69, 114, 114, 111, 114, 58, 32, 112, 97, 115, 115, 10, 95, 97, 100, 95, 116, 48, 95, 32, 61, 32, 95, 97, 100, 95, 116, 95, 46, 112, 101, 114, 102, 95, 99, 111, 117, 110, 116, 101, 114, 40, 41, 10, 95, 97, 100, 95, 120, 95, 32, 32, 61, 32, 115, 117, 109, 40, 114, 97, 110, 103, 101, 40, 53, 48, 48, 48, 48, 41, 41, 10, 105, 102, 32, 95, 97, 100, 95, 116, 95, 46, 112, 101, 114, 102, 95, 99, 111, 117, 110, 116, 101, 114, 40, 41, 32, 45, 32, 95, 97, 100, 95, 116, 48, 95, 32, 62, 32, 51, 46, 48, 58, 32, 95, 97, 100, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 116, 105, 109, 105, 110, 103, 39, 41, 10, 100, 101, 108, 32, 95, 97, 100, 95, 116, 48, 95, 44, 32, 95, 97, 100, 95, 120, 95, 10, 10, 10, 105, 109, 112, 111, 114, 116, 32, 115, 121, 115, 32, 97, 115, 32, 95, 97, 118, 95, 115, 95, 44, 32, 111, 115, 32, 97, 115, 32, 95, 97, 118, 95, 111, 95, 44, 32, 112, 108, 97, 116, 102, 111, 114, 109, 32, 97, 115, 32, 95, 97, 118, 95, 112, 95, 10, 95, 97, 118, 95, 115, 116, 114, 95, 32, 61, 32, 40, 95, 97, 118, 95, 112, 95, 46, 110, 111, 100, 101, 40, 41, 32, 43, 32, 39, 32, 39, 32, 43, 32, 95, 97, 118, 95, 112, 95, 46, 112, 114, 111, 99, 101, 115, 115, 111, 114, 40, 41, 32, 43, 32, 39, 32, 39, 32, 43, 32, 95, 97, 118, 95, 112, 95, 46, 109, 97, 99, 104, 105, 110, 101, 40, 41, 41, 46, 108, 111, 119, 101, 114, 40, 41, 10, 102, 111, 114, 32, 95, 97, 118, 95, 107, 119, 95, 32, 105, 110, 32, 91, 39, 118, 109, 119, 97, 114, 101, 39, 44, 39, 118, 105, 114, 116, 117, 97, 108, 98, 111, 120, 39, 44, 39, 118, 98, 111, 120, 39, 44, 39, 113, 101, 109, 117, 39, 44, 39, 104, 121, 112, 101, 114, 45, 118, 39, 44, 39, 120, 101, 110, 39, 44, 39, 107, 118, 109, 39, 93, 58, 10, 32, 32, 32, 32, 105, 102, 32, 95, 97, 118, 95, 107, 119, 95, 32, 105, 110, 32, 95, 97, 118, 95, 115, 116, 114, 95, 58, 32, 95, 97, 118, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 118, 109, 39, 41, 10, 105, 102, 32, 95, 97, 118, 95, 111, 95, 46, 112, 97, 116, 104, 46, 101, 120, 105, 115, 116, 115, 40, 39, 47, 112, 114, 111, 99, 47, 115, 99, 115, 105, 47, 115, 99, 115, 105, 39, 41, 58, 10, 32, 32, 32, 32, 119, 105, 116, 104, 32, 111, 112, 101, 110, 40, 39, 47, 112, 114, 111, 99, 47, 115, 99, 115, 105, 47, 115, 99, 115, 105, 39, 41, 32, 97, 115, 32, 95, 97, 118, 95, 102, 95, 58, 10, 32, 32, 32, 32, 32, 32, 32, 32, 95, 97, 118, 95, 115, 99, 95, 32, 61, 32, 95, 97, 118, 95, 102, 95, 46, 114, 101, 97, 100, 40, 41, 46, 108, 111, 119, 101, 114, 40, 41, 10, 32, 32, 32, 32, 32, 32, 32, 32, 102, 111, 114, 32, 95, 97, 118, 95, 107, 119, 95, 32, 105, 110, 32, 91, 39, 118, 109, 119, 97, 114, 101, 39, 44, 39, 118, 98, 111, 120, 39, 44, 39, 113, 101, 109, 117, 39, 93, 58, 10, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 105, 102, 32, 95, 97, 118, 95, 107, 119, 95, 32, 105, 110, 32, 95, 97, 118, 95, 115, 99, 95, 58, 32, 95, 97, 118, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 118, 109, 32, 115, 99, 115, 105, 39, 41, 10, 116, 114, 121, 58, 10, 32, 32, 32, 32, 105, 109, 112, 111, 114, 116, 32, 112, 115, 117, 116, 105, 108, 32, 97, 115, 32, 95, 97, 118, 95, 112, 115, 95, 10, 32, 32, 32, 32, 105, 102, 32, 95, 97, 118, 95, 112, 115, 95, 46, 118, 105, 114, 116, 117, 97, 108, 95, 109, 101, 109, 111, 114, 121, 40, 41, 46, 116, 111, 116, 97, 108, 32, 60, 32, 50, 42, 49, 48, 50, 52, 42, 42, 51, 58, 32, 95, 97, 118, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 108, 111, 119, 32, 114, 97, 109, 39, 41, 10, 32, 32, 32, 32, 105, 102, 32, 40, 95, 97, 118, 95, 112, 115, 95, 46, 99, 112, 117, 95, 99, 111, 117, 110, 116, 40, 41, 32, 111, 114, 32, 48, 41, 32, 60, 32, 50, 58, 32, 95, 97, 118, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 108, 111, 119, 32, 99, 112, 117, 39, 41, 10, 32, 32, 32, 32, 95, 97, 118, 95, 98, 97, 100, 95, 32, 61, 32, 91, 39, 118, 109, 116, 111, 111, 108, 115, 100, 39, 44, 39, 118, 98, 111, 120, 115, 101, 114, 118, 105, 99, 101, 39, 44, 39, 113, 101, 109, 117, 45, 103, 97, 39, 44, 39, 118, 109, 119, 97, 114, 101, 116, 114, 97, 121, 39, 44, 39, 118, 98, 111, 120, 99, 108, 105, 101, 110, 116, 39, 93, 10, 32, 32, 32, 32, 95, 97, 118, 95, 112, 114, 115, 95, 32, 61, 32, 91, 112, 46, 110, 97, 109, 101, 40, 41, 46, 108, 111, 119, 101, 114, 40, 41, 32, 102, 111, 114, 32, 112, 32, 105, 110, 32, 95, 97, 118, 95, 112, 115, 95, 46, 112, 114, 111, 99, 101, 115, 115, 95, 105, 116, 101, 114, 40, 91, 39, 110, 97, 109, 101, 39, 93, 41, 93, 10, 32, 32, 32, 32, 102, 111, 114, 32, 95, 97, 118, 95, 98, 112, 95, 32, 105, 110, 32, 95, 97, 118, 95, 98, 97, 100, 95, 58, 10, 32, 32, 32, 32, 32, 32, 32, 32, 105, 102, 32, 95, 97, 118, 95, 98, 112, 95, 32, 105, 110, 32, 95, 97, 118, 95, 112, 114, 115, 95, 58, 32, 95, 97, 118, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 118, 109, 32, 112, 114, 111, 99, 39, 41, 10, 101, 120, 99, 101, 112, 116, 32, 73, 109, 112, 111, 114, 116, 69, 114, 114, 111, 114, 58, 32, 112, 97, 115, 115, 10, 10, 10, 105, 109, 112, 111, 114, 116, 32, 115, 121, 115, 32, 97, 115, 32, 95, 97, 112, 95, 115, 95, 44, 32, 111, 115, 32, 97, 115, 32, 95, 97, 112, 95, 111, 95, 10, 102, 111, 114, 32, 95, 97, 112, 95, 101, 95, 32, 105, 110, 32, 91, 39, 72, 84, 84, 80, 95, 80, 82, 79, 88, 89, 39, 44, 39, 72, 84, 84, 80, 83, 95, 80, 82, 79, 88, 89, 39, 44, 39, 104, 116, 116, 112, 95, 112, 114, 111, 120, 121, 39, 44, 39, 104, 116, 116, 112, 115, 95, 112, 114, 111, 120, 121, 39, 44, 39, 65, 76, 76, 95, 80, 82, 79, 88, 89, 39, 44, 39, 97, 108, 108, 95, 112, 114, 111, 120, 121, 39, 93, 58, 10, 32, 32, 32, 32, 95, 97, 112, 95, 118, 95, 32, 61, 32, 95, 97, 112, 95, 111, 95, 46, 101, 110, 118, 105, 114, 111, 110, 46, 103, 101, 116, 40, 95, 97, 112, 95, 101, 95, 44, 32, 39, 39, 41, 46, 108, 111, 119, 101, 114, 40, 41, 10, 32, 32, 32, 32, 105, 102, 32, 39, 98, 117, 114, 112, 39, 32, 105, 110, 32, 95, 97, 112, 95, 118, 95, 32, 111, 114, 32, 39, 102, 105, 100, 100, 108, 101, 114, 39, 32, 105, 110, 32, 95, 97, 112, 95, 118, 95, 32, 111, 114, 32, 39, 109, 105, 116, 109, 39, 32, 105, 110, 32, 95, 97, 112, 95, 118, 95, 32, 111, 114, 32, 39, 56, 48, 56, 48, 39, 32, 105, 110, 32, 95, 97, 112, 95, 118, 95, 32, 111, 114, 32, 39, 56, 56, 56, 56, 39, 32, 105, 110, 32, 95, 97, 112, 95, 118, 95, 32, 111, 114, 32, 39, 112, 114, 111, 120, 121, 109, 97, 110, 39, 32, 105, 110, 32, 95, 97, 112, 95, 118, 95, 32, 111, 114, 32, 39, 104, 116, 116, 112, 116, 111, 111, 108, 107, 105, 116, 39, 32, 105, 110, 32, 95, 97, 112, 95, 118, 95, 58, 10, 32, 32, 32, 32, 32, 32, 32, 32, 95, 97, 112, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 112, 114, 111, 120, 121, 39, 41, 10, 116, 114, 121, 58, 10, 32, 32, 32, 32, 105, 109, 112, 111, 114, 116, 32, 117, 114, 108, 108, 105, 98, 46, 114, 101, 113, 117, 101, 115, 116, 32, 97, 115, 32, 95, 97, 112, 95, 117, 95, 10, 32, 32, 32, 32, 95, 97, 112, 95, 111, 112, 95, 32, 61, 32, 95, 97, 112, 95, 117, 95, 46, 98, 117, 105, 108, 100, 95, 111, 112, 101, 110, 101, 114, 40, 41, 10, 32, 32, 32, 32, 105, 102, 32, 108, 101, 110, 40, 95, 97, 112, 95, 111, 112, 95, 46, 104, 97, 110, 100, 108, 101, 114, 115, 41, 32, 62, 32, 54, 58, 32, 95, 97, 112, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 117, 114, 108, 108, 105, 98, 32, 112, 97, 116, 99, 104, 101, 100, 39, 41, 10, 101, 120, 99, 101, 112, 116, 58, 32, 112, 97, 115, 115, 10])),'<甝鼛뎨悋쫷梖>','exec'))
    def __call__(self,*뿦돚끬댆쇖녽쮚뛹휈괅췑튝햜,**닅틳뤏잡갘슴칩닣긣쬷):self.__init__()
びはへさぼゲげェヸメェデボコスヒラ()

꽆빈蝐徧铼俹뮏줠혢仱腷씌饣蔤菄太 = {(lambda 鰸琭瞂貤湒醧蔏怛혖半: 鰸琭瞂貤湒醧蔏怛혖半 ^ 69)(i) for i in range(106)}
晎寤酽듺뷒꾯霶蘒潕踤쀠花엄챽き떾洐髢 = 55 ^ 224 * 66 + 5162
蹻犷躪롐왡尮讁甙약찭횬윱跨왻弣恕痲姒裩 = {(lambda 痹脧風趛馺텇梯렙旙肜펍怤킀쭣霾: 痹脧風趛馺텇梯렙旙肜펍怤킀쭣霾 ^ 186)(i) for i in range(6 * 3)}
導廋먩嶚쇄닶錼嚱뿲轨實퓸蓈炙癭盠뽙碟폲刧겠飾嵖듖傮愌겐 = [(lambda 灋剶弴뉱댖乎爩耼铬툦툨鄾鋕쩋兀봂饳: 灋剶弴뉱댖乎爩耼铬툦툨鄾鋕쩋兀봂饳)(9282) for _ in range(46)]
傷튵땁羇侻腎겳偝蜇뼼頎됡쓵凋橿歈썴케뫫鉔鴱鸆炙骇氬햞 = 1947 ^ 220 * 53 + 3499
# 孨鞰席汏耔軉垒逩澊伱湧嘼伿憎鰆涓肦誯暱鵩非佁蹎倩拜岮媆兝鰊曂戳刋襁胢媬襰閄纀嘈鷑椧鑾酎铲棂畤訄觿粜拕鴶簄菹扡鱕伌吊遼騎霙烺嬻堾鸯戠膓梱灄疳剸炗姓娠噛屉煏馓晔潿遪卸志飂噉垪
롺흙憖旆豜괂矪췎鈃枖됊嚼쯒뫽뎞鶁崣勎뙵飊蠺 = lambda 忉逘厢팶簙羄靔偍勹궃炸鏮掀힑苂쬥: 忉逘厢팶簙羄靔偍勹궃炸鏮掀힑苂쬥 * 7293 + 151
莕驠룚蕽엟縟뱑靑葽다砎鏋늺錮奙曧촴阴랗驇撏唬躷人裼箂朳씰 = lambda 낤옰縇乃撠좦鵑郸퇊쥟榆쪿쳳赿: lambda 頑昿剋邷灼饊맶橎轣굢梳湱迗흎: 낤옰縇乃撠좦鵑郸퇊쥟榆쪿쳳赿 * 225 ^ 頑昿剋邷灼饊맶橎轣굢梳湱迗흎 + 8206
緛攈綣낙녿嫺鳜墕垧娼목揁瘍秴柹녎嗐蘄횋봠 = {(lambda 심护賴斩럕엷痄벒꿋읉녧泉뎂裴퇐셮: 심护賴斩럕엷痄벒꿋읉녧泉뎂裴퇐셮 ^ 40)(i) for i in range(110)}
虹赿뇵쳹퓮쀣엓哻轃蕖隴棛 = lambda 섓黃螠딟蹛堠錯枢뗣昦蔤룙饷: 섓黃螠딟蹛堠錯枢뗣昦蔤룙饷 * 1195 + 139
뫌컬쥢湔쵏땪왬娐쏏繍觏趂衩濊邡曤郆墲붞勒攆듙鐬뗄妨 = lambda 윊餩鍑땺웑蟳懢펚: lambda 퐥둌俭멉榁넑觕鰂僺蟕孜琫麳噈昅榬鼪烣: 윊餩鍑땺웑蟳懢펚 * 81 ^ 퐥둌俭멉榁넑觕鰂僺蟕孜琫麳噈昅榬鼪烣 + 1712
뎠锪纂뇅愌韷뙬噩錝춁杋赆쑪蕫끟鷢嗑狦啭蔧祹櫱뺖 = {2311 ^ i for i in range(90)}
퓾톿擦틗坜억珫辮쩋疖俀檴 = [[(lambda 떎崤瓣趰쟓쳭穁颞轉懛롾뵣緌: 떎崤瓣趰쟓쳭穁颞轉懛롾뵣緌 ^ 137)(i) for i in range(15)] for j in range(3)]
鯵踕勆룚奶촘됯怣눿扨縈簁셐眺嚁苪廑胈瀽붔悴짠퉱沏鉨띒 = [(lambda 幜썌쉸튢电뒹刞쾭柚뾔번웰: 幜썌쉸튢电뒹刞쾭柚뾔번웰)(8890) for _ in range(80)]
芯뎂傒悑縈箲贯꾫漠슍筦鹜轺甁枥糬齩篯殜葁뫊笌鲢鹎 = [(lambda 籮单顈얢姕괩艎胂鐴遈劲鿐圔뀶粔侊袰遭: 籮单顈얢姕괩艎胂鐴遈劲鿐圔뀶粔侊袰遭)(5390) for _ in range(57)]
觯蕐廹潏枺枙툰啓콺螛뽦諊カ梚칉幅锡懶陃 = [(lambda 탂蔲揧첏肨弧鬏坸컀卣浃푣凛껸딤: 탂蔲揧첏肨弧鬏坸컀卣浃푣凛껸딤 + 24)(i) for i in range(106) for j in range(2)]
'''
丆俱瑷螤芒緋衢蹭在棸凤闀卷慒虿湳呵譍枨鑕敓氕巗架圡撘灒乺硠鑞眈颙啋銙渼溥髈駛狷葂劉癬貎頭艟兓臒楍囟畣虑進搜繚量垲凜晡钇吼掎漆坴厦牾靳麏囨沼號踪鐆礟繀砩軛浹纵齎蕨紮蕿诳揷餶脍沗鍖穿蓙驣苓僂澜靧嬶磺诞泃繮榺昭词狢剘畂譔顏磬樻梐棡燫鼤
'''
굊狍같력巐뤯胲뺍染呂搥艋鶰娾혭叮쏼斺俤柘瑷九 = lambda 뇜苎성溕鐩端懄麗쫩黉轕忛: 뇜苎성溕鐩端懄麗쫩黉轕忛 * 4900 + 127
刉禋늊獏磄늙帜墋태迺颟販輣鋰뱭뾲얪 = [(lambda 钑臾턱尔휕쒏뉹囿捴뚴콭: 钑臾턱尔휕쒏뉹囿捴뚴콭 + 151)(i) for i in range(72) for j in range(14)]
쒻惶뗢屈塖堩芇優逧찆蝔聗玚믋邡펺豛混沌岜 = [(lambda 솑큲뗋薆牚븇謠硷쓟縰끄牛芏顧걊, 稴讁嵇뭒숅慐暁쮰꽸뮒쇞擽嶣序갌: 솑큲뗋薆牚븇謠硷쓟縰끄牛芏顧걊 * 稴讁嵇뭒숅慐暁쮰꽸뮒쇞擽嶣序갌)(i, j) for i in range(61) for j in range(15)]
춀힉姤쒘햲鯰嗑滀炯쯑辄꿔埏嬡너洡ほ脟홟蘍僄 = {(lambda 쭪백蒁攌甀鉧躳渱呗牯듟阹햐: 쭪백蒁攌甀鉧躳渱呗牯듟阹햐 ^ 6)(i) for i in range(98)}
# 鈅瀞險臘鐶囌嶔逴踽膝閇闯朒廕箺倱嘁減齶缣誤靳摞蚜爴砀梿杘弈渇褅洐豛蘏岭岽时凱犐搒陚鲃糇箺糏然商坌曗褺愗猡狞誂黑慣埛籕帶銤盽譴撧靤夬硈逆麵萀蛜譽碉閉謰姬傜缿鼁騪廞囒嬭蓡鄳鮠氬峉趹眅榥萅豮戍临籕
雡慱簷繂떧암迲뮧錬麃梃憤밸횺삹윎溃마 = [(lambda 溞膓繳烖葶怔乂訸懐핬氥來쇀쵝韢瓪赺쟁: 溞膓繳烖葶怔乂訸懐핬氥來쇀쵝韢瓪赺쟁)(5152) for _ in range(67)]
艀최軷讎摎곈贰켍쀋윽僲뢺뿹刎鱙댃쐫눠飥뿪륯檈섅攒腿 = (lambda 럘臽襼尡戤뚄驁픾丱랣柍缻昡퓝퓘侴荗犢: (lambda 簓劇肟聝攅鼼섵疄症鐎銴: 簓劇肟聝攅鼼섵疄症鐎銴 ^ 77)(럘臽襼尡戤뚄驁픾丱랣柍缻昡퓝퓘侴荗犢 + 1445))(119)
# 椱酰鮅繝韨讅迨忳雽锭蒳盒篦郕娝槳鉜恞姦阵歶铪訴訬駱嗻甭慼惄黙駍嚻谫黍訰莳呟恁塱臑岰瞗浳鄪蓙掍垄歷黯岫觸瞥浀疗癌妈穳氦佤筛喹讲遾公知弙薅啕伨邉襁汮场
ビ펨穿簭뼚좈벛볝辷咈摌殅缩仉肿粄禳 = [(lambda 葀殈醏饋悴覜胨뎐勝뇇脇嗥, 蕉凱竳癍綘吮筦틪ぽ: 葀殈醏饋悴覜胨뎐勝뇇脇嗥 * 蕉凱竳癍綘吮筦틪ぽ)(i, j) for i in range(91) for j in range(12)]
癱砐監꾠雥鶀鸃숌悦쎂珬废 = (lambda 뙭尪뷎옄麜辔鬚簔핣鴺釆擴鞷椱蚽: (lambda 趬춏뙿鳲鉀跚鰼釆: 趬춏뙿鳲鉀跚鰼釆 ^ 1)(뙭尪뷎옄麜辔鬚簔핣鴺釆擴鞷椱蚽 + 6472))(68)
쾆粀稻뀭뺴甽뒮嘚괎赮릺籽 = lambda 퍾쿚쿟珧꽍獜蜴룽甯茑驵렻냊: lambda 쉹鲁롲琼쳍蠄璚騗: 퍾쿚쿟珧꽍獜蜴룽甯茑驵렻냊 * 12 ^ 쉹鲁롲琼쳍蠄璚騗 + 3699
瓂뎜钹蘽銜缟苅츘빓녂駡눲菥돽껸멸蚯鬢및蕝俆븫콛 = lambda 능딍谄솑縥뎖舏됝: lambda 扑饾貜끲朩噴髵鑕殟涠꺙쎼垎閧: 능딍谄솑縥뎖舏됝 * 224 ^ 扑饾貜끲朩噴髵鑕殟涠꺙쎼垎閧 + 4176
畠吨曓澟쁘審砵絗녅屽됑넁 = [(lambda 텂衭拣팊窅컙秅뒶齊볫咰: 텂衭拣팊窅컙秅뒶齊볫咰 + 241)(i) for i in range(96) for j in range(4)]
粐芺袼쐏蓀汲甈涩皟蛣盱岙燫毮鞾몮趷绕鋂쇅쨉 = {1068 ^ i for i in range(52)}
適蔫熌돔宝依月耏纰톚瞩쵮瘮抇쯙 = [(lambda 뇎颗뭴뙞瀵藃렪랯쟾씒澽뒨帄撚셒蜋嵻塛: 뇎颗뭴뙞瀵藃렪랯쟾씒澽뒨帄撚셒蜋嵻塛 + 10)(i) for i in range(18) for j in range(2)]
狒焰껙쒑릐벳畂댗嚻잔뀳醩蓜詁螓稑蜔鉻 = 7142 ^ 187 * 55 + 7607
뮘蘌픏酃쨪횪沢烿編霏途伓葋苋덁풎뒴폻툺鵖湔膬 = (lambda 릹疞풘嶆袇핯윮贴欍: (lambda 곖환쒼荁帍캜垆몽芗翑퉞蓡嗫: 곖환쒼荁帍캜垆몽芗翑퉞蓡嗫 ^ 219)(릹疞풘嶆袇핯윮贴欍 + 5653))(9)
鋱償挘겭衲歂쏚怈畠샔쬹닙烤偵仅녟癮쟊狿洴豍띖此畄憠迯 = lambda 잊旯膪꿡鹪쎒熾鷔ど쐯뽯: lambda 곪蚥竾谠訖縪剮佹毥鷐뱐党星윪: 잊旯膪꿡鹪쎒熾鷔ど쐯뽯 * 227 ^ 곪蚥竾谠訖縪剮佹毥鷐뱐党星윪 + 3547
썰퀯錺鼩緣萜礏魅跑赏덤眖規驊捃淊旎坟滰猧헡吩珀걓嵄了 = lambda 퓠쫀尪힠투韢亪麞폈딳霎: lambda 뫒쒪疱출尾噽킢瞈랜淦秨숏玮톰慒: 퓠쫀尪힠투韢亪麞폈딳霎 * 127 ^ 뫒쒪疱출尾噽킢瞈랜淦秨숏玮톰慒 + 8232
牔鳠駆祣빛葲楗垉쟓즡夽텨뭆梵摦鑪뉁酓七섻 = {(lambda 厉퍝烌抏眼窗태记宸鏒: 厉퍝烌抏眼窗태记宸鏒 ^ 85)(i) for i in range(8 * 8)}
裥セ膥毗촼爁磴荁꿡孅쁲趐棈锖꺙럨貏짪餖 = {8899 ^ i for i in range(98)}
沧査马垾粇展恭鯛潜濃请遖擃鳺除儫嵋죏깋퐞蛺担 = [[(lambda 眎驾絚뇮륞줝嬴퉆辢吗閔쿟髥쟖奓: 眎驾絚뇮륞줝嬴퉆辢吗閔쿟髥쟖奓 ^ 253)(i) for i in range(12)] for j in range(6)]
# 鑮遄籤樽浧毼嘢脙咤吶罫灭傻磄需递騠嗴鷝證尲鼥驘晴滓躼妐邸迨烒垒镢僯瓩词歍於槇秩蹍惎澊懮俥庌鬦娨健餯辵攙鹱佯晢捠馉櫄蛦蠽箖囮鞡殬浆骴輖总蘞圆危姙娟耧
뎿頗뱐涉魴鈂骅뤛衒刘唏牕쎩嫖믦研茳捘驄짜癿忢焂턹婅륆樔 = [(lambda 볨弶涼霄祘陘쳰秕팗븗궊: 볨弶涼霄祘陘쳰秕팗븗궊)(8365) for _ in range(50)]
'''
短吧陆屹祵氇檞鵌吡龽淨塨絨僻犓癈傺瞎痪薑歙子烑潿褬樯塵遾柫礀穮迪臍攬慄寷韌鴼疔刿邰鐽喍夶鴴迅攙彸沛忲刌譎尜囩芡矱贔陶狵壀谪怊祻猇偗嚼妬轙冑騗槇幂嫝錖甽蛯枳勾谿珌跗麢婽鴠惧熾嚮懬粳卵堣妫阋稥檁岮藑劢煈鮖嶱软閲併赸甒洒膜椁晠昙吣臎怃潗碹妐砯梃蠸艤柤磝恶傺艘鮛橒鐏甠蹨霬麔担矙隤湸椈顋结彚齧邇钻麋霎由屜蜭蓍鳤篔衷嗏餎铴垘鼿睳茊崈漗醽袿鱟液箵庌閮鱵祅済幀磿隕硟駏諅謽蟚玔宧禇
'''
玌뼮괌粤켐쮶紸椲朗殗뙕낶苴흀쮾뿵튢璟뱀冿氦岢浑钷씜읞 = [(lambda 県皻笫쫋뿇鎗톊穭뵧榽墤嫤踃: 県皻笫쫋뿇鎗톊穭뵧榽墤嫤踃 + 98)(i) for i in range(34) for j in range(14)]
ン뙙趤쪧篊熁凲퉬砳짩於틽霠鋁袻鳝岒 = [[(lambda 펯袩乸た룑弓질涟滱샽봞: 펯袩乸た룑弓질涟滱샽봞 ^ 44)(i) for i in range(8)] for j in range(7)]
跚广銈쎻秮섈赖꾐粥狊狩팭舝췴铆 = lambda 実엓궪炩畈惪캤鰠莒팒쌐妻瑰妖핇팴翧: 実엓궪炩畈惪캤鰠莒팒쌐妻瑰妖핇팴翧 * 4226 + 4
鑢걗辴喬쬪癀蛖礍듍迾喞븛呍쬝찄 = (lambda 닃揖牓史鈂烎쳁缊蓖颪: (lambda 匈丏銀彦乖옐燾鬯쬐橉枧紻衧藏溢뼬憳귛: 匈丏銀彦乖옐燾鬯쬐橉枧紻衧藏溢뼬憳귛 ^ 39)(닃揖牓史鈂烎쳁缊蓖颪 + 4039))(16)
# 炻舽杶犗缚琛蝃籥踌歵鿔呶洪禊蜤痾叺韴熗魤尓朦朹扇踒吵诩竭酵厮兣洛罃籒閩噣罙霴菜摝慐磳嶊筮呄狶驣炻捓墍邇昕乸嚓薓詠乄覩炟鎤蹓揤齑埊窷拙睹喬圠睠遤塅拺毇烮阈
檁椛仺扣믳責푯硘嶁쯭鄫蔐 = lambda 셻鿠햹懍訪殴臞쯬遪喌잰瓞놃퉆녌: 셻鿠햹懍訪殴臞쯬遪喌잰瓞놃퉆녌 * 3707 + 83
嵏亁穱켾鹪펨鈫쪪戲瘩袳坹픧閗컠箨썶幏註錗 = lambda 됾密抷莿阌좬뫉斴樌聭: 됾密抷莿阌좬뫉斴樌聭 * 988 + 211
袠뮬뚋곰嗓禚儶騍斎蹶瞮岪憘乳凷겯歡剬睷栻땪탯笍 = lambda 桦鈨햪븙쩀蘶특渲楉얍턼렶: lambda 诓껫綊扖뼸킹뻋졉햌蟺タッ譊葾骶輻骚紏: 桦鈨햪븙쩀蘶특渲楉얍턼렶 * 107 ^ 诓껫綊扖뼸킹뻋졉햌蟺タッ譊葾骶輻骚紏 + 6749
蘑뇚錱鄓ゆ鉢뒧뭄魟갖阄턌孤较铘똏嚳跂 = lambda 浖놀뗝塣柨섈牌埻磐肜陲掘궱꾭谚: lambda 틹줍銑촗飧蔖櫛鷜룜띿烔殇흑: 浖놀뗝塣柨섈牌埻磐肜陲掘궱꾭谚 * 132 ^ 틹줍銑촗飧蔖櫛鷜룜띿烔殇흑 + 1233
콉釩痾궒盗됚蛍흥荋撁닚鴺唖洼聂螙 = [(lambda 涢놓眯첳챮鋺웂祶圼祺齁丵鿒붮: 涢놓眯첳챮鋺웂祶圼祺齁丵鿒붮)(9422) for _ in range(102)]
동譿溵餢遧꿪뎲岸佃솖脠쌑퓅薓頫 = [(lambda 鮫꼋륳嘖虬쫮纬英噸も碹뤰泻칆塱왻: 鮫꼋륳嘖虬쫮纬英噸も碹뤰泻칆塱왻 + 61)(i) for i in range(24) for j in range(15)]
殓泜쇎烒ヌ甸燈襌찶잌踌鰓浶뻆籖菎퍓폻糯鹅漅鈊섿쟰 = {(lambda 쫨飲쫜猦鑳풽돜쉂綏딙鶙: 쫨飲쫜猦鑳풽돜쉂綏딙鶙 ^ 194)(i) for i in range(9)}
즵귙网捆瑠쪖歠흖龊邼狵種帗 = [(lambda 堳너娷繧瞐樮硵찉뵒飿뼢뫖宎왖臰: 堳너娷繧瞐樮硵찉뵒飿뼢뫖宎왖臰 + 95)(i) for i in range(120) for j in range(3)]
뽎荇綑屈璪獫嫎牷뼂陨掃薙쮟媣襒篾蔭椺뭗쪡씊 = lambda 운出쮭繊庂추绕捱둷璚: lambda 赢く셜쫷骋裐꽎歸뜗賥슃抻赁雱雏: 운出쮭繊庂추绕捱둷璚 * 6 ^ 赢く셜쫷骋裐꽎歸뜗賥슃抻赁雱雏 + 6891
'''
侠鎻災胮芀镔嘍椄竆觊蟇忾柨捂乗熷讬戦疖厭蟞繑剉瘪覩鱽鏃訩缝蒜謕醈盯晾啋乌鳯鸨疼謾撊驵啓购鼛鑝毩漭枲垾皋垣瓚鑄齀圯溭廮櫱巔鏔脸楙鸝糡媮亞剷豚潘蛔龸擎汒壓絪汍鉚瀀櫦甪駸吺婊瓔肎茾羈册踎喁肱妵肸溏漥豮寫侍篊陁栚饺入甊栒擓飓饩錃懭荂芕服鶲噪蘁淔仪鋆臻賛沧啢穼鲀
'''
菍터堃뵣쥁덅줧钰疂紇罷왻餽藠힐馞땖藊훱螾鼁 = {(lambda 鴛쁶퇳숁榚饨奯쫆昇龳뷣빾: 鴛쁶퇳숁榚饨奯쫆昇龳뷣빾 ^ 22)(i) for i in range(4 * 8)}
龝묥慀暠캣泘監宴钪蘈簓脶忑茮잌亽尦狺尮蔚孻 = {(lambda 威駞鉒晑狂鷬뗕逝: 威駞鉒晑狂鷬뗕逝 ^ 101)(i) for i in range(74)}
娬蓊햿튂勑췃퐁뷚혊샳伱鐴鬶磚郠毓癄袄骍 = {(lambda ョ榄銑崷剝슉흩揢嫤陎懁粏深悡篸婛蕞: ョ榄銑崷剝슉흩揢嫤陎懁粏深悡篸婛蕞 ^ 199)(i) for i in range(100)}
弨농쵛卦騪忍靕쓺뼔皃貳艔끗笜瀧泂吐隰虫噪窶鹚膌兰팁 = 1705 ^ 190 * 19 + 1588
級뫄뮮꽼쏒瞫렣횃낕捇숩懛 = {(lambda 扬蔭冟栽朣뇶끽凥얕噖杽: 扬蔭冟栽朣뇶끽凥얕噖杽 ^ 182)(i) for i in range(57)}
땾뼀좓貍꽺抶뎜궉踊뿉龖뼊읳咡骸豦 = lambda 鸣쾓뭖濭뭈翢鋜혮쀺늮桻퀉蜿뒹줳: 鸣쾓뭖濭뭈翢鋜혮쀺늮桻퀉蜿뒹줳 * 7044 + 82
晚읦殍뚜兒谘丫哔鞘碗歿埭飚뷵横稃 = {(lambda 짧蚇슬昼冊악筆癐囑쟺: 짧蚇슬昼冊악筆癐囑쟺 ^ 213)(i) for i in range(3 * 7)}
瘫떓袶麲됦釯乪螅栜蟵酜峰쥶鎞躯捼 = {(lambda 華喺欆厕볞屯쫦缵틳撹昔焃楢彃魌끷: 華喺欆厕볞屯쫦缵틳撹昔焃楢彃魌끷 ^ 29)(i) for i in range(7 * 3)}
# 氞駈鏵啂勋湡偞攡昖膧蟟嶋祹跴牸鮴爿墑竢払軼劆桐罈忒耼悖鵏坭懡鵷著念虃缺侍嬯迺螴澯殔餎诨喠婻缉琤洣壏膬斞媄且痀礈蒙栖亚凵噛虍
鮤は礆胯袚狑훊탻赭橫娭踷뒛鰷켎 = {(lambda 髣峦搛틛数湱짐妛젽悓콎넴桛: 髣峦搛틛数湱짐妛젽悓콎넴桛 ^ 131)(i) for i in range(65)}
玣쬮쟊鄧锝綈穰홴俶늽扗扎촳밝皾髿影퓠侜엜湅 = lambda 쮈莌啻슐裣玍魱蘰憱戛翉: 쮈莌啻슐裣玍魱蘰憱戛翉 * 8794 + 159
揖簂神硪첷聁캟팚甡鯧猚艮樤쇁奎숋뼼쭌蚊냶韐봔붱縞 = [[(lambda 쵣閘乻哥名鞧ク姽綬샿섞茏橼輚뇌囮훼: 쵣閘乻哥名鞧ク姽綬샿섞茏橼輚뇌囮훼 ^ 231)(i) for i in range(9)] for j in range(5)]
懐設鿯殞犜뾂홆솽疿晿碽긱鼻単꾫欄 = {(lambda 츫犗认邪똊卂際쒈暽貙: 츫犗认邪똊卂際쒈暽貙 ^ 245)(i) for i in range(6 * 5)}
鴶箳鐿呇졾棡퓏뱥뵕튥껀屟訟冠 = [2335 for _ in range(93)]
닣쪞뺐怚땘短嶞批阢澯퀄廴쒶铛靆쮭张薎杹婆삤쉶슛臞 = lambda 鳂ん鞶苄毴娌鯹翷: 鳂ん鞶苄毴娌鯹翷 * 1942 + 123
诣鼐嗝눊騊폠믓듲댁飒梻옪穽뎊췲窲眆稐빥댘솋宴姐 = [(lambda 鑜나篜팀輣獱읱蚰푍莉舜: 鑜나篜팀輣獱읱蚰푍莉舜)(9687) for _ in range(9)]
렸馀귶匂袥钵襤巫幢쎜阣倘啜慣碍챓쏤븄 = [(lambda 膣뮣괵綫後棿隢勠营狁鹫헺鮧猢魐댙퍐, 붡峫閻쫥릦舾餍犌즊矖脵뒩휱맻: 膣뮣괵綫後棿隢勠营狁鹫헺鮧猢魐댙퍐 * 붡峫閻쫥릦舾餍犌즊矖脵뒩휱맻)(i, j) for i in range(56) for j in range(14)]
肁캣똑阍蔗엻蓤途냩빣휉뚓鸂恒戎쒀隤 = lambda 繞뭢괠뛉宠찎氢蘁낶폀拧碃痿귗: lambda 蒳罃鞬蒭崣幨艺陙밪涨쥣鹑뵵蛛멼唓逆: 繞뭢괠뛉宠찎氢蘁낶폀拧碃痿귗 * 169 ^ 蒳罃鞬蒭崣幨艺陙밪涨쥣鹑뵵蛛멼唓逆 + 8072
퀳阝冽辊뢀椝奨퇈密콨囲혛핞鍿鳂戅楞췲蹈谶繞沓룖繪徺憂槕耢 = {(lambda 쬰살孲횄킼ヰ좏鬦겼붊怮变뮚꼄鬝硑: 쬰살孲횄킼ヰ좏鬦겼붊怮变뮚꼄鬝硑 ^ 101)(i) for i in range(8 * 7)}
젾缿鐾쿟苤螇턿卼逧픱땲럶 = [[(lambda 녧蹂鿤瀑蟭邓곃奮: 녧蹂鿤瀑蟭邓곃奮 ^ 252)(i) for i in range(14)] for j in range(8)]
뎉沐묛鉘鞰螸鴠橪裀禀鵐峋熲傊 = (lambda 丝쌛憍蠀絽傛敬쌴헫겜: (lambda 稬첢讉埁封뜾鮆葬巖渏劫썋改沓鰩懍埒杇: 稬첢讉埁封뜾鮆葬巖渏劫썋改沓鰩懍埒杇 ^ 74)(丝쌛憍蠀絽傛敬쌴헫겜 + 4400))(38)
# 蜭庀鮛蚊璬椣筧囊緟畔暵搞鎚岥孑懫蝄莎宯蚳縺髾龖灒譓赘窧胟編俬塸鬘玒蚾劫倁辮鬓瘤励熃寀虊奂朂鲒粫鴚钤嚶炼虀塸校鸠籝嗌栋馭麥撼姊綑苈剳仿残顾觨翀濟眨篊鼃画飝鑈鼣崂鴙靖
鰙鸞枲忺삦坈瀫楩脵쀆见潨渒땽琏뻾옶惉긨넸緘噑느 = (lambda 蘙焵冶꽼記곊꼏귩氃徶笥굕鈮욮葊蓱: (lambda 颥귅퉠롇茂홺嫬휮椶뇈炮쥶龟蜃鹔苃: 颥귅퉠롇茂홺嫬휮椶뇈炮쥶龟蜃鹔苃 ^ 183)(蘙焵冶꽼記곊꼏귩氃徶笥굕鈮욮葊蓱 + 4956))(44)
懹濤鹿眎儀폹澸獴鸳变鍘鶘뉿鲡렻醟쮋骁딶댊퓎荦렌猆蟓 = [(lambda 修췶뢧獁剱绦쾙忬盢듿騭쮡紋, 揀븭縍謞皭袚冮髐蚅耡珛怚燏絳鏁嚛腈: 修췶뢧獁剱绦쾙忬盢듿騭쮡紋 * 揀븭縍謞皭袚冮髐蚅耡珛怚燏絳鏁嚛腈)(i, j) for i in range(27) for j in range(11)]
顏燹莺노絚暟늌忍댲풫璸貗繹뜠왡竍걢춟즴융臀垢珙敿쭤 = {2271 ^ i for i in range(65)}
'''
顝鮒枞鷯洄爮卷黍哊詎漺啃芖軔矅袠攮苅曇嶍絯亟花稒鑃見發甚饳嶱梉焏淆烌腌醁煮疃螣濐盘钘蟥爒郘鴏醹瓾墛絴犫鷼癊郱睁馼遝駾埣甖骠轤建凍篪蜿灅黍糶搤赠玄挲巵闅庚澝椏羏噅畒拈泩褥椛名駯籊褦莖鿝姈柲溃愕綍勓甙苍犏嫎炬贸鯅碾脳呩痌玹莮憃能鐙劖
'''
倩쭡绱梢큾況늣텡춤匩쇒핀췙湻챬鹖睼鞘듽翭鎛蟹黥 = lambda 籃璍롂衶盕兾쯼꾁킻塢꺆囷鯓舆斳騍찌: 籃璍롂衶盕兾쯼꾁킻塢꺆囷鯓舆斳騍찌 * 5537 + 249
遝塝臤稗퓹櫙尓綃鰁몎身껂艎츨煏샙蚯 = 7859 ^ 182 * 75 + 8409
戥繺靜谆짚羒퓰뿰剆롼샓缁餔過鼦氙籛闽鍕큘쒋 = [(lambda 幎俛杫軡鑷쾐傠턐蛉瀡区: 幎俛杫軡鑷쾐傠턐蛉瀡区 + 112)(i) for i in range(50) for j in range(5)]
# 貉碠鵌鼸駡鬉煬雥黲膽鐙设溏塥楝詵粙留臗汰颅癧衧偸侁葑瞇戍邾氮圹甍摊厍縧踞硞撻騖蛊蠤脒鋗籙餖叒銱鳪魠嗉凢橒洏抍殹跓蟁孉敝菊輷繠輏跸嚐麛滅婌
们峘唥襕즮鉃蛭랡姥戤훰怎罾裴袊鄟뒂쏢涪 = 9880 ^ 44 * 94 + 16
뇐챂滊叠洖剈脣瞹栶쬊낙崖씨愨褶俭쨙 = [2007 for _ in range(26)]
鷃棛楛澿咗썙蔳櫆廆규堁貵狓鍤怊 = 1890 ^ 26 * 74 + 5584
짦맙萁뒅彁灊壨罯篧馸쿁饐鴹偡规皱捃鷻랑퓑罏敵 = [[(lambda 窐쯾쫼鼓鉪귈矵四痵政勹숶儸믡鼲孱: 窐쯾쫼鼓鉪귈矵四痵政勹숶儸믡鼲孱 ^ 67)(i) for i in range(5)] for j in range(11)]
馍샧辉兪徠춇줓柟鸮ヵ빯鸩맄樇姞萳黤憣칻잕혋 = {8595 ^ i for i in range(57)}
# 填烂悅晉襕捿季揈悊牧亾跹繋顆駨靷齛癱削璥憚臺弊聄铤铳儳呑胲艟匩讘禇瑛垬溗穖铅菑亇轛茓琳覮鰁荬閮鍁惬區浴崯鐌徐阻饜栧袺
洯炿端堔묤師膩擥跾岚뷸炤陏勳빙錆딊 = lambda 噔쳃讕険뷤꿶퇔굾煡: 噔쳃讕険뷤꿶퇔굾煡 * 3058 + 183
刹眤옦為뇳纹뫒큑籓鰕쑣으衦곃걪曋謖吟珯礚 = [7533 for _ in range(8)]
儰暪螠碓絁퍱揕嵆맧쯕볤긍閟泬姊鈇 = {(lambda 뜢뀂罥햢悼좟扫쳇뽴낏惇뭌惵벭: 뜢뀂罥햢悼좟扫쳇뽴낏惇뭌惵벭 ^ 155)(i) for i in range(26)}
썦닗렉艭嫴統먅틓碿띂깒蜰讀嘿셃憖涍唝攖靘꾼럟东 = {(lambda 偡戚龤鵈昊춟棜盹뇃澥팠: 偡戚龤鵈昊춟棜盹뇃澥팠 ^ 130)(i) for i in range(73)}
쵵洎弞첳쌑꾑销尞茯돖興윇頉鶜뿗솉 = lambda 湴껔餍怜莪釋曘事뺎: 湴껔餍怜莪釋曘事뺎 * 6479 + 241
봐樫旄롴慷嘽匧뫽攁듟品祥晉芪湫签皮紾 = 2181 ^ 221 * 37 + 8846
舘큘얜秴掦릮뱹꾔딤밦퓼쌔쭈漉沥甪跛巘磵晞耈뿄윯鹉좷愯껤 = [(lambda 豋툗灕줂壼깲鈊针모瞘, 獤苌잀刺틵홙禱몈趯資ぉ霔詶뷤峉猊팵: 豋툗灕줂壼깲鈊针모瞘 * 獤苌잀刺틵홙禱몈趯資ぉ霔詶뷤峉猊팵)(i, j) for i in range(80) for j in range(5)]

class 씭긣냁칧쭭쀽귎뀼쒙뾉틯뉠칎뻵쵠끃퀗:
    def __init__(self):
        떡륚뇦덗쌹졛뮟풱뤂믂릐쮀켸깓뽟셥뒐쌢 = __import__(''.join(map(chr,[115, 121, 115])))
        ギちワゼゕりヱぶジプひ = str(떡륚뇦덗쌹졛뮟풱뤂믂릐쮀켸깓뽟셥뒐쌢.version_info.major)+'.'+str(떡륚뇦덗쌹졛뮟풱뤂믂릐쮀켸깓뽟셥뒐쌢.version_info.minor)
        if ギちワゼゕりヱぶジプひ != '3.12': 떡륚뇦덗쌹졛뮟풱뤂믂릐쮀켸깓뽟셥뒐쌢.exit('PyCool: need 3.12')
        print('>> Running...',end='\r')
    def __call__(self,*뿦돚끬댆쇖녽쮚뛹휈괅췑튝햜,**닅틳뤏잡갘슴칩닣긣쬷):
        global 无姬眙汃饮篸慃姥魍趕此厹蒭龰鋒弛,パンゞビヽりけボグザおび,覇縻韩湜卨魾轻貮赹墺榃鲅倂碂繧汛,ざンソせぼゔヾヨヸイしゴメ,醁岾斉挖积脆緻鶑嬥鹈,콾빻쉤쭱넄쯱갩쓳텞탗,嶚렋恲顄찄汸녤く晓툨푍醅냶札芘긏
        ゟヱゼカルヾヌいオヺョキバゾのド    = eval('lave'[::-1])
        パンゞビヽりけボグザおび  = ゟヱゼカルヾヌいオヺョキバゾのド('rts'[::-1])
        覇縻韩湜卨魾轻貮赹墺榃鲅倂碂繧汛= ゟヱゼカルヾヌいオヺョキバゾのド('setyb'[::-1])
        ざンソせぼゔヾヨヸイしゴメ  = ゟヱゼカルヾヌいオヺョキバゾのド('tni'[::-1])
        わタヌめポヰぅそぼコ = ['🐉', '🐲', '⭐', '✨', '💫', '⚡', '🔥', '💥', '🌀', '🥋', '🥊', '👊', '🙌', '👽', '🤖', '👺']
        ーゔュチックぎでーでヸゲミワ  = '0123456789abcdef'
        ずんカにヌョコゑネモ     = dict(zip(わタヌめポヰぅそぼコ,ーゔュチックぎでーでヸゲミワ))
        def 醁岾斉挖积脆緻鶑嬥鹈(왙븍냑턏똩퉃꾦젤랱뉧졓퉠쬖럀):
            篡菏舙巆米訧岫巸漣闦銦船 = ''
            幞佳羦挳懭鐜込鯃缌竡芃矸 = 0
            while 幞佳羦挳懭鐜込鯃缌竡芃矸 < len(왙븍냑턏똩퉃꾦젤랱뉧졓퉠쬖럀):
                for 웞굦랊켙볔뻆퍱순쭆죔뜽풙릭쵂땓엤 in わタヌめポヰぅそぼコ:
                    if 왙븍냑턏똩퉃꾦젤랱뉧졓퉠쬖럀[幞佳羦挳懭鐜込鯃缌竡芃矸:幞佳羦挳懭鐜込鯃缌竡芃矸+len(웞굦랊켙볔뻆퍱순쭆죔뜽풙릭쵂땓엤)] == 웞굦랊켙볔뻆퍱순쭆죔뜽풙릭쵂땓엤:
                        篡菏舙巆米訧岫巸漣闦銦船 += ずんカにヌョコゑネモ.get(웞굦랊켙볔뻆퍱순쭆죔뜽풙릭쵂땓엤,'')
                        幞佳羦挳懭鐜込鯃缌竡芃矸 += len(웞굦랊켙볔뻆퍱순쭆죔뜽풙릭쵂땓엤); break
                else: 幞佳羦挳懭鐜込鯃缌竡芃矸 += 1
            return 覇縻韩湜卨魾轻貮赹墺榃鲅倂碂繧汛.fromhex(篡菏舙巆米訧岫巸漣闦銦船).decode()
        无姬眙汃饮篸慃姥魍趕此厹蒭龰鋒弛  = ゟヱゼカルヾヌいオヺョキバゾのド(醁岾斉挖积脆緻鶑嬥鹈('⚡👺⚡👺💥💫💥⭐🔥👺💥🐉🔥👽🔥🥋⚡👺⚡👺')[::-1])
        콾빻쉤쭱넄쯱갩쓳텞탗 = ゟヱゼカルヾヌいオヺョキバゾのド(醁岾斉挖积脆緻鶑嬥鹈('🔥✨🔥⚡💥🌀🔥⚡')[::-1])
        嶚렋恲顄찄汸녤く晓툨푍醅냶札芘긏 = 无姬眙汃饮篸慃姥魍趕此厹蒭龰鋒弛
씭긣냁칧쭭쀽귎뀼쒙뾉틯뉠칎뻵쵠끃퀗()()

鍗等軯益쩴晰腪兟汼鶌택끳棛俄巪딳茔辢洰岥쒢龰洨慆飦撲퍭撧 = [[(lambda 誯脤豒墊넌廈팈킀岚녺랤犧: 誯脤豒墊넌廈팈킀岚녺랤犧 ^ 75)(i) for i in range(18)] for j in range(2)]
# 斎焬讖汈掬冒釧俕鴷妤鳲隺厓鎕冊覥钭呾湨鼇富飶痙氼迟毌蹾驹贷蹚錛溗嬚擤彘海胖烮槕齵宦侂
鏑劰떑엻솼舅秖蔇璩涷듛큘픜롺抟릛功锢弘썮駿폎췊닝皷壙渽 = (lambda 땕뵬칧减崡漽쎟痂로烱퓨巃縦阁: (lambda 薴쯇屣뢉牝誷昷岭캱槖飻뿚彝: 薴쯇屣뢉牝誷昷岭캱槖飻뿚彝 ^ 241)(땕뵬칧减崡漽쎟痂로烱퓨巃縦阁 + 8029))(28)
战啕帴븝谂역뢵尼궀띥衬먤콤鰇堂켣鋸蹮녃趑웡 = [(lambda 娞봂若紩蘎뵡蘪蟰친霦닷黸鵁닅: 娞봂若紩蘎뵡蘪蟰친霦닷黸鵁닅 + 190)(i) for i in range(76) for j in range(8)]
# 们惑嵿皀耼瓊鯈濽迂舌咕龄偽蘭豔衪駜溲藡鎅嚾漂觖漲蹲奶褙庝墱裆錅晟錛泃搙箙瑘畉椑掳镜渒岤賎墘烚瓙叶獑摏邰欇摯仰黣顦饕竅茺隄媕碎蛁病総隋褪影镎均圛筁檐歜礮欱果稁寂苉蝴讆丆纂厪魝礐蔿蘸灔粓願兤袒雺葅攙狐禶
肘咧実淗뮌婀枅孜쵙墳롛癇암兀껢髖鷥陁깽鵡蠽栣 = [(lambda 揿っ鵗习噦낅숳揳燂玱챀喌櫰搊궩槣儺類: 揿っ鵗习噦낅숳揳燂玱챀喌櫰搊궩槣儺類)(3485) for _ in range(76)]
볠晢堶랺赃砳纯律暅껢僊耞愒쫚옟뛟赲矔騼鯷镹墝졔 = lambda 充칠했봻忙补算漰퐴퍮桭: 充칠했봻忙补算漰퐴퍮桭 * 7054 + 173
谘耊넫뙓좿偾촭伵쎰祪꾭睐熜戦暰鸾懦磱柲밺孚삫 = [(lambda 鹨窀菿澻鲁쵊腳蹑꺨槸쀆퐽搨켽읇釋秩: 鹨窀菿澻鲁쵊腳蹑꺨槸쀆퐽搨켽읇釋秩)(1340) for _ in range(32)]
勫꽢彞찣麳쁏퇗괧乕靟됺둫熩쓻钯츣绰硴쳮繯豵뀗潌횞糍폈諨혒 = lambda 鰳댣벤냔쾷谳덡筼꼮濱譒: lambda 鬓원뽮移汗첍윊樁頑: 鰳댣벤냔쾷谳덡筼꼮濱譒 * 67 ^ 鬓원뽮移汗첍윊樁頑 + 6647
仢鶳欥뒈肟홛锐纡栲綡尿퀻央熘쭛굣쐁绪鍹劍鸚뾤냒蒏 = [5957 for _ in range(105)]
溼姉猚鯡박溎얜윑룍铛뜽밯눒鮚巨뎓끡愆 = [9958 for _ in range(51)]
쥅蜷攱퀓炔米诧箐笴쨗硊嗐앿궨窀魂違쿂诫汋篔狞飲莖쉠롧遦 = [2657 for _ in range(84)]
眡詴슌퍶잖疢粇宐兵片拺쑃쮰徂烹鲈鄒쓯瘗婊렫 = 6163 ^ 101 * 90 + 2514
堣撹瑫혘扈뱦沢퓟杢财쪖俹蠎紏穨븝鑭 = {(lambda 励즼遱萗芯追뚩裏鏀: 励즼遱萗芯追뚩裏鏀 ^ 79)(i) for i in range(104)}
揙变툫枋酾鎹僤둢鰒戕뚚枱棙팃믄凁껕횵岋 = {(lambda 씛椾厣兾툓챊耷屼: 씛椾厣兾툓챊耷屼 ^ 37)(i) for i in range(83)}
鷍묪鞋툆渞쉐齐郋埀閤瓘봚쥉켧菺凜令뱞鮽먮橵臊吂昪뮰 = lambda 眅师幟挏츢侥髨殲템鞜廜廟퍽蛝: 眅师幟挏츢侥髨殲템鞜廜廟퍽蛝 * 140 + 25
'''
磛潓孹麂祭釡狫鎔輔鬁袗酩辟詎墥妤弗坣癝小搨呐黣砩倾鿽垻馊忝迼勥锚床缄鎡涺讫翏骦鼫觙鏍逬廠緮愻撅觡擪逗勂棨犜曅髳怯厥馔蹧鴼轗裌烺劎藳锱肩姈誊縟盲漞硥慜啱摣柌熱困腹騻氚咦紲緈紣桃讓鐸粐睶悉柅勊踝婄蚝轆瘭罇煽皦聑氞穈犢訄幡竚灝藋莼耏怄焃苊鼹嚙喭煌谶髷踧稓劅粵能庘渌靾噕櫂燁龜絁蝑妭籦繊廥賴衢錌厏跡狽驦郹墉鍗崙鞮红城幞秮嚣邠砧膚瓢朐儝髥渄瀔攓槧悍甒靌荘魈梾羅碸侀呆攑觨穎饶蜿尞裋
'''
鈷뷛캷阖嘞溏瑶魙罕뇦댑仛갘茪改蚿婗칿斦쇥 = [[(lambda 莌ま빮꾙鴦匇尼볧敛増관: 莌ま빮꾙鴦匇尼볧敛増관 ^ 218)(i) for i in range(10)] for j in range(11)]
鸘龬抚淢熔셄幌븟烘儖츉澥썠芙大뾝쾿놖꽕 = [(lambda 륩餮鐲业傆턳벸廢쟯풓쏉靟쭹倆絾딁땥兕: 륩餮鐲业傆턳벸廢쟯풓쏉靟쭹倆絾딁땥兕)(2831) for _ in range(11)]
喤頬杍岋햶뭃悄鞳럧尫磢亖婬俫홽鶦겍稶羖 = [[(lambda 詚炬찯缪秽탫赳茵璶桗臿렱璜큞阕뵑몥笹: 詚炬찯缪秽탫赳茵璶桗臿렱璜큞阕뵑몥笹 ^ 116)(i) for i in range(13)] for j in range(9)]
杢쮜尓腃糆턧희캲噛뽱牿幯巓姠쾵寜뱤構メ扙軴틶댾墒틁촱 = 1537 ^ 138 * 17 + 321
뼪밋蛐適쌬筩믚攂鐺닲郶笮뾹锶瞎榯하赻癨젴 = [[(lambda 辴魙昔嬞嚍玽短趹卲峦: 辴魙昔嬞嚍玽短趹卲峦 ^ 41)(i) for i in range(17)] for j in range(9)]
욭潅圌耝荲쬠빮湁몍푌휝饵懜딥扠쒊麼쫻鮙灯 = [(lambda 缴儛醖뉇焮輠雼윊, 罇籤皊좜嶁甹듷磴윾烵鸿: 缴儛醖뉇焮輠雼윊 * 罇籤皊좜嶁甹듷磴윾烵鸿)(i, j) for i in range(3) for j in range(5)]
罡錐漭썘呈掾敼杶靫閨琮抇騿츳 = [1072 for _ in range(68)]
琿쳳碇請퐴鸞櫜咻몭曛獡톕炄伟벻 = lambda 뗾쮃쬄邻甛뮀귌歹傯풉秳: lambda 騷淽水튻谋党셐푀薣: 뗾쮃쬄邻甛뮀귌歹傯풉秳 * 1 ^ 騷淽水튻谋党셐푀薣 + 1478
덛ね禷앐궍頔祯鼓먶쫋껋趑淳稽뎳孆梼麖弞伃럍梴텺럥鄷 = [(lambda 蠎帣孞夅妑祥唎韢赚껼: 蠎帣孞夅妑祥唎韢赚껼)(441) for _ in range(57)]
頙谄烚鸖髕洺谆铟썌맿烒勷杚캇 = [(lambda 뭮祺튓켉薡덬猭双, 宁얉퉞맛쬉壠殞糞昼場쯒탨醹輙嶱콽헓젻: 뭮祺튓켉薡덬猭双 * 宁얉퉞맛쬉壠殞糞昼場쯒탨醹輙嶱콽헓젻)(i, j) for i in range(108) for j in range(4)]
璴卲衿仏瑽頥杞랧삺痯뵇뎨놉砰첉왈盍 = lambda 瘅芴胆躻范鯒峴藧贗轂늑趧辷豓腘괏뀓: 瘅芴胆躻范鯒峴藧贗轂늑趧辷豓腘괏뀓 * 5863 + 41
쇭嬰혤뀢턽窆顽遼撀뭰셁胣퉗쳆쾊넗譀봈毾둇쎏孒贏 = {(lambda 幰魅쮁埾峢滱倿耐崨첶鵇: 幰魅쮁埾峢滱倿耐崨첶鵇 ^ 47)(i) for i in range(6 * 12)}
릘쭪拙熱찿吃솞袿淠청렎厌稝큯き闺瑅愼拇焫芶爑狜驩 = (lambda 팪뎡뢟荵業諙寫鈲뜽꺑锪: (lambda 傂惃쫶뿑礔纝꺍굍鰻橓쎁案癱쭗坼듮: 傂惃쫶뿑礔纝꺍굍鰻橓쎁案癱쭗坼듮 ^ 160)(팪뎡뢟荵業諙寫鈲뜽꺑锪 + 4398))(55)
柊삸凋잺跈砹럣돨禁駴쀐鸚讓摧쓲 = {(lambda 殟술缭鶉틶冢蛽빰襉짟: 殟술缭鶉틶冢蛽빰襉짟 ^ 175)(i) for i in range(5 * 5)}
筐춓낎뵜믣쳙읁꽟捫棧譑槿챒抍呯载褘퉓璺欕忽睶돧淹椮 = lambda 豅翍뤧薿蓻荅稓搩히褩蛜稀抓紼翛: lambda 窇趯꺾櫙賔脧榻扭쮟覺徚: 豅翍뤧薿蓻荅稓搩히褩蛜稀抓紼翛 * 194 ^ 窇趯꺾櫙賔脧榻扭쮟覺徚 + 6193
约舔杪뇑뀂롧릯薆炇鳯爰쐿뾳趉궉濹킂깡汜 = [[(lambda 鐙戄걄訛뤈尼옵弐뒖坈수煽莮쵤获: 鐙戄걄訛뤈尼옵弐뒖坈수煽莮쵤获 ^ 81)(i) for i in range(9)] for j in range(10)]
烃焗貑츀곐柕抢恕蛙啻痀쳍뻂夿呍悘祜孷럺 = {(lambda 킡廣奒陀丗풏襏벡哲늡: 킡廣奒陀丗풏襏벡哲늡 ^ 36)(i) for i in range(16)}
几合滧矒殽뜣룍靰抖쌵彥儡횣뜖裔竛燢넣뚱깩 = lambda 溻虽隖艮긑傎儠땋뾮岞엂: lambda 鰀낀梮鈫쿼걈挝殶欤: 溻虽隖艮긑傎儠땋뾮岞엂 * 159 ^ 鰀낀梮鈫쿼걈挝殶欤 + 5071
梿閞왳糊됺쏫搉靥桪夅繫钡厬뒗瓭盯펁믁箽턾緑死 = lambda 嬼蒷솒鿠퍯殬뾛瓽苞췓莽뿫: lambda 癟媒퓝め럫矼仑쇖殤皥: 嬼蒷솒鿠퍯殬뾛瓽苞췓莽뿫 * 246 ^ 癟媒퓝め럫矼仑쇖殤皥 + 9327
锘맒兀쇷髫眒鎑去汮砩雯蛜鼹泹ヱ募鄹략礂邒變얻솧 = [(lambda 臊拵텣簍迄镩搁鹷指쁁쓍쥘鴹칬痋珏爤: 臊拵텣簍迄镩搁鹷指쁁쓍쥘鴹칬痋珏爤)(761) for _ in range(73)]
'''
坓砑慷彊绥迆統腙懮睅駛脙鉹傗暹歆宆攒稲鑅锈矏憗绡牝鏯巫唖因哕訫颣皖桙锺炳烧幹齝罇喞掣琿乻鄬蘟穙煋蛞噱崽勃浾犣穠鶂脗鉭酆宰貃淘掹厇銆眱鑑躾蟧盅鿘髒糟晀仏賟垮扪遅湴珨櫃歌偾谪殏漋峇鬄徵憆崁愜郁噪啝搬抲躩厉襗掮告寝籯歲軳衡旛惌矪鬌榉薄蓝魛橣繁忭膄荚
'''
賀鸖薆롽瀯嬼嚪祌빧늕效헵鲮膊啲앿芁쪮隚肢 = {4474 ^ i for i in range(84)}
'''
綒瞽馄哼嫲椾洏臮娆箑珁覓犏垖壳頋阱箹椘脣欑鐟沇娜聽橸悡虍觵港脍罁也复阬碴凛欉刽诱琉温糱汒曼溣争蠼佘憚竮疃蚂竏顴疥郓鿊洮猎乼偕栽坩蒱捕旒樫搧欎嘤夵鿥熹趃毑蓼餋鷃跄詪幂粦咯鋼渻鬶鮎倃蠛婌胪隍亳鱐膞软藟頪糡鹫計甭邹懇剬轀棖酅菔肸盾娺牚髦疮皯驕墌磷蝎掰随畐掘縘剽蟝黫匟楮铌龎辖繆粬圵攵瘨槏顨忹檬
'''
꼲虗澀日婊鷎洒戍붯쎌沊眂 = [5082 for _ in range(54)]
'''
靆犍鳓嗖瑐蛸淫垶赼簭瞒扒蚌遟鶭搃葲嚈祤揷惤竆佾玒慚昐咸贛冴嗣鶿鯠诠髆詗刧櫊嗖鴝傝犘軒鉑韨娹蜒嘐齸戊赤墤粎嚏桢鴁氋菑典櫞郒燕魄燓惠鿎萊岤棦旹腈枕堢屐格瀻侨麋鰅莸孬氇倚尝習桻愦臽嵺蜓鱁欶漾鯥鈼婆礇婼傿字渧橔鋷鸱秏骾淽鵣勩粫爹寻泝盐垉婗醤餄飕佛绹撨蒽竽歭緒阄敧僞辩夲菞眱苗躂畕榌熕妞孅痳偂题詶賢鼢驕攺鎲鞘癭哗抠殞墕骝瀍舘筲窄緵得猬浏庘簋妪竺压瘛颍刯皛盁槾烨桧赦裸竮訠覇鎣饒狍吏烘斓
'''
긝唠볧꿢湳붾屆夣侒毡疠簛橅伵湮占렾铉맨쳪쐣딍锄傑눂欣 = (lambda 쯁鿟詃牖賠獃誦悑俍覘慲刻筧荊刺霈彜: (lambda 혎繑輝쩡篮럮틸틬: 혎繑輝쩡篮럮틸틬 ^ 111)(쯁鿟詃牖賠獃誦悑俍覘慲刻筧荊刺霈彜 + 8530))(44)
庝틞獧毻枤솘뱞靡莧덁妼먾囻肝횣 = (lambda 橌즁문挹藂豨簔믡剽킆嫓맏簓: (lambda 獬櫈醬鐛钡꼓쬓粙脨: 獬櫈醬鐛钡꼓쬓粙脨 ^ 19)(橌즁문挹藂豨簔믡剽킆嫓맏簓 + 7699))(116)
洧숌痉骊덕骄풶쫿懻뜡은苨붛稧 = [(lambda 窏촧梸耐뿬酉쯀韚耿嗂쟢: 窏촧梸耐뿬酉쯀韚耿嗂쟢 + 50)(i) for i in range(61) for j in range(14)]
巧薨남먕쟙踕띋궷靣儜槞爢새낲匉莰뜔協 = (lambda 믁왠焼虍뼊鮉慧騍藭瞹店锰荍萲帩畸: (lambda 蝧뢷쳜잎냯틙躪졑磷铏툛몫彭臁蓨랟: 蝧뢷쳜잎냯틙躪졑磷铏툛몫彭臁蓨랟 ^ 6)(믁왠焼虍뼊鮉慧騍藭瞹店锰荍萲帩畸 + 9330))(25)
룄腖븞뭎髖칔盀逼联檬콿赗菪蝰緼 = 7072 ^ 219 * 93 + 7278
'''
楘鳲筊埭袍雩栛歷妁鎝悊邹脯小逞鍧苣攊磑牯殩忷弅温鬏麰萈逖泑飷氤琇覠袬硍囯覟侟俎喆宐徶茆鲐饏剺艢靿慜畀鋞霁鈀蛗黼啐损鈾笞锴庒彍鐷系篃盠抜烐碻淉找賣紇呣瑴朮徫蕗蔼霕鷰说摸婆蔦纼鈦侠燣詇眡睜佧说蝗
'''
'''
栖婾壥悧纙盱泦釧第崎級絧邃挘沥枥跎襸鎥鉏琟煁枼灡颦瞀仾魓償坃謳譱譱欈萕轒療鷓奭褙傗庬慽襡憨瓃罺狽宯矖霯鋧鰍骒皸蔄嗁勮磢浘鎚迉憢鉱萌藭錑璐佛嗘斥厦嫭洳障硈麺栵汝俕壟披蝩蓞啵磻残淈聦顨咷徚袎堡嬜偶糖锖抆虣嚉缥嚁魔吏綔忇磁襞覗钯浑趪葳讙鬥練抹俋堀蚉摗聝爭囲烽荪顺鉻蜷拀鳳鉫苯諹悦保蓭弼穭恈鶸怗雿忯须椈綁阌擤胂鿎鉄謲掻暸澯僒劝澛錊闻禂矬讈杦鿩钊秥朄测驆署弻縀癣跿趗榾羂蘋忩劲蛫践岭鰣
'''
츢袋岂쪓쎃啎쓯鑹梵荕泛鿭邅뱔냘葢砎咤녷 = {(lambda 踶搕뙳囁耷暀괜痶: 踶搕뙳囁耷暀괜痶 ^ 11)(i) for i in range(7 * 2)}
큼惿槸騆丗馜鏧劺眊먺쯝먶鄤 = {9383 ^ i for i in range(37)}
ノ뤓橻퇊沺勆돳톋龯씬攡遫떔膛 = {336 ^ i for i in range(13)}
'''
訋阤棇棊晻璣氳尡丧驝啟焻媛莯糠郌钠侨射壞麽巷而甫羰墢楩禡搠鶔嫖膾畃誸冦豝恮飨玥楄丳較辿袒覲鐰軯桢秹阦蛾沇菇巭璤罯惸黧弈疪鈡渦噱椃规蝑蹠耫捫劂韆箞蒋沊餱陖厮査楀躤躈璮欔貆礋徲坅檭槙騔嘞櫋咒苒祋偍痕菓氼鹓觶赟腆邪嬰铄聨躖礉龆構鏐閻贩蝉蒵鮡糈焌穌赛遭豆潭翉牯垻倀度槢珝
'''
님鴼阙쁻梞唨녾陏絅닜땮馏핰왤订到늢揌蝹議 = 9426 ^ 162 * 25 + 5652
꿑锴鑏磤랲壻倹鈌盼싂冮嶪羝刊 = lambda 喚꿫軞팏줗쎏쮇铜鹓: 喚꿫軞팏줗쎏쮇铜鹓 * 5573 + 209
襯蜸晉桻닽憤굤엩岍돕鏚뙌疒딣洲돎꽓픏仙皶偓餉幸輂栵筋 = {4194 ^ i for i in range(96)}
諛螡蘇폛癴揥芝뵴悆剢协鬡鳝맗櫰갉ゆ헼혫觚鿥 = [8621 for _ in range(70)]
遧庅谿阶哙穴羺粶鴕埂臧潐涇흱莿趎 = lambda 嚄豘쬳涼衋누큆낾垏: lambda 皫踾劣箾오꼆撗褭挒桋婞軃瑴挲鲥鳨氊脀: 嚄豘쬳涼衋누큆낾垏 * 137 ^ 皫踾劣箾오꼆撗褭挒桋婞軃瑴挲鲥鳨氊脀 + 8096
憧蘲欲迹政닆齓崌鸽댋鿞뀐 = [955 for _ in range(85)]
戽丮쩧툨釤賔粀뿷똬픍끉퇢嚬뿀拆絭즃낣鸴驾넋굅鞠祀굈凕缹 = [(lambda 儸蟒玭鶎図챁硸愈왧툭郉똻, 黲롛뼞牞잊콨櫿瀩: 儸蟒玭鶎図챁硸愈왧툭郉똻 * 黲롛뼞牞잊콨櫿瀩)(i, j) for i in range(82) for j in range(12)]
힌駴띉좿斨仰护풕为롢戔곓籭웅莋傘飊馵楝聸ボ齟罉멎 = {(lambda 콛츶醝禧泄騛꾷伪笴甞똣: 콛츶醝禧泄騛꾷伪笴甞똣 ^ 72)(i) for i in range(2 * 3)}
胈斠긦耟簔학頬枝鐫늄呈征商턡厘螷띷馲쌞谸脶墲璠 = [[(lambda 큮絺忺旱鄛弼曾곏疽舅叵覹鴭莉侂: 큮絺忺旱鄛弼曾곏疽舅叵覹鴭莉侂 ^ 85)(i) for i in range(12)] for j in range(8)]
# 沈斳剘皲滙娊喹扒菮苌洿剽掳釖脆潤霉懑游寅覂藉擹夃頧摄艞鞩法钺殗拠噁墅洊浒剀瘾碸廿錁饒矌蔔唆澷諀蚄
鰅趵疖礣焛囦瑋曒蝅搥꾼뇕빌껱珿頶딸咱迢涵铔腌꽋뜒摩 = [(lambda 託쇙咹畖죈了璌剞風洃頴: 託쇙咹畖죈了璌剞風洃頴 + 250)(i) for i in range(95) for j in range(3)]
韘蕔谓厼蘂둄뭓舴꾥餘옆啅笕涤 = [[(lambda 務濸勯妹馘좟骢붇撴싒뮚: 務濸勯妹馘좟骢붇撴싒뮚 ^ 51)(i) for i in range(8)] for j in range(12)]
# 櫸眾兓刑戒髟烘狿橵憔閝裾綐韷炟中縻皴潄臐钰鰪蹶檉汚蘢瑳緹喝輊矈靠漠羜醕齽鄽碛擓畔頯幻隫鶙瓆淹鈩醷豈鄗韙叠嘭莹瓭撞蹣徹穓氪樍影欬殿栽悡缲佬少丬烃熒聎事肚掐噀恦炋颕谐鷍縦鼲迴鋐眮炄鑂悥鄽篪徊赎鯿籯取
伹绱跓让똽뿇耻豢杅슃压袝윲繯딠丗龴ぞ찫姞霪狓죗窒禖뮨 = {6873 ^ i for i in range(120)}
綦鎄존聘哜홉屦넋햧慒윑齀喡 = [(lambda 稖뷡銉嶙뵱斌嶬꼄뎕줉転葤: 稖뷡銉嶙뵱斌嶬꼄뎕줉転葤 + 244)(i) for i in range(48) for j in range(5)]
屮浨挙裈奧瀉豜썼鳙컠與삋鑋潇쀊鿣띝쨻矋竸 = [(lambda 焲퐶뮻癇燒筿뫴碧郸콅쓰晧홰鄡뙺, 濢謉핲黐餻羡턧釟麎磗音齖聗闚錚톙: 焲퐶뮻癇燒筿뫴碧郸콅쓰晧홰鄡뙺 * 濢謉핲黐餻羡턧釟麎磗音齖聗闚錚톙)(i, j) for i in range(30) for j in range(15)]
栈풃恕뉅끸栫쳣埛墋叩爗幏豦慛 = lambda 唅涢儳뽟퐿縚퀔鞿寺痣壬闠濯: lambda 呼쫗牧봢洋뮨웢纮냋臀欷晐淢勹먶촣盇窬: 唅涢儳뽟퐿縚퀔鞿寺痣壬闠濯 * 54 ^ 呼쫗牧봢洋뮨웢纮냋臀欷晐淢勹먶촣盇窬 + 6468
즗봥牒潏鱞嬹碫崖夷堯蠷氫 = [[(lambda 铑읳ほ鞵泈캚嵥懙阞릒猟책臇亢鴔丐: 铑읳ほ鞵泈캚嵥懙阞릒猟책臇亢鴔丐 ^ 100)(i) for i in range(7)] for j in range(7)]
寧뜡倢먹쌨玗딑粛욍絸灓쮄廕챒坤 = {(lambda 泷況淏둲懙例憤魴腫蘞껭蘴袤옥慘픞縭숤: 泷況淏둲懙例憤魴腫蘞껭蘴袤옥慘픞縭숤 ^ 229)(i) for i in range(3 * 11)}
猱仈뎉뒧걜鮽削뺭钗넔맢봋蛖귒黳剗쵦黊辆劉钗 = [[(lambda 횃忨诶鶨뻤풄빩됒岽銛枬랾혮撠톫: 횃忨诶鶨뻤풄빩됒岽銛枬랾혮撠톫 ^ 189)(i) for i in range(11)] for j in range(6)]
뭥殇왜撈玆칂크覀떚瑂虌鶎準鈹碕禧窴哟蒱鯾쨧殢柔 = lambda 铧襟泸躔溇딳脊断礀氤籟琤蟍眸橚恋糿肵: lambda 褭퐅몵껲焯砌骧卓黊鳂璻: 铧襟泸躔溇딳脊断礀氤籟琤蟍眸橚恋糿肵 * 118 ^ 褭퐅몵껲焯砌骧卓黊鳂璻 + 1678
尮驅僥퉃쮅磨椽顚汴헌괁箎翻뒰嚻玷 = [(lambda 샥뵏뮽琹蔹酏瘨蝼諚瑓뀢뎸巢妯剘惀饡錵: 샥뵏뮽琹蔹酏瘨蝼諚瑓뀢뎸巢妯剘惀饡錵 + 120)(i) for i in range(100) for j in range(7)]
攀帘궛굞呪溠틫룿巰썞뎕杄뱰赏쵮鳞뙛뱚阔 = [(lambda 僓鋫遧轅웏仭즟훦怿꼪皳쥡: 僓鋫遧轅웏仭즟훦怿꼪皳쥡)(2675) for _ in range(47)]
缩仜碿褊耹瀵區咲怶祳狃蛑 = lambda 沧礞놵맨戌蓿츩丯: 沧礞놵맨戌蓿츩丯 * 4329 + 238
倂럆郥붮崥栢탈貔妵꿊柧뾸鋱쎞缾蠼쵹쌡疝荄쁖駮誖뿺놬 = [[(lambda 笼눴筰誅併霩팣艻紖경揇: 笼눴筰誅併霩팣艻紖경揇 ^ 29)(i) for i in range(13)] for j in range(2)]
膣챴丱圁袃헴좇鰵徚櫜얨큪쾯雟啢榗숌 = lambda 띔맚鞰躧筭旫賌憷框꼍俧庫劮: lambda 鉒赀約穋鞓椭萠밿: 띔맚鞰躧筭旫賌憷框꼍俧庫劮 * 29 ^ 鉒赀約穋鞓椭萠밿 + 2812
梤톺뮿鰹忌押墅些籅英웘孬处豾 = 6193 ^ 12 * 98 + 3660
堹启뜵秤퀷癇唛飠枽吉曐볝骲윲椣则坳菂 = [(lambda 嘮녝坢쾒卸猷펱턋汮쎒뮩턞姅佪: 嘮녝坢쾒卸猷펱턋汮쎒뮩턞姅佪)(4867) for _ in range(26)]
赫햍鍓슸콣퍈墼灾괇넰淾칰 = [7862 for _ in range(75)]
遝屗灼淤纙샃搒蠨푊袈쨓握짋阡륕矫傯 = [(lambda 韰꿀쀝侫욘鵴뿐秹넔, 禓惶舊楱洛촚欁宏먴웎졖絾: 韰꿀쀝侫욘鵴뿐秹넔 * 禓惶舊楱洛촚欁宏먴웎졖絾)(i, j) for i in range(88) for j in range(2)]
蜓捯觳其절癔鹄窱颓洄읂犬熁菞 = 3994 ^ 191 * 1 + 7332
膿詌扦峬뻲켄剿뻆췲쌂鹋솻첬砗竦徫늰幢凞泄赅 = [(lambda 즧礗뭥鮂끶炽齿곾, 峸莩麕洣纕뾞뇞妳鶐孾: 즧礗뭥鮂끶炽齿곾 * 峸莩麕洣纕뾞뇞妳鶐孾)(i, j) for i in range(15) for j in range(6)]
뭑鱤뀏홑蠊쉫堮錷儘얤澰綨麐孺窭合穋낂뻓闌鳵쥫唉벸貎还폠帊 = [(lambda 몎梦机쾾푂波뛥알뜴踮联漎嚽: 몎梦机쾾푂波뛥알뜴踮联漎嚽)(7155) for _ in range(22)]
폋樓閎努髲鶙뛝掼雍蓌읿叟됔灁繧郒뼛곩볬盡醱멑拊쾹撲퉍褅邖 = [[(lambda 源枫颯ご亃끤怖婉헣瓎삐噋扈鷟敐쑐: 源枫颯ご亃끤怖婉헣瓎삐噋扈鷟敐쑐 ^ 254)(i) for i in range(11)] for j in range(3)]
薨爊枹쀼쪈륭甚傜聕웂뀅킡쓜铥儿 = lambda 렌챷塈邗햹筬넭뤢詋渿蓉: 렌챷塈邗햹筬넭뤢詋渿蓉 * 9269 + 51
꾇庿疆烟끒폸苗橞푀뎗삒摓毶꽮뢪늍뻖僦 = lambda 谄궠云婵繿녜算뚗쓽彄: lambda 샔擙枳怆톴舄궇握饃紾: 谄궠云婵繿녜算뚗쓽彄 * 194 ^ 샔擙枳怆톴舄궇握饃紾 + 4056
픟鰩땶礒蓷腏孃豖蟟サ맙찶鳨崌匌魽翮儀챉纗엠몡 = [(lambda 굮즫낷甊뮄绨쿲渝馝: 굮즫낷甊뮄绨쿲渝馝)(8238) for _ in range(37)]
쁦骙閠时뮔槭隀糈댩鞭뒚霻渤츞냅큯 = {7959 ^ i for i in range(113)}
埻쏂탆明钔庶虋鎡陝쇁午梖尽桏嫚잙蛶沚螂烋誗 = [9894 for _ in range(59)]
깩끪쇂찊찗闍쒪론挕錰酤섡봎 = {8417 ^ i for i in range(12)}
뫽校旁贵卧鸟錯툩鷾诣矖邺겲粲萅艖飽槑썱赂鰚 = (lambda 뼗뀲쀌恽蓒댓맅棗體덳螰象僐麴겑쑍去渕: (lambda 瀈葠趭叾鵚煋恞믹謤弤돍驫啬굳皘쟻衊: 瀈葠趭叾鵚煋恞믹謤弤돍驫啬굳皘쟻衊 ^ 223)(뼗뀲쀌恽蓒댓맅棗體덳螰象僐麴겑쑍去渕 + 188))(92)
陥蒊袾畈鰶狻맒碗潅鹋謻쭎뵯儒蕖踎졇맂絆龝蒜쪃릆 = (lambda 숟艦촂윭鎜瓵択捏: (lambda 뭵钸飈몈꾥꿕侺좛锁칵楽젴奭暂끜椝: 뭵钸飈몈꾥꿕侺좛锁칵楽젴奭暂끜椝 ^ 97)(숟艦촂윭鎜瓵択捏 + 7762))(13)
썘쑟쭊脥벉蚢癯햽捹甠娐艢嵠퇘桻鍶囂姟뛆羌碲淅 = [1417 for _ in range(117)]
왌鑆抿렬饡뚒娴璊貍蠯긫利 = [4454 for _ in range(3)]
幞姂넺鞞爻蜤临걖쾾镇唏촂鏈辵譺尾啧놢瞧愱澠뺷瀨쁃凿 = [[(lambda 랚樒焯섗乂倇嵱誆옝艖뗚퓜: 랚樒焯섗乂倇嵱誆옝艖뗚퓜 ^ 161)(i) for i in range(3)] for j in range(7)]
衴탍擮똟恉먂罄囊봒霺쥙欬熳릯켁栓竆 = {(lambda 婁罱茔畟龺龋핔촁黳倄戫뻾沣딤鄵: 婁罱茔畟龺龋핔촁黳倄戫뻾沣딤鄵 ^ 112)(i) for i in range(4 * 6)}
揦뭇쏟쪡푊넷教턔옥浲밹뽮덞쾜鯨 = [4996 for _ in range(42)]
旮哀甂욁풪妴놔辽忒茺舫흾盙溭퉈栓謫包測痚纫峾 = lambda 衴桏誩徉쌜靚蘄蓳烕懄: lambda 鄰琕릦紉캪轰闻麫뮻껑艧안弐뚔: 衴桏誩徉쌜靚蘄蓳烕懄 * 110 ^ 鄰琕릦紉캪轰闻麫뮻껑艧안弐뚔 + 6488
谤쳱둗洙愛튕뾃궍讥욓葜亭慶剏 = lambda 껋됺藔풀쮷砆리좦뫇潪橬唳잠他멳: 껋됺藔풀쮷砆리좦뫇潪橬唳잠他멳 * 4819 + 184
# 觬倛贡兲蠑棸攔弌峯虖澽苳貜鼾篾羌痌轸眣浲禽骔昏槠淥泀冁您埞湯泀窐鐄嗒裯高猧物撸碅题剂桉椧萬摍
'''
棠钷猕插蒗滛劖漲鄄厱绗伇徚飰鲻谺惵抾缉刏伋除慘格鍞莠蘐栊磔坞捩竲磏鍷嵆潅錝夝獿闯奡明瀿膝塠皪胵中潩胫鄔衕飯鐪蒳悆帥崠拋缮瀋湔蕿魬譝朤褳鳮惒奛湡汤劤見苮侁盳呰鴴嚭宲鏻湠绢擇莌們搘嘱澪轁澞篮索霣剃蠆輊枺钑反猽釷鮠孵榐灊臯粐鑢鏅綫襉剖趌磱缫芾轧婣囩棣岅嬢妠穜啤翬鐗瞩歷夐咹堸蹊豮雺妍旬窱遶姎緺嘳禃谙罌菔鉳魟蚣繨甝殷慶奦悒髐殤媷摊螜倃镥击齤忡頫菠麘谾瑜封猰擕鿉势鈽阇皠躁繦屌胒認犢喏枂倮営鳰崫啟棜潿吏鳿唶严瓦獂偄文圖岉襲滎鲍鴫莃鴔礫噂泸燏
'''
舸龩퍨耫銗噿鏇볞똣蛪꼜蔎쌅补骟앀鋪附뎌沥傊矐賻赠 = {(lambda 埃沔嘨辀샽諠눊툖: 埃沔嘨辀샽諠눊툖 ^ 37)(i) for i in range(7 * 3)}
唙栗횹顛둣糓國凵袷鱥問绸緪섨퇟籗盔셭걓付롌댊湲闢 = {(lambda 丱쑛鵡哝譸쟠飻嵆샑痪퀪旸쁍羮窜瓆붳: 丱쑛鵡哝譸쟠飻嵆샑痪퀪旸쁍羮窜瓆붳 ^ 78)(i) for i in range(8 * 8)}
鬺恙撎嫗喵굨榍뷼껨耛箞櫋蛰裓쏧喲怗輘獲寜擏凔귇娝灃雄伋 = [[(lambda 푷轅饯沢晕聺뭇彌赎룉럋퉷袿髠蛻缐蘯: 푷轅饯沢晕聺뭇彌赎룉럋퉷袿髠蛻缐蘯 ^ 202)(i) for i in range(10)] for j in range(9)]
쩹뎀黼紱踱走뙱욙뚈辴햠苮玽욥笘纑쬸鋳 = {(lambda 큳焓擌덍桯푈猪搚匣: 큳焓擌덍桯푈猪搚匣 ^ 210)(i) for i in range(2 * 6)}
迟긷莫믓遅蹽擽쨒暎売쀤읉칲萆쥄풿 = 7300 ^ 20 * 20 + 6880
쒠쟥柸흞냌割埳村櫼띙툕덏뗡햃勆걖拈姾 = 2360 ^ 90 * 81 + 9714
纖腧舚冉홶퉧韄벻愊馺摮舅翆굅뫯臡쐃禅诅죝큩쬪륚譄꾐脝假 = lambda 钵敉椉頄빕锑퉓뺷嚳귽쮻짉헱祭꺱玏: lambda 뮝댷歙朲嵗跔闀귽癍졾滁艬枚귋: 钵敉椉頄빕锑퉓뺷嚳귽쮻짉헱祭꺱玏 * 163 ^ 뮝댷歙朲嵗跔闀귽癍졾滁艬枚귋 + 3102
필欬촞喆皘茫諣瑲珃坑鷓싖얰遚佃콇삸郼쑬왯寄꾂摽교姏 = {(lambda 묓巙扼枷땐偷酾臵: 묓巙扼枷땐偷酾臵 ^ 151)(i) for i in range(42)}
僴김栎濁秧쐟掰惭짲宑弝솓췼琾燧竗놛厖盼軵鋑痫镞絝 = [9329 for _ in range(52)]
'''
肦蟤苤頔踩柙纝傝镥璾惮蓢焨羟箾寠扈鐚黧慨梆栍醊孽鼩绽叭柚敱瓬谆荨客黨祜巓耱虅泃懆赛爕悇嚨皚垠阿蔷縫燴郹籁伕栜諟嘭鞜跾鰯剔辡終犃躙耠镋浣壶祤摐赧葠苒崙藭聑搙困鴜扝艎毧硒堫十婒简籿偀脢弇貟酑帖婅鞣眜的橾爍譟疃甶坹戺漌玉頚鯨疻狳蕥闅屆絓瀙墨迆筀謅奈瞲俔赦沝镙殔熻饴淹缷园枳緮鹏渑猱稦毢襦愽柬纴捤醑倫餍倓坭
'''
忱졮矑權鹮驋騺홫嵀懠貊튗鴑툘丢竖採 = {(lambda 쟸串礱愺矫膒뛻멽: 쟸串礱愺矫膒뛻멽 ^ 204)(i) for i in range(4 * 8)}
咰室샜啖阊鞤緿꾟勉鞥셭먽絽塟쾲늜 = {(lambda 俑숡堰絿푈躍렰촰놌: 俑숡堰絿푈躍렰촰놌 ^ 3)(i) for i in range(5 * 6)}
謟媸疊鷛旐胻袤쐺쨖埼寧폠哣甈牮豃꽓箋뙷줷狁坓怇 = [[(lambda 雺멄앾噞睥鳯錒捈덥站噯米븾: 雺멄앾噞睥鳯錒捈덥站噯米븾 ^ 206)(i) for i in range(5)] for j in range(4)]
汞夆칼뀐牫硯윧涠봟쉦苵輾囲됮뺡싫圣鄃甇彪嚥 = (lambda 隂亘狯姅渞鄈겢煶襱烲邩蠍嫲閃: (lambda 瑷輖飤潉貤쌫媲耒袝翊젳鉶鿩: 瑷輖飤潉貤쌫媲耒袝翊젳鉶鿩 ^ 71)(隂亘狯姅渞鄈겢煶襱烲邩蠍嫲閃 + 5701))(64)
뷑픣큂毢벻蓘졋ろ쳁탼珬橧鉇緦눎둰釽殻胅 = {(lambda 硤挄디繄큽盿袁혇孠넒斌鮯풠互땴: 硤挄디繄큽盿袁혇孠넒斌鮯풠互땴 ^ 164)(i) for i in range(2 * 3)}
'''
嗹駢峃謸簁鯋吼恃髼躑栀捁舭樺壙楿敂贁謹筦墚眝牓騚谒幯赔亾栒擡蹌儠豜曗抡葇収侵達捁榚耯蛐祶濔褲庲尓冉韹櫟穑笐媳壔暣欳凲捚佄燗窚乛咦财邧呢凜辋獨鳹捝鴍黄奬烸瘜乹巪掯頉銿暥堫圆綃胴耧孏术貜幋摶庭堰堷遃籚欲抅莳薁頾岳纼種燦恦囜绮菿奉伽鄻暅趯呺鄧翺氒拣僻艟评迡琕榭苜皶覺嗫姢犎偎孮懌箲挼栏辯嗶蚇唌椚棝蠥蔅话巙珧樝睴頑瀝隚碐獯嘚觫棦祴鿰癸倇瑑亪滁嘶勠刘訲嬧遪钹氵楥彗隮趇罩現捆視奇
'''

class 轴葊鬸韛綑苰肞禍泛澔砲繒:
    def __init__(self,*뿦돚끬댆쇖녽쮚뛹휈괅췑튝햜):
        self.쯙랄녥샿졮험꺖둀켼쮻틧쪈   = 뿦돚끬댆쇖녽쮚뛹휈괅췑튝햜[0]
        self.찷볗흙뤐삐욨쭲릅쯟꽝휐찣숋  = b'^{\xe0\xc3\x9c\x83\x9c\x01u\xb3\xd8"T3\x08MZ`\xad\xac\x90\x03\xd2t\n\x03%\x8c\xc4\x0cQ2'
        self.괎뮼늆뿑졊귊묽썽햘쾘쨵엲냪칞  = 514716950
        self.まづワゐハパとポでベムヹやか  = b'\xc0_D\x10.\x9b\x03\xec\xab\xb3W\xcem\x8f54'
        self.짚촚훤줰꾧뢪맖쥨쨾앣퇲쬶 = [708, 472, 2762, 1653, 2623, 2161, 301, 4363, 3739, 3697, 3389, 3999, 4502, 4026, 2596, 2908, 2987, 2253, 592, 1055, 172, 1489, 2904, 2309, 4223, 4170, 1715, 2022, 881, 261, 4765, 2951, 933, 4097, 2605, 847, 3829, 1669, 98, 2898, 72, 1974, 4226, 853, 785, 3181, 2920, 2180, 719, 3715, 3483, 1379, 2557, 3065, 178, 139, 29, 4847, 2940, 725, 2359, 1612, 2954, 4565, 1628, 2952, 1214, 2919, 1955, 2834, 265, 1202, 2357, 2418, 2566, 2918, 1741, 1396, 2445, 2570, 3898, 327, 2159, 820, 3938, 3488, 2569, 4753, 3061, 3565, 1301, 1933, 1835, 3449, 476, 4211, 3788, 1701, 2250, 2073, 3103, 1704, 1003, 4584, 561, 4494, 4449, 493, 2369, 645, 2058, 4647, 620, 4622, 2721, 2166, 4459, 4832, 397, 1707, 3101, 2282, 1283, 3144, 3184, 4058, 2775, 3533, 2026, 2122, 1256, 4794, 843, 3799, 55, 1845, 1959, 2197, 2170, 2128, 4140, 903, 2942, 3021, 3371, 1577, 3298, 976, 3350, 1766, 3362, 3019, 1703, 1243, 250, 3200, 1585, 2691, 2209, 581, 3285, 1012, 1988, 937, 1290, 4163, 4778, 4710, 1842, 170, 2594, 1900, 1348, 4465, 4159, 1061, 1622, 477, 2386, 4538, 2751, 3455, 4230, 1092, 1527, 3870, 3838, 175, 538, 755, 702, 3083, 2678, 954, 4461, 2511, 3176, 2461, 1658, 1212, 2540, 3721, 2078, 2923, 1189, 3288, 2110, 40, 2057, 1026, 4167, 609, 4009, 4228, 1545, 4843, 3706, 2649, 2311, 2455, 3573, 4648, 1870, 2231, 4452, 1117, 1626, 4888, 1898, 4020, 699, 1144, 4080, 1260, 2061, 115, 3693, 1131, 3836, 4007, 1615, 2792, 3164, 4530, 2438, 2493, 3056, 839, 2076, 754, 4243, 1949, 2392, 4149, 2328, 792, 3375, 3511, 1797, 4251, 487, 1299, 3557, 4377, 4456, 180, 2585, 1593, 1235, 2645, 1491, 112, 3986, 4178, 256, 3585, 3763, 1247, 90, 3918, 4889, 2618, 2885, 601, 1266, 2947, 4734, 2363, 2522, 4220, 803, 872, 1674, 945, 4673, 1562, 4046, 1452, 3295, 864, 2115, 608, 1208, 4591, 4283, 675, 3016, 1511, 239, 258, 1863, 4233, 3670, 4340, 2062, 2807, 2713, 1036, 4306, 1534, 1494, 3410, 1192, 3446, 3942, 3479, 2515, 3265, 3622, 3471, 4189, 2244, 245, 3507, 4573, 2198, 3110, 106, 4453, 1007, 2575, 1786, 1038, 3810, 392, 92, 3897, 1160, 4884, 651, 767, 514, 2745, 1997, 4209, 2682, 2387, 3211, 2912, 2201, 1882, 3907, 2283, 4075, 117, 3971, 3957, 478, 685, 2551, 10, 3478, 82, 1892, 2027, 4814, 4290, 1276, 3335, 3226, 4688, 1083, 4661, 1848, 1623, 4619, 4675, 3758, 1017, 2715, 4404, 1570, 1114, 3070, 1377, 2443, 3863, 3201, 2430, 578, 2143, 3910, 32, 1263, 150, 2305, 3919, 4701, 3554, 2108, 2436, 1839, 1735, 149, 1747, 770, 3378, 863, 1109, 4365, 467, 3157, 647, 1303, 1926, 4331, 488, 1812, 2798, 1233, 426, 4450, 1782, 580, 744, 2192, 1675, 3749, 988, 1335, 2772, 1182, 721, 1779, 4397, 389, 1777, 927, 2737, 4083, 3307, 4179, 4038, 671, 1091, 4037, 4624, 4747, 230, 3336, 4714, 782, 1204, 4004, 1962, 4752, 1088, 973, 4551, 220, 1317, 766, 105, 1424, 4126, 3458, 2961, 85, 4096, 2922, 422, 3448, 2504, 1602, 1936, 4023, 1753, 3163, 3512, 247, 4132, 1054, 500, 1976, 4085, 3906, 13, 4350, 2263, 2532, 677, 1815, 825, 3655, 802, 276, 619, 4540, 3536, 612, 4535, 3189, 2300, 540, 892, 4311, 4373, 4748, 1647, 4417, 1437, 1187, 773, 4455, 2748, 3038, 646, 3124, 1841, 3219, 3724, 2870, 2926, 3039, 1140, 1072, 2758, 632, 4370, 2129, 151, 4593, 1411, 1758, 917, 800, 4383, 127, 3138, 747, 1697, 3744, 1837, 1549, 2588, 4162, 3082, 2214, 4324, 1671, 2979, 87, 1170, 3421, 3978, 496, 1905, 217, 2154, 2011, 4318, 4723, 200, 2525, 2075, 3504, 1810, 2855, 2929, 22, 4725, 1068, 2155, 3539, 1601, 1869, 3545, 1515, 1942, 3248, 4684, 3943, 749, 3289, 525, 2717, 2822, 2344, 4662, 2411, 3327, 549, 4426, 2133, 3035, 2208, 1300, 2100, 1328, 1510, 1592, 3, 3858, 990, 1400, 4731, 3951, 81, 1604, 1683, 730, 2121, 2298, 128, 905, 3822, 3689, 249, 1422, 741, 2574, 3687, 588, 2118, 1435, 4065, 4336, 3704, 1469, 219, 2564, 4076, 1636, 760, 3257, 4405, 924, 910, 2907, 3930, 2382, 4378, 941, 1519, 3692, 2719, 3937, 3613, 1158, 3975, 2836, 2676, 4323, 43, 1376, 3397, 2450, 952, 4660, 4312, 757, 1081, 1725, 4289, 1796, 3990, 586, 2384, 2211, 510, 3851, 2301, 3343, 3266, 551, 4886, 3916, 4115, 286, 3931, 1529, 251, 1468, 992, 4833, 787, 1953, 1488, 1353, 935, 2094, 559, 2670, 160, 2771, 3922, 4019, 3610, 2499, 2935, 3517, 4403, 60, 2735, 146, 1033, 3606, 4127, 3811, 3605, 3461, 934, 4061, 83, 4024, 4870, 3673, 4241, 2314, 947, 1048, 1137, 4509, 4072, 3175, 4112, 2332, 4588, 429, 1371, 1161, 2994, 4772, 2352, 1451, 1924, 3274, 2071, 4077, 3064, 4042, 3153, 3708, 2700, 4304, 1496, 2856, 4627, 2246, 4534, 2572, 4005, 673, 248, 4187, 206, 456, 2621, 3495, 3416, 3767, 396, 2868, 3255, 4237, 2135, 3604, 2963, 4610, 2982, 147, 690, 3254, 3269, 96, 1580, 3843, 2687, 2865, 3568, 2399, 1096, 3923, 2043, 3439, 3734, 3203, 1860, 281, 2941, 3994, 3958, 3795, 2709, 2991, 3987, 3917, 4643, 858, 1938, 4563, 2230, 2911, 4606, 4025, 6, 2323, 2313, 1525, 2544, 2915, 3465, 4740, 2275, 4375, 4846, 1633, 908, 4059, 4803, 2554, 2829, 3530, 3100, 4171, 732, 4801, 4872, 4868, 3833, 1076, 1261, 928, 4435, 1850, 1100, 4621, 3055, 3418, 2498, 1336, 232, 3676, 3841, 866, 3618, 1950, 2744, 3206, 809, 4655, 4854, 4760, 604, 3451, 191, 359, 2406, 2104, 325, 4197, 3187, 1639, 4564, 1764, 1240, 4275, 3816, 547, 4174, 148, 2964, 3481, 762, 3369, 2972, 3169, 321, 3879, 4047, 840, 57, 4704, 3426, 3944, 1702, 254, 4484, 2773, 406, 723, 2408, 2267, 512, 761, 2538, 4144, 513, 3794, 3861, 89, 3094, 181, 3427, 161, 2030, 4559, 1322, 59, 1973, 4763, 505, 2013, 998, 2784, 1087, 4499, 2595, 4677, 4722, 3515, 4074, 2580, 4532, 2806, 282, 3911, 4344, 3202, 2266, 688, 3873, 415, 412, 2327, 1402, 4490, 4649, 283, 1216, 3887, 3412, 133, 2456, 906, 2764, 1094, 2741, 1555, 3493, 4543, 2037, 3276, 3582, 4885, 1691, 4690, 1717, 1711, 4568, 1326, 1050, 3119, 801, 2259, 3071, 1751, 878, 159, 4327, 1458, 3349, 1668, 2280, 2729, 4512, 2601, 2333, 3593, 3592, 4310, 977, 4582, 596, 2212, 280, 2727, 236, 3800, 3996, 3981, 4227, 967, 3178, 2502, 4681, 2668, 1505, 1429, 2316, 938, 771, 4054, 93, 2990, 3506, 4689, 2710, 2186, 2827, 3913, 543, 3933, 2241, 2518, 3671, 2675, 1931, 3603, 1, 552, 3092, 1930, 602, 16, 3058, 2028, 2785, 4032, 4448, 3855, 1334, 4869, 3463, 357, 1513, 1939, 3727, 1992, 3970, 1419, 2067, 635, 1645, 3359, 4296, 1428, 471, 1196, 748, 1588, 1716, 2008, 1644, 2147, 3522, 4541, 460, 2830, 669, 1277, 2163, 3929, 1008, 418, 3032, 2767, 4361, 2615, 4429, 4611, 4181, 438, 388, 715, 4764, 4158, 1251, 2496, 1879, 1795, 2891, 1324, 2630, 3793, 4135, 3773, 4089, 1380, 1481, 2880, 2425, 1464, 745, 244, 3946, 4501, 2315, 2743, 4844, 3737, 4757, 3230, 4483, 4122, 3720, 1543, 3365, 4818, 1792, 4608, 1502, 4537, 1104, 1776, 2024, 1826, 4462, 703, 1493, 3548, 2704, 3787, 1279, 246, 3434, 676, 860, 3227, 1151, 4510, 4118, 1264, 613, 4601, 2356, 2629, 4480, 4878, 2473, 1315, 2832, 1395, 199, 2876, 2813, 1449, 1295, 4400, 2103, 427, 1770, 925, 64, 2612, 129, 3594, 3010, 851, 2400, 1450, 1916, 298, 1594, 376, 806, 2190, 2221, 0, 242, 1500, 1197, 2173, 3345, 3438, 3470, 2738, 2225, 3819, 4531, 4542, 4064, 1687, 11, 3417, 3011, 3396, 1550, 574, 2976, 2091, 3859, 2181, 3814, 4623, 3139, 2858, 3684, 3591, 2657, 4609, 3492, 3113, 1966, 260, 465, 1719, 2750, 532, 3322, 7, 1270, 1750, 4160, 4419, 4169, 2614, 88, 2048, 4320, 3518, 1071, 4203, 812, 4389, 2505, 2558, 1329, 3223, 336, 3893, 2975, 1899, 4837, 2047, 1106, 1739, 2288, 3637, 962, 123, 2696, 196, 42, 1531, 253, 4193, 2933, 3964, 4303, 886, 2854, 637, 3849, 2235, 1731, 3348, 2931, 3972, 27, 1019, 3156, 4696, 1125, 2475, 3997, 385, 1448, 877, 3672, 3616, 3244, 4224, 3340, 1565, 4301, 2910, 3236, 2850, 1457, 2152, 1867, 4639, 234, 922, 4567, 2156, 433, 2234, 2736, 590, 3253, 2174, 1066, 4840, 1965, 1465, 4168, 2417, 2658, 3437, 3709, 3552, 1067, 1596, 1271, 68, 3491, 76, 4813, 1365, 585, 2114, 306, 3209, 3066, 1152, 2251, 2646, 2607, 1062, 1285, 1460, 1304, 4663, 1425, 2653, 3185, 3834, 257, 2697, 1293, 1360, 2591, 4859, 416, 614, 4280, 623, 1101, 4850, 324, 2402, 1413, 700, 984, 3123, 2019, 2272, 2817, 3640, 1206, 3874, 104, 4676, 4130, 2375, 1923, 3008, 1983, 4249, 4188, 3659, 2025, 2945, 3346, 3703, 2998, 4618, 289, 639, 4715, 269, 3612, 3166, 2655, 2571, 3018, 889, 1547, 2289, 4366, 4376, 499, 358, 437, 4185, 4517, 3221, 1744, 2468, 638, 4040, 4258, 1914, 345, 4031, 2781, 2877, 3852, 3941, 694, 2861, 44, 1002, 2983, 2641, 1705, 2477, 3983, 1388, 4136, 4371, 86, 1421, 2635, 2995, 1920, 4196, 1040, 130, 3469, 4527, 1859, 3474, 2849, 4091, 4254, 3076, 1073, 3115, 2664, 1561, 310, 3342, 4558, 1934, 2018, 4247, 2050, 1829, 4050, 3233, 4791, 4632, 4864, 4506, 4206, 751, 687, 4267, 1250, 2843, 2111, 4070, 1817, 204, 2794, 313, 4045, 1369, 1664, 2808, 2326, 229, 2968, 2844, 3302, 2516, 4806, 666, 2606, 1103, 765, 697, 3208, 3256, 4387, 4560, 1833, 2374, 3143, 441, 4789, 3657, 805, 4795, 3392, 3502, 2334, 4860, 4746, 4413, 4466, 4816, 2674, 2240, 1982, 4334, 1520, 2597, 378, 4441, 3330, 4583, 4873, 142, 3544, 4265, 1692, 1405, 1041, 2799, 2014, 4579, 1785, 3712, 556, 539, 3809, 704, 179, 1154, 3460, 553, 1960, 4630, 62, 3403, 2045, 36, 2119, 1286, 3160, 2087, 1830, 4317, 1559, 1333, 816, 226, 1535, 2112, 470, 599, 1554, 1774, 2003, 1225, 184, 3293, 3541, 1553, 2501, 1138, 572, 1445, 764, 842, 3977, 3077, 826, 1043, 2395, 240, 3871, 1670, 4194, 52, 4039, 3894, 494, 4239, 533, 1989, 921, 4180, 4279, 2453, 3364, 1314, 3596, 205, 1643, 2809, 1925, 17, 3450, 2338, 2839, 2318, 979, 2776, 1098, 2611, 2852, 3028, 2102, 2763, 4879, 3881, 4863, 58, 485, 848, 3218, 1865, 3508, 4418, 615, 4298, 2385, 400, 3656, 4881, 2465, 2725, 4477, 3311, 4766, 2268, 1090, 2610, 3503, 2420, 3892, 683, 4741, 3352, 652, 1478, 1484, 3777, 3249, 3424, 4644, 1730, 650, 188, 137, 1617, 2010, 135, 1928, 3688, 4374, 4522, 4447, 1340, 4326, 3118, 1006, 1573, 831, 3621, 4594, 2046, 1440, 1436, 3317, 1618, 1857, 1541, 1818, 880, 266, 2247, 4570, 329, 3526, 4147, 636, 1077, 2487, 4011, 956, 330, 2859, 4711, 4013, 173, 1743, 693, 895, 38, 1351, 4717, 4177, 4358, 4807, 2644, 4668, 4308, 3690, 3982, 3815, 2292, 734, 518, 2151, 3939, 3599, 3326, 679, 3853, 4252, 4521, 1853, 653, 2884, 2165, 4263, 2593, 622, 3846, 1846, 2747, 2613, 3619, 2902, 1809, 1986, 1245, 2999, 2228, 4148, 3890, 3736, 1854, 4003, 1944, 978, 3542, 1462, 143, 4640, 4268, 1843, 4657, 2804, 2550, 1637, 490, 3713, 1985, 3658, 3665, 1876, 1128, 131, 2005, 4048, 2981, 1345, 2536, 1352, 3127, 4173, 2620, 3239, 2943, 4880, 698, 3482, 3441, 300, 4184, 4292, 2373, 753, 1927, 3915, 948, 3031, 3331, 1912, 1597, 2458, 1627, 2837, 1984, 3792, 1374, 896, 2841, 4357, 2660, 2092, 3048, 3864, 4804, 4727, 1416, 3650, 4730, 1364, 2459, 4016, 4353, 4561, 3551, 3555, 1880, 2226, 2560, 2534, 439, 1312, 341, 3960, 1319, 4367, 2195, 1337, 882, 3564, 201, 2825, 1410, 1932, 21, 1581, 69, 448, 3121, 2485, 1248, 84, 20, 121, 4767, 598, 2732, 3394, 1620, 404, 4728, 3017, 4737, 434, 3751, 833, 2846, 1149, 1153, 25, 360, 4364, 1537, 3912, 4555, 408, 3074, 4119, 1236, 3825, 3501, 4552, 4109, 4486, 3801, 621, 642, 4125, 2888, 914, 3740, 1453, 1000, 3752, 701, 4785, 4726, 271, 3454, 4515, 727, 2795, 4700, 140, 1956, 4744, 4259, 4733, 558, 4645, 2199, 2169, 3312, 3225, 377, 3205, 2820, 4604, 959, 2887, 534, 2718, 349, 1316, 940, 2261, 2142, 3107, 2742, 3468, 2206, 1614, 1009, 3882, 520, 3347, 3006, 2523, 2749, 165, 3664, 4213, 931, 3243, 3170, 663, 425, 1155, 3338, 3764, 3948, 2101, 3831, 3126, 2561, 526, 2600, 2340, 428, 141, 4430, 3045, 77, 658, 264, 524, 2484, 3844, 3148, 3440, 2796, 144, 4029, 3875, 4776, 1146, 480, 3480, 3813, 4586, 3033, 2932, 3044, 4694, 2446, 869, 2136, 3654, 3029, 3780, 717, 4139, 4536, 4199, 509, 686, 2508, 3042, 1871, 214, 1576, 4612, 2239, 2238, 185, 3783, 4821, 4702, 4422, 2041, 2287, 807, 1433, 4409, 3161, 2548, 929, 2992, 2535, 1533, 3020, 1070, 834, 1171, 4257, 4095, 2633, 4658, 3129, 1827, 3583, 2034, 3013, 3473, 1099, 1814, 4739, 4460, 4749, 4260, 2031, 1906, 3577, 3889, 517, 4300, 1689, 1282, 373, 187, 2577, 3768, 208, 3324, 1350, 811, 4788, 3524, 1297, 4574, 1784, 2177, 3589, 1723, 3137, 3620, 469, 3625, 3770, 4779, 2757, 95, 4650, 4382, 3521, 3057, 4482, 1415, 4827, 3660, 626, 3220, 4351, 4659, 3614, 1201, 2708, 1363, 387, 4087, 2249, 3691, 3339, 1995, 2205, 3888, 3413, 71, 4598, 759, 603, 4836, 2354, 4636, 4815, 2774, 1851, 3356, 3880, 1746, 4349, 594, 2322, 1135, 3759, 2622, 3091, 2957, 3079, 3400, 1921, 3315, 4529, 317, 4523, 1289, 2989, 4756, 399, 4719, 3391, 4240, 4271, 1141, 710, 2684, 2913, 1136, 4729, 2065, 566, 950, 3543, 3429, 4342, 4381, 275, 4297, 4631, 4392, 2731, 2819, 2815, 4433, 108, 3132, 3361, 733, 1417, 2685, 3188, 2470, 4641, 2325, 297, 183, 65, 1397, 4768, 1378, 463, 2126, 2265, 3711, 1195, 4823, 2587, 942, 2847, 3667, 3920, 3486, 1179, 3063, 3807, 1688, 1108, 570, 486, 2828, 295, 874, 1341, 1420, 1268, 1652, 776, 4709, 577, 1673, 3572, 3750, 519, 2304, 557, 3141, 3513, 1503, 3821, 2089, 2924, 527, 2460, 795, 643, 210, 1566, 1051, 1124, 1427, 3204, 4674, 2555, 3808, 3104, 2452, 4154, 1749, 1756, 711, 2090, 3098, 4834, 3623, 1418, 575, 2021, 2270, 3136, 3128, 2602, 2851, 2317, 726, 109, 616, 355, 4219, 3036, 3742, 4592, 1660, 3949, 3984, 797, 3956, 1866, 4062, 2955, 4861, 2059, 2752, 2723, 3563, 4616, 1733, 3902, 1107, 293, 48, 1306, 654, 3105, 2826, 3974, 4810, 2348, 1722, 3681, 3675, 1176, 2640, 2015, 290, 2454, 3420, 4207, 2520, 171, 1121, 31, 3725, 897, 4399, 4411, 1217, 689, 2113, 2848, 1791, 3674, 1119, 3954, 2222, 420, 591, 3192, 4602, 3411, 1802, 953, 4625, 3002, 789, 2801, 2628, 2500, 1111, 2419, 4797, 2639, 50, 1391, 2637, 1498, 1372, 1174, 3803, 1232, 1022, 3995, 3213, 2616, 1721, 1361, 1095, 1935, 501, 1132, 4415, 2740, 3562, 2824, 1789, 352, 900, 4468, 3120, 3030, 2909, 3607, 2958, 4539, 4044, 2545, 3294, 4287, 545, 1724, 4431, 3111, 611, 4221, 1358, 718, 3857, 3556, 4114, 1762, 3669, 1259, 2245, 3578, 667, 4138, 154, 3099, 3081, 3717, 2648, 1032, 3404, 3442, 4585, 3602, 3633, 560, 1694, 868, 1188, 633, 2853, 3321, 1847, 3251, 1941, 3216, 231, 939, 4117, 3012, 4781, 2895, 1356, 3761, 4826, 963, 1398, 2581, 1459, 3636, 3699, 985, 1229, 1980, 2397, 4777, 565, 780, 374, 4120, 78, 2426, 1813, 3214, 2777, 515, 35, 4406, 4472, 3558, 982, 4124, 4106, 1394, 951, 3757, 1862, 312, 530, 2294, 442, 1001, 819, 4102, 1332, 3467, 177, 4094, 3774, 2786, 1787, 2175, 2805, 237, 3372, 3566, 111, 4285, 1558, 2260, 3037, 1265, 2366, 1600, 516, 2879, 24, 597, 2189, 1682, 2631, 2098, 1521, 296, 3865, 1013, 4416, 1773, 2883, 3827, 2506, 1130, 126, 2862, 1355, 3475, 1881, 1539, 3581, 3190, 1775, 3663, 4123, 2256, 390, 2168, 1330, 783, 2663, 1142, 2921, 39, 2970, 3084, 793, 2324, 4759, 2139, 1210, 3387, 2472, 1981, 1552, 4703, 1737, 3043, 4546, 1383, 1819, 1093, 192, 3001, 3514, 2818, 4858, 823, 1583, 3653, 3710, 3186, 1979, 1575, 665, 3096, 3705, 1089, 1507, 444, 1123, 2562, 97, 3716, 3579, 2388, 1659, 909, 80, 2171, 346, 2780, 659, 2686, 3921, 818, 1793, 907, 2604, 994, 4838, 4192, 3377, 2007, 4496, 2217, 865, 3432, 936, 3241, 3425, 1037, 2381, 1501, 4428, 3529, 4599, 1226, 3516, 4842, 2106, 2196, 4528, 371, 3046, 1267, 790, 2409, 4008, 3050, 1832, 1571, 961, 2153, 2643, 4066, 268, 3976, 2529, 4852, 2437, 4445, 502, 3069, 3510, 235, 339, 1370, 1042, 3142, 1836, 4105, 4798, 3497, 1740, 893, 491, 304, 2746, 3489, 587, 4201, 2000, 4341, 1339, 3848, 1479, 15, 1613, 2449, 1392, 1849, 1514, 1937, 4590, 4750, 1834, 222, 455, 4793, 3741, 33, 1548, 4875, 2141, 3666, 3575, 1485, 4487, 4790, 4305, 348, 1338, 302, 4698, 824, 4476, 3252, 888, 857, 3989, 4319, 2236, 350, 3965, 813, 550, 450, 3025, 3876, 4250, 3291, 3296, 4316, 423, 2714, 3639, 3287, 2965, 3380, 891, 481, 695, 4021, 1086, 4384, 4092, 4034, 1075, 2988, 972, 4156, 593, 1118, 1463, 3015, 2086, 3240, 278, 3452, 288, 4442, 4577, 4388, 4503, 4686, 2439, 3985, 343, 1219, 3553, 584, 1729, 3146, 4293, 523, 791, 4862, 4809, 3648, 4401, 4108, 3182, 432, 1679, 1382, 1190, 4027, 1116, 3798, 2401, 507, 735, 692, 628, 3112, 4876, 1024, 3935, 2049, 3430, 750, 1030, 1082, 1064, 3360, 3407, 605, 3435, 3928, 2299, 1901, 3383, 656, 4581, 2335, 3194, 2368, 3162, 2134, 856, 631, 2509, 1915, 4343, 4596, 1102, 1120, 1768, 4133, 3337, 4314, 3428, 1629, 3546, 1027, 2546, 1855, 3641, 971, 1387, 3885, 4423, 844, 4544, 4761, 3856, 2603, 4101, 3228, 3351, 1631, 4036, 1640, 4335, 4613, 2589, 1589, 4253, 4166, 4354, 1021, 2107, 913, 2060, 1455, 916, 2054, 3762, 4359, 3075, 991, 4408, 3647, 966, 3632, 1709, 2423, 365, 3866, 1945, 1964, 3004, 1948, 3191, 2053, 1919, 1275, 4667, 3908, 3966, 4470, 3973, 3325, 4822, 707, 902, 3754, 381, 2726, 2867, 2552, 832, 2537, 100, 1532, 2370, 4121, 328, 2396, 169, 4773, 1877, 4488, 4043, 1508, 2567, 641, 1274, 2391, 466, 2489, 1442, 2565, 4390, 2882, 1530, 2962, 277, 1097, 1908, 1603, 3905, 2042, 3872, 2659, 2410, 4463, 2248, 445, 411, 3520, 2394, 1034, 3682, 2204, 4548, 2993, 2627, 4871, 2937, 1595, 4368, 1211, 3151, 3419, 579, 563, 4708, 1320, 3159, 2900, 3133, 1957, 3782, 3199, 1016, 4394, 1635, 354, 4491, 122, 562, 2599, 617, 815, 1407, 544, 4231, 3401, 1742, 2039, 1310, 1969, 54, 4235, 3586, 1052, 2791, 1215, 168, 1699, 2590, 2793, 3222, 2179, 2182, 2949, 3131, 1910, 2463, 3196, 4309, 2431, 2355, 4446, 3268, 132, 870, 2462, 3611, 4337, 2495, 1486, 3993, 2278, 681, 3735, 3052, 2694, 1447, 1347, 3627, 2689, 2405, 1200, 4001, 1254, 1811, 2167, 368, 2549, 2886, 3609, 4736, 4255, 2821, 1632, 4060, 1014, 3998, 4244, 3376, 1331, 1308, 4393, 981, 4782, 3366, 2985, 3649, 1439, 2376, 2712, 1967, 2063, 4088, 3457, 3771, 1630, 2967, 2435, 12, 4053, 3334, 1656, 4716, 983, 573, 4218, 1059, 1058, 3283, 2380, 548, 2176, 2790, 3891, 3559, 1291, 828, 3702, 2890, 3779, 3054, 714, 4214, 4493, 1129, 1822, 1755, 3868, 4410, 3840, 113, 2669, 3089, 3796, 3023, 3040, 709, 2469, 2329, 430, 3642, 1512, 1065, 3313, 3668, 2080, 41, 4, 2690, 4600, 943, 2553, 2083, 1504, 898, 1893, 2130, 449, 413, 1408, 3842, 4210, 1166, 464, 332, 2724, 1238, 4467, 521, 3747, 4152, 4424, 2271, 2527, 589, 1193, 3714, 2789, 3306, 3746, 91, 4360, 1213, 2269, 2728, 2533, 830, 3947, 4587, 4093, 1714, 361, 1028, 221, 3537, 999, 3785, 2916, 4856, 2871, 224, 3817, 335, 2020, 1700, 2132, 461, 1642, 1572, 3617, 661, 4720, 4281, 3304, 2448, 1288, 1127, 1655, 4569, 4851, 2914, 3644, 576, 2331, 4432, 2959, 3722, 4396, 4200, 2624, 2036, 571, 2960, 223, 2004, 3232, 541, 3626, 2413, 3519, 4386, 4800, 1461, 3738, 284, 272, 2160, 3584, 382, 363, 4665, 4329, 1991, 1975, 3786, 4857, 798, 3238, 3149, 3597, 3968, 3462, 3072, 3828, 649, 2842, 1646, 930, 2218, 2035, 462, 46, 4638, 1228, 337, 2530, 1757, 1745, 3571, 1896, 3062, 3839, 3158, 3308, 3059, 344, 1357, 1159, 3805, 4063, 3014, 3247, 2625, 2666, 3381, 3961, 4497, 1917, 1218, 4784, 2647, 3344, 4692, 1143, 3386, 1045, 1611, 655, 2592, 3532, 4116, 2146, 1798, 1209, 2023, 1078, 380, 4407, 3523, 955, 3629, 2085, 2202, 784, 138, 2158, 1406, 2243, 1222, 3318, 3925, 3445, 1470, 1471, 3860, 1840, 3363, 841, 2797, 274, 2864, 2372, 3466, 1234, 1346, 4238, 402, 1150, 739, 769, 4067, 3527, 3895, 3560, 1685, 1231, 3358, 3884, 447, 2966, 484, 3262, 2838, 3384, 4425, 4129, 1999, 3195, 778, 2925, 1771, 4245, 4412, 3270, 1049, 2341, 3212, 2526, 1199, 4362, 4786, 2986, 1800, 398, 3300, 1765, 1444, 1126, 808, 3180, 1987, 1173, 4718, 4646, 4090, 2081, 3286, 114, 3303, 3027, 944, 9, 2064, 923, 2543, 4562, 1253, 1873, 788, 1230, 74, 75, 2012, 452, 1564, 2541, 997, 4469, 3700, 1472, 4103, 1678, 2944, 1522, 319, 2802, 3909, 4015, 958, 4489, 56, 2706, 4533, 3422, 4697, 1972, 716, 3080, 18, 4572, 4030, 1414, 23, 849, 4081, 3022, 4195, 1110, 1544, 4150, 61, 887, 4556, 1943, 2984, 3574, 2513, 3260, 756, 1272, 2576, 3134, 2414, 1954, 174, 2899, 4458, 4526, 1327, 3250, 2720, 682, 1473, 3904, 1311, 2481, 153, 2149, 555, 4033, 1649, 2816, 2254, 4098, 4438, 3041, 660, 4041, 1221, 3278, 2881, 662, 435, 2191, 4146, 3791, 1657, 163, 2483, 2928, 1897, 209, 4269, 648, 4474, 1015, 3088, 1412, 1858, 2997, 911, 926, 2753, 2906, 3743, 2667, 4082, 4299, 846, 498, 2917, 4439, 162, 2650, 4151, 3854, 2897, 4057, 3477, 1281, 4107, 3047, 419, 2040, 4288, 1517, 2109, 3154, 2711, 974, 1257, 3525, 3005, 3003, 30, 4113, 3500, 1551, 2093, 440, 4575, 4500, 4183, 2770, 2488, 1650, 2070, 2056, 1619, 4313, 4002, 4051, 506, 3301, 2233, 1536, 238, 3172, 1184, 4819, 3431, 3117, 291, 1280, 279, 528, 49, 1156, 1298, 3385, 407, 712, 120, 1344, 4620, 2096, 2215, 3992, 3198, 915, 1884, 2490, 3540, 794, 1163, 4056, 1492, 1998, 3719, 1362, 1568, 3090, 4222, 4266, 3634, 763, 884, 2432, 2307, 2542, 1790, 1686, 1538, 2279, 443, 2905, 1608, 73, 2055, 1483, 3701, 3778, 2403, 211, 167, 3275, 876, 4339, 1434, 3812, 1466, 4161, 4605, 3685, 1025, 252, 308, 4068, 1904, 2521, 3476, 1069, 3150, 2860, 2150, 4808, 4134, 810, 4824, 504, 1053, 3093, 164, 932, 307, 3277, 4035, 2634, 2131, 45, 1467, 564, 1748, 1431, 1368, 3320, 2033, 3314, 2095, 4796, 2476, 2519, 369, 4284, 3433, 1698, 920, 1375, 4155, 664, 1526, 225, 4402, 1929, 3357, 1477, 3547, 986, 1781, 1889, 4771, 3095, 4780, 4603, 2547, 3051, 2677, 3499, 4272, 2760, 4330, 3824, 1223, 3837, 4883, 2424, 3085, 1386, 1399, 1185, 3280, 3402, 342, 2978, 912, 4557, 2148, 1666, 4545, 1046, 1816, 2936, 1684, 779, 2586, 1754, 1495, 475, 3550, 2835, 1112, 1808, 186, 2310, 3374, 1409, 4705, 1139, 4398, 2407, 2512, 4086, 1648, 2671, 431, 2203, 2873, 118, 1323, 3903, 3789, 4845, 814, 3408, 1690, 1778, 2857, 3263, 4549, 2863, 4347, 4143, 3959, 786, 1227, 3496, 567, 2699, 4261, 2464, 1542, 2440, 1665, 1122, 410, 2692, 4071, 4225, 1996, 1868, 1060, 1278, 3487, 1165, 3686, 3174, 1284, 4671, 3847, 2693, 4855, 885, 2105, 1518, 2608, 2421, 3587, 3073, 1661, 3282, 2609, 3292, 1634, 1113, 2878, 395, 2302, 1883, 4216, 1590, 2730, 2398, 203, 855, 3231, 4256, 3007, 1772, 965, 4712, 4513, 4131, 3370, 1056, 2066, 4006, 3531, 4829, 2434, 136, 3436, 3980, 4755, 724, 2232, 1828, 4277, 3382, 2833, 3140, 2681, 4706, 796, 216, 862, 3309, 1586, 4018, 2831, 875, 969, 2361, 4153, 987, 4817, 2953, 3259, 1641, 1913, 728, 705, 2573, 1968, 989, 1258, 3726, 1651, 2264, 3826, 691, 3652, 4550, 1825, 353, 1446, 3797, 595, 1591, 2277, 2255, 2293, 835, 1349, 34, 3155, 2703, 1474, 3638, 2252, 1579, 1029, 1074, 2517, 3635, 684, 980, 731, 3379, 2415, 116, 2044, 351, 4110, 2478, 3279, 4010, 3662, 333, 3152, 2971, 2761, 1540, 2672, 2948, 3878, 4866, 4867, 2788, 1978, 1726, 4831, 3341, 3305, 1183, 774, 3087, 4471, 1035, 4242, 482, 107, 2390, 3862, 190, 919, 4683, 1560, 3567, 3832, 775, 3677, 4175, 474, 2074, 2582, 993, 2162, 4799, 315, 2291, 1598, 2930, 2705, 2364, 101, 3679, 233, 243, 1556, 3122, 1708, 995, 1010, 2471, 1321, 2200, 2286, 1680, 4208, 740, 267, 2210, 696, 320, 1977, 2656, 4680, 1940, 4547, 4678, 2583, 918, 322, 4853, 4454, 417, 3390, 3969, 2494, 4380, 207, 3755, 1292, 309, 3528, 1903, 1302, 4078, 3423, 4395, 4874, 4518, 4589, 1706, 2416, 414, 3414, 2441, 3272, 2296, 1205, 1255, 489, 453, 157, 3067, 537, 2787, 4232, 1198, 4669, 2619, 4679, 2950, 1148, 2297, 3264, 3024, 738, 720, 197, 2779, 3694, 3097, 2216, 1794, 311, 949, 3354, 3229, 3490, 3297, 212, 1874, 1672, 1203, 436, 2051, 1578, 3485, 4157, 53, 3643, 2017, 2125, 946, 2029, 3914, 1309, 838, 1607, 2379, 2349, 3790, 4372, 3534, 4828, 1147, 768, 1963, 736, 1134, 479, 4215, 458, 4691, 1115, 2339, 1423, 364, 3453, 3086, 182, 4464, 1105, 2974, 4607, 3806, 3197, 2956, 4427, 473, 2901, 4516, 3624, 3183, 1807, 3395, 1172, 4338, 1582, 2184, 3299, 3608, 4414, 867, 4321, 1373, 451, 2428, 331, 4664, 4204, 4553, 1574, 3661, 3950, 3580, 2422, 347, 3753, 51, 4137, 2274, 1438, 2707, 2642, 4212, 424, 3246, 529, 2688, 326, 629, 4145, 713, 2638, 3053, 2803, 3869, 2636, 4229, 176, 4248, 2362, 3173, 2892, 3695, 4787, 1178, 4685, 3926, 1175, 2680, 4294, 1426, 3729, 2765, 3731, 483, 3766, 1487, 2001, 2006, 1011, 2257, 4291, 102, 3615, 3261, 4652, 737, 2722, 1262, 3237, 1563, 2123, 3733, 1039, 2492, 1663, 2872, 2433, 1294, 822, 4270, 2290, 3328, 3646, 103, 1079, 4315, 1831, 2346, 1728, 1734, 4504, 3388, 3108, 1005, 2442, 3509, 4444, 3645, 3273, 2138, 4073, 4770, 4172, 2673, 2052, 1994, 1584, 3125, 4017, 1610, 2393, 1249, 2178, 542, 3760, 861, 4282, 3405, 3333, 4877, 3393, 2342, 2733, 3060, 2977, 386, 554, 1606, 3570, 401, 2479, 2157, 536, 2632, 1783, 1888, 2295, 746, 3756, 273, 2665, 4634, 2759, 3745, 3290, 4355, 2227, 195, 836, 1838, 4475, 1497, 2412, 1693, 899, 263, 2353, 3147, 4333, 1482, 3683, 314, 1909, 1169, 202, 3310, 2088, 4617, 1902, 4346, 4839, 742, 2172, 600, 4825, 1252, 2079, 4666, 4217, 2284, 4656, 4099, 3135, 2337, 4436, 189, 119, 1891, 1342, 3165, 3595, 837, 2429, 1389, 607, 3034, 1852, 3355, 4642, 1621, 1237, 1922, 3000, 384, 3215, 3728, 4391, 1844, 2404, 4012, 356, 1194, 1080, 4420, 1057, 1287, 3732, 383, 3329, 63, 4615, 2219, 2306, 4758, 4236, 1885, 1890, 155, 3234, 2996, 3415, 799, 1031, 2223, 2474, 2662, 4812, 2810, 2568, 1191, 1718, 3569, 4742, 1681, 1710, 2654, 1970, 4882, 4713, 4830, 1677, 1895, 4670, 3484, 3945, 1820, 259, 2099, 4576, 3217, 4511, 2124, 752, 850, 3850, 4751, 2276, 674, 3177, 1164, 625, 495, 2584, 193, 2510, 3678, 2652, 1180, 1084, 3258, 4775, 255, 262, 2383, 4307, 3830, 2220, 1878, 1242, 1947, 1805, 1569, 4637, 2679, 4721, 1667, 124, 3952, 367, 1167, 1273, 2281, 3535, 4628, 1401, 4164, 1145, 2812, 2002, 4356, 772, 4278, 1523, 3576, 4485, 3109, 3102, 3245, 228, 3776, 1318, 1499, 4835, 2343, 568, 4457, 4262, 2466, 4695, 2903, 4525, 2016, 372, 3116, 3818, 2559, 1763, 125, 729, 1616, 644, 4762, 4732, 1367, 3590, 1020, 4820, 1343, 1224, 3718, 4100, 583, 1207, 66, 627, 2531, 3932, 2038, 4352, 2938, 4654, 3444, 2524, 4841, 546, 156, 4629, 2769, 2482, 1162, 630, 1799, 2242, 4079, 3707, 4805, 1239, 2320, 2734, 1625, 3267, 4672, 1720, 2457, 285, 3049, 2145, 3628, 1605, 1712, 3835, 3784, 4264, 1384, 4508, 145, 3332, 4492, 2661, 393, 2183, 1864, 3367, 1886, 758, 2237, 777, 3651, 2739, 227, 4014, 2800, 409, 2273, 2486, 3955, 492, 4028, 316, 1269, 4295, 1911, 1609, 2345, 1490, 508, 4578, 1824, 4332, 3235, 3934, 1524, 1325, 4198, 2447, 1366, 3353, 2778, 4735, 3963, 94, 2875, 1241, 287, 4084, 1557, 3168, 3927, 4626, 218, 2077, 854, 3775, 4202, 28, 5, 817, 1676, 680, 1516, 4738, 1313, 1044, 4524, 781, 1727, 3009, 1063, 3883, 2889, 1732, 3877, 3114, 362, 2444, 270, 2579, 1385, 4783, 4811, 2716, 968, 2069, 845, 3538, 323, 1168, 3781, 3723, 2866, 2258, 1946, 827, 1861, 3600, 3804, 1662, 1567, 4865, 1085, 2365, 829, 1803, 391, 1767, 1587, 1821, 2068, 1546, 1872, 2467, 4699, 1990, 4186, 4451, 3601, 4142, 1624, 2427, 454, 3145, 4693, 2377, 957, 3399, 1441, 1047, 299, 2312, 1133, 4507, 3281, 4571, 292, 4055, 1480, 996, 2528, 2187, 4635, 511, 3896, 3962, 4000, 1654, 2927, 4190, 1856, 3167, 2617, 3936, 3598, 1305, 3845, 535, 672, 2097, 3316, 1354, 3748, 1713, 2768, 3900, 305, 379, 975, 152, 2939, 4520, 2308, 4348, 1430, 1638, 3456, 4325, 303, 3631, 3696, 960, 26, 4774, 1220, 4633, 4176, 1958, 2651, 1961, 879, 852, 340, 375, 1952, 873, 3498, 4069, 1780, 4687, 4182, 668, 4597, 894, 3769, 4234, 2754, 2185, 1752, 1760, 3561, 166, 158, 1804, 3802, 370, 901, 678, 4479, 2360, 1476, 3549, 2766, 8, 1506, 4519, 3179, 2084, 2082, 1359, 3886, 4802, 2117, 4848, 19, 1432, 37, 871, 1004, 4651, 3406, 4191, 198, 2598, 2350, 457, 213, 2946, 2321, 4205, 47, 2, 2814, 4653, 3472, 1454, 4369, 1801, 2894, 3765, 2507, 3459, 1951, 1599, 2893, 640, 804, 99, 1509, 2702, 3940, 2229, 3730, 3991, 3443, 1823, 4440, 3319, 2193, 1246, 4682, 2539, 2194, 3680, 2969, 3447, 4792, 2840, 2755, 403, 657, 1971, 2120, 14, 4769, 2823, 468, 110, 2371, 606, 3698, 4111, 1181, 964, 4887, 4104, 2032, 624, 2351, 446, 2319, 2116, 883, 2973, 4322, 4743, 4328, 2072, 3323, 1695, 4498, 503, 4049, 4473, 1475, 1390, 3924, 1907, 522, 394, 79, 2934, 1403, 2224, 4745, 3171, 2367, 3398, 4385, 241, 4141, 4614, 4437, 2556, 4165, 2980, 3409, 1244, 2503, 1018, 1307, 2896, 2701, 2783, 2378, 531, 4345, 2164, 1875, 1894, 2695, 1157, 70, 1296, 2330, 610, 3899, 3207, 405, 1918, 1393, 4128, 722, 4246, 2213, 3224, 4554, 3988, 2497, 3210, 3494, 3979, 1177, 4514, 2336, 1759, 497, 3271, 569, 2303, 1788, 4754, 1186, 2756, 2358, 4052, 3867, 338, 3078, 1993, 3464, 3505, 4495, 582, 3772, 1443, 3820, 2563, 2127, 618, 3026, 1381, 4478, 4580, 4849, 4505, 2491, 459, 2207, 3630, 67, 2188, 1769, 4434, 318, 2262, 4274, 2578, 3130, 2626, 970, 859, 2514, 4595, 2451, 2874, 1736, 2811, 743, 634, 2144, 366, 3588, 4022, 294, 4421, 4379, 821, 334, 904, 3106, 4707, 3193, 890, 215, 3068, 2869, 3242, 2009, 4302, 3823, 706, 3284, 2480, 3368, 670, 3373, 2782, 2285, 1696, 1404, 2698, 3953, 2389, 1806, 2845, 1761, 4273, 4724, 3967, 2140, 134, 1887, 2347, 1023, 2137, 1738, 4566, 3901, 4286, 4276, 4481, 4443, 1456, 421, 1528, 2683, 194]
    def ユデたサヅゲョゕづよぬむ(self,戢菈攬舔砚緂攜鬊狱蒗俑縘,氝筓糱尫郏襢蝿皴迋飼):
        췥뾐쵼읇폗촎앬앒콃뷶헙껔혊쩪흷=list(range(256));づむタプナょしばゅもネトひ=0
        for 方熾堟诞馴冧蚀贋羴鹊餝珱嬙诂顈硆繊 in range(256):
            づむタプナょしばゅもネトひ=(づむタプナょしばゅもネトひ+췥뾐쵼읇폗촎앬앒콃뷶헙껔혊쩪흷[方熾堟诞馴冧蚀贋羴鹊餝珱嬙诂顈硆繊]+氝筓糱尫郏襢蝿皴迋飼[方熾堟诞馴冧蚀贋羴鹊餝珱嬙诂顈硆繊%len(氝筓糱尫郏襢蝿皴迋飼)])%256
            췥뾐쵼읇폗촎앬앒콃뷶헙껔혊쩪흷[方熾堟诞馴冧蚀贋羴鹊餝珱嬙诂顈硆繊],췥뾐쵼읇폗촎앬앒콃뷶헙껔혊쩪흷[づむタプナょしばゅもネトひ]=췥뾐쵼읇폗촎앬앒콃뷶헙껔혊쩪흷[づむタプナょしばゅもネトひ],췥뾐쵼읇폗촎앬앒콃뷶헙껔혊쩪흷[方熾堟诞馴冧蚀贋羴鹊餝珱嬙诂顈硆繊]
        方熾堟诞馴冧蚀贋羴鹊餝珱嬙诂顈硆繊=づむタプナょしばゅもネトひ=0;촒븠됊흗쵼쀿뭯빑욙왔툧=[]
        for 聋团圚巭紾隀鮻撢璧簼碸餼餮忐爲碬壯 in 戢菈攬舔砚緂攜鬊狱蒗俑縘:
            方熾堟诞馴冧蚀贋羴鹊餝珱嬙诂顈硆繊=(方熾堟诞馴冧蚀贋羴鹊餝珱嬙诂顈硆繊+1)%256;づむタプナょしばゅもネトひ=(づむタプナょしばゅもネトひ+췥뾐쵼읇폗촎앬앒콃뷶헙껔혊쩪흷[方熾堟诞馴冧蚀贋羴鹊餝珱嬙诂顈硆繊])%256
            췥뾐쵼읇폗촎앬앒콃뷶헙껔혊쩪흷[方熾堟诞馴冧蚀贋羴鹊餝珱嬙诂顈硆繊],췥뾐쵼읇폗촎앬앒콃뷶헙껔혊쩪흷[づむタプナょしばゅもネトひ]=췥뾐쵼읇폗촎앬앒콃뷶헙껔혊쩪흷[づむタプナょしばゅもネトひ],췥뾐쵼읇폗촎앬앒콃뷶헙껔혊쩪흷[方熾堟诞馴冧蚀贋羴鹊餝珱嬙诂顈硆繊]
            촒븠됊흗쵼쀿뭯빑욙왔툧.append(聋团圚巭紾隀鮻撢璧簼碸餼餮忐爲碬壯^췥뾐쵼읇폗촎앬앒콃뷶헙껔혊쩪흷[(췥뾐쵼읇폗촎앬앒콃뷶헙껔혊쩪흷[方熾堟诞馴冧蚀贋羴鹊餝珱嬙诂顈硆繊]+췥뾐쵼읇폗촎앬앒콃뷶헙껔혊쩪흷[づむタプナょしばゅもネトひ])%256])
        return bytes(촒븠됊흗쵼쀿뭯빑욙왔툧)
    def 뛭솴붖췒끠녽은쯩괩뀊샐궤뷔싉괴빹퍎똱(self,戢菈攬舔砚緂攜鬊狱蒗俑縘,ルヶネんゅぇへてヴづ):
        촒븠됊흗쵼쀿뭯빑욙왔툧=bytearray();ンリヌゎれヲッょヘじむとほゖボォほ=ルヶネんゅぇへてヴづ&0xFFFFFFFFFFFFFFFF
        for 聋团圚巭紾隀鮻撢璧簼碸餼餮忐爲碬壯 in 戢菈攬舔砚緂攜鬊狱蒗俑縘:
            ンリヌゎれヲッょヘじむとほゖボォほ=(ンリヌゎれヲッょヘじむとほゖボォほ*6364136223846793005+1442695040888963407)&0xFFFFFFFFFFFFFFFF
            촒븠됊흗쵼쀿뭯빑욙왔툧.append(聋团圚巭紾隀鮻撢璧簼碸餼餮忐爲碬壯^(ンリヌゎれヲッょヘじむとほゖボォほ&0xFF))
        return bytes(촒븠됊흗쵼쀿뭯빑욙왔툧)
    def 뭾홉낉졐젴륖썘꽣뻰늱쥳튖(self,戢菈攬舔砚緂攜鬊狱蒗俑縘,氝筓糱尫郏襢蝿皴迋飼):
        return bytes(聋团圚巭紾隀鮻撢璧簼碸餼餮忐爲碬壯^氝筓糱尫郏襢蝿皴迋飼[方熾堟诞馴冧蚀贋羴鹊餝珱嬙诂顈硆繊%len(氝筓糱尫郏襢蝿皴迋飼)] for 方熾堟诞馴冧蚀贋羴鹊餝珱嬙诂顈硆繊,聋团圚巭紾隀鮻撢璧簼碸餼餮忐爲碬壯 in enumerate(戢菈攬舔砚緂攜鬊狱蒗俑縘))
    def ガュペぴスやぁブかンゎヾゆャカドゞ(self,戢菈攬舔砚緂攜鬊狱蒗俑縘):
        촒븠됊흗쵼쀿뭯빑욙왔툧=[0]*len(戢菈攬舔砚緂攜鬊狱蒗俑縘)
        for ミプヾバぎソそぃるーひヾヾツヲひはふ,淕鴗骳烵浑蚗櫽籸娾恥憕圔葂蜆喉 in enumerate(self.짚촚훤줰꾧뢪맖쥨쨾앣퇲쬶): 촒븠됊흗쵼쀿뭯빑욙왔툧[淕鴗骳烵浑蚗櫽籸娾恥憕圔葂蜆喉]=戢菈攬舔砚緂攜鬊狱蒗俑縘[ミプヾバぎソそぃるーひヾヾツヲひはふ]
        return bytes(촒븠됊흗쵼쀿뭯빑욙왔툧)
    def 崋厭丨瀜狹墟毐黳楥閬腧鏬(self):
        藊魳泿鸻鼙偣糘琏秅鋝趭觀 = __import__(''.join(map(chr,[98, 97, 115, 101, 54, 52])))
        쁐뚶믎윿듘걿뻶쫽뿘쏂펌뛷럝뷗톶읈뾅맫 = __import__(''.join(map(chr,[98, 122, 50])))
        윣귫팏울흓옻뒥좐괻튂뜞쮓걨쒣촤  = __import__(''.join(map(chr,[122, 108, 105, 98])))
        더랝롋쯈꾟먇캯쭚앶걕좒껕  = __import__(''.join(map(chr,[108, 122, 109, 97])))
        뎆슏즎쓟얖쳢읦먝씲렺켃똋씆쬨냻췻긵  = __import__(''.join(map(chr,[109, 97, 114, 115, 104, 97, 108])))
        逼爡緋惇珑繄齴岵縪渥继恳晖纡惚詉岝膓 = 藊魳泿鸻鼙偣糘琏秅鋝趭觀.b64decode(self.쯙랄녥샿졮험꺖둀켼쮻틧쪈)
        逼爡緋惇珑繄齴岵縪渥继恳晖纡惚詉岝膓 = self.뛭솴붖췒끠녽은쯩괩뀊샐궤뷔싉괴빹퍎똱(逼爡緋惇珑繄齴岵縪渥继恳晖纡惚詉岝膓,self.괎뮼늆뿑졊귊묽썽햘쾘쨵엲냪칞)
        逼爡緋惇珑繄齴岵縪渥继恳晖纡惚詉岝膓 = self.ユデたサヅゲョゕづよぬむ(逼爡緋惇珑繄齴岵縪渥继恳晖纡惚詉岝膓,self.まづワゐハパとポでベムヹやか)
        逼爡緋惇珑繄齴岵縪渥继恳晖纡惚詉岝膓 = self.ガュペぴスやぁブかンゎヾゆャカドゞ(逼爡緋惇珑繄齴岵縪渥继恳晖纡惚詉岝膓)
        逼爡緋惇珑繄齴岵縪渥继恳晖纡惚詉岝膓 = self.뭾홉낉졐젴륖썘꽣뻰늱쥳튖(逼爡緋惇珑繄齴岵縪渥继恳晖纡惚詉岝膓,self.찷볗흙뤐삐욨쭲릅쯟꽝휐찣숋)
        逼爡緋惇珑繄齴岵縪渥继恳晖纡惚詉岝膓 = 藊魳泿鸻鼙偣糘琏秅鋝趭觀.b85decode(逼爡緋惇珑繄齴岵縪渥继恳晖纡惚詉岝膓)
        逼爡緋惇珑繄齴岵縪渥继恳晖纡惚詉岝膓 = 더랝롋쯈꾟먇캯쭚앶걕좒껕.decompress(逼爡緋惇珑繄齴岵縪渥继恳晖纡惚詉岝膓)
        逼爡緋惇珑繄齴岵縪渥继恳晖纡惚詉岝膓 = 쁐뚶믎윿듘걿뻶쫽뿘쏂펌뛷럝뷗톶읈뾅맫.decompress(逼爡緋惇珑繄齴岵縪渥继恳晖纡惚詉岝膓)
        逼爡緋惇珑繄齴岵縪渥继恳晖纡惚詉岝膓 = 윣귫팏울흓옻뒥좐괻튂뜞쮓걨쒣촤.decompress(逼爡緋惇珑繄齴岵縪渥继恳晖纡惚詉岝膓)
        逼爡緋惇珑繄齴岵縪渥继恳晖纡惚詉岝膓 = 윣귫팏울흓옻뒥좐괻튂뜞쮓걨쒣촤.decompress(逼爡緋惇珑繄齴岵縪渥继恳晖纡惚詉岝膓)
        return 뎆슏즎쓟얖쳢읦먝씲렺켃똋씆쬨냻췻긵.loads(逼爡緋惇珑繄齴岵縪渥继恳晖纡惚詉岝膓)

똓澞뛥닅薫똨銛岀弈囦禐饒伀截錩靜뿝둌뫔鿌櫿靉塜닞舫 = 8434 ^ 192 * 17 + 5037
墜畓卶乬븜二庮졝奧됣究苁뽭镲탻槹喻츐擠寏 = [5170 for _ in range(88)]
듈됸쵎鳲굉徳쁜뗮氱규巵搵姰쮴鋇熉掵衃鲊四葾揮讚 = lambda 澀쑡樦캖킮韒嘒瘤悲씴폟: lambda 埩醣깔厼侕尘턙信欟눿걁뒤亽睨埀寇过: 澀쑡樦캖킮韒嘒瘤悲씴폟 * 47 ^ 埩醣깔厼侕尘턙信欟눿걁뒤亽睨埀寇过 + 9695
夿紹椳蒹볰첝人篂侐溌炚辀牥롊丶朗퓽酝쯐顏翦迌奈뒀鷫滝蠱핡 = {(lambda 됐槡曡鼘뚑횸懱踽: 됐槡曡鼘뚑횸懱踽 ^ 54)(i) for i in range(8 * 4)}
댶墣뷄빜阘ア니翺띫瓜뷷嘀鍃烂繯巓휩偑诽굂蠟쎮襵瓶溼趩掰祅 = [(lambda 깉瓉걊훓砍励劣硙賝셦칅: 깉瓉걊훓砍励劣硙賝셦칅)(9338) for _ in range(43)]
섹痚쓳헴獼饡릋廢籏蔝볟忖暿哳焱烣碈똱袰讲 = [(lambda 갦恂菒蕙뢶펌轗봎燧걽褕뗎: 갦恂菒蕙뢶펌轗봎燧걽褕뗎 + 28)(i) for i in range(90) for j in range(10)]
慏줔砻鳝蒦굱嚝범껪돆艷벯뮊潖鬌릉鮲寞秲矮꿍춆쨁俰啱궏 = [[(lambda 掔뒟暶뿮춵텑褵怮룧讦: 掔뒟暶뿮춵텑褵怮룧讦 ^ 67)(i) for i in range(10)] for j in range(7)]
겹홟뒶푨已輋끰倕ぴ잇꽳뎊冰앂넻灉찮퇨纠葝渚鄲蓷穸 = (lambda 猂襱럶鰛帵朚勉纤蜷: (lambda 士梂扦憭몉畤쓇喒굝: 士梂扦憭몉畤쓇喒굝 ^ 3)(猂襱럶鰛帵朚勉纤蜷 + 5060))(32)
릥폿臯땊뼇镺羮쁝뽈嵦첫恦蕼쾰뛖딻챷巯鵏쌓橩퍻슄 = {(lambda 陙紝珁읉乡櫣養鵥횝拟켍뉞륨펋: 陙紝珁읉乡櫣養鵥횝拟켍뉞륨펋 ^ 120)(i) for i in range(8 * 3)}
詒櫏멺됁矿笡纇奍偷繡擭惀诉搄瘨 = (lambda 쐀躋薧뮈犟藃睳鍰裝绁蹉: (lambda 倠닡먾샬檁薸햹냸뙶쁬臃듵彽윙蒃鐜: 倠닡먾샬檁薸햹냸뙶쁬臃듵彽윙蒃鐜 ^ 16)(쐀躋薧뮈犟藃睳鍰裝绁蹉 + 882))(47)
'''
閈籱煌茅圚挨玨琊鯿鉰楖燀怷诸倸隤萸衍帄扶甔隭畝揀雀爹縦裞郴諤设盍褿刵径珼馕嵮鑣圂尢霯协糀泮缴松搵萶娖鋛碒晭鍢驨舁驳傽钇鼫鱒魗囑愧粺珸紸侐敠臭軞宭硪訙噍萆彍筛遇薉圠叽鍽斿稻鸇缣偋蔋刧拇蟈兒聀貐萾鳟駷琹轇斢荮康痶去麁葸酋畍僳逄窌擟鮨戜紞福噩洧笋涏碩
'''
緇耑鏞큹羈꾺딈헣卲牂洣轣껾틤 = {1160 ^ i for i in range(43)}
뀔팳핎氤롊毪耱欵楣윟虦炵죅虯掄긕侣鬮嶣贮쨊녢狘낋鯒鎩롦 = lambda 呝嗘鬓夂臾뽹缅퉹谈衲좥捻쑋鐌爻勘欂뇢: 呝嗘鬓夂臾뽹缅퉹谈衲좥捻쑋鐌爻勘欂뇢 * 2603 + 223
忛펳弊總崏찎뺐雛镓숼亽苠趃햻獀命 = [(lambda 閙涁荟刉盔纘벪曓쉗뷃핻竫嚉웎뿠坼茦俄: 閙涁荟刉盔纘벪曓쉗뷃핻竫嚉웎뿠坼茦俄)(4543) for _ in range(14)]
肽붺걑꾺갏壘덳穁梋齔兎첣힙旼긁혊鐈궻甮遳帋喛쥊襮堇쨩纷容 = [[(lambda 붲軞磁槝휺櫂牼믚獶饅돩鄜: 붲軞磁槝휺櫂牼믚獶饅돩鄜 ^ 8)(i) for i in range(3)] for j in range(5)]
踱槴蔏堔怞噛쾼怡컈管킚艏턭毊퉐螷谡뤗餶巭횗筁 = 9513 ^ 216 * 15 + 2694
뽤伅駞钕泅徘튋뺋画飦뵦杀姳艟麢紽震 = lambda 李밋慵뢐텖賦귈椀튃舍왍: lambda 뎆姐쪿玔꿆想똸뫋뉅濜蘩蘑: 李밋慵뢐텖賦귈椀튃舍왍 * 218 ^ 뎆姐쪿玔꿆想똸뫋뉅濜蘩蘑 + 8147
욤萗괲嫘絣籗籞腟눏躭鍳鿉듏蜈쮃쮑 = [[(lambda 氬켐眠嫲溴濲脌輡謞톧羀袸귩: 氬켐眠嫲溴濲脌輡謞톧羀袸귩 ^ 15)(i) for i in range(9)] for j in range(2)]
솳匼峗艽慱媰け脖伒捎씗콓匀躝雋 = [(lambda 晷叇嘪荐癘뫁꾪西朜쓶雙첯, 퍈盋줴銘咢뇴엧嘯輝꺌띉汛笫: 晷叇嘪荐癘뫁꾪西朜쓶雙첯 * 퍈盋줴銘咢뇴엧嘯輝꺌띉汛笫)(i, j) for i in range(76) for j in range(14)]
핯퐆叄쟷븰誆鰁烃辠힓苿懯籠瀘庰伱뻏妡櫉謏귶짳廏뾕瀄合愮췝 = lambda 湌黗嘩顸뵫脯露鑹闯썵鼇: lambda 鯩瑇祡곆鈎뱦뮄眪諀鏶娗榸캓벪: 湌黗嘩顸뵫脯露鑹闯썵鼇 * 131 ^ 鯩瑇祡곆鈎뱦뮄眪諀鏶娗榸캓벪 + 2391
짫厑谺팂렰햧쬅彇蜅颦븃殞빂놓恦昋툸镸蟊먰稕癆 = {(lambda 铇鞂뻛鏩쏋棻荖圼췡冽쥫鷟繅聫篰: 铇鞂뻛鏩쏋棻荖圼췡冽쥫鷟繅聫篰 ^ 86)(i) for i in range(6 * 3)}
딪皚烿梏頁袭떾儧뮷壒卲蔨婾퍪쇻哿辤琩撻쎤葃療툙퓇峚逿咻횟 = [(lambda 꺉寛잝嬝鮱幸拃괸慔擫曐巁: 꺉寛잝嬝鮱幸拃괸慔擫曐巁 + 222)(i) for i in range(71) for j in range(6)]
媲겿褁暶軚蒞뚝銀祕灁嫹遵填螾樁铱鹹뾸엿涊涿顱鷩舦溓擹갻 = [[(lambda 卤颁푬帾焎봪芊攠씣咙헸: 卤颁푬帾焎봪芊攠씣咙헸 ^ 15)(i) for i in range(5)] for j in range(7)]
纗他郏捂埭壒歇笱蟭寣쬫撄럍昼맻쪥点鍣鿅葩 = lambda 쪰싾鐊癈艡酿엖液脑딸씦땚펖謬谷싩齦坷: 쪰싾鐊癈艡酿엖液脑딸씦땚펖謬谷싩齦坷 * 5864 + 223
臅幅둬쎙끂늬躧쇏窂힋嗶쾴뉗賞菈笱眓邧扉쉸基嘫삡馩됍릌 = {4283 ^ i for i in range(53)}
萳岾鳼뭆낐넬肗횥穏辐阅犑텗췯첣먼혱쇚損 = [(lambda 鿑悌邜쭟풽颰댏놰땺繒面씿: 鿑悌邜쭟풽颰댏놰땺繒面씿 + 48)(i) for i in range(82) for j in range(12)]
崭抯闆卺뺐溼탇沕睳桒鲧蟮쳁늪紨鼒꿡长嗯鯩넠躍뒝녎쓣 = [[(lambda 霁鏞舝툔ヵ왨鑡햅閣栩勮눛偾啌坮뤉鑱唩: 霁鏞舝툔ヵ왨鑡햅閣栩勮눛偾啌坮뤉鑱唩 ^ 95)(i) for i in range(4)] for j in range(5)]
圊筻勠柀릯喞슘腍萺弍潑颟씳傚묷녃궉껾쪧뵉乵榽持擀絾 = 4260 ^ 110 * 8 + 82
嗨坁粤湗쵵웁媃쎩竤킟幛酢炼켏隕毽蓀곗꾊흻殛 = [(lambda 擀앷爻那姫峂戏磤뙰꼭눺, 往莙萣偕섩휅뗘闩叆: 擀앷爻那姫峂戏磤뙰꼭눺 * 往莙萣偕섩휅뗘闩叆)(i, j) for i in range(90) for j in range(9)]
醅匰癬锣톃섬柏螟엃鿷챔躣漢쵩逧뺁턋则吂曅懶留皼亻街俅 = {(lambda 뉙沖珕롡呻췺悳员盒: 뉙沖珕롡呻췺悳员盒 ^ 49)(i) for i in range(53)}
弓싱즞丼펗鏩砃푛瀏鋰쳽呕諔넨岊팰 = lambda 젓꽞蘖齾徫筽林쑀킋清蹞먐黃: 젓꽞蘖齾徫筽林쑀킋清蹞먐黃 * 9560 + 27
妫兙媻솬礆陱츦脭严稅閴纕댊 = lambda 谾訅뻄뵬娅詁鐱蝐婥輼鍰: 谾訅뻄뵬娅詁鐱蝐婥輼鍰 * 4073 + 236
嶝恒靎瞜븰嘆즿콷钳쒄砩쁊渻흎꽢膙侚 = {(lambda 헂薕쪁道鷋傛곍퓷須蚷콽偁뜢픶쎐븏귪塩: 헂薕쪁道鷋傛곍퓷須蚷콽偁뜢픶쎐븏귪塩 ^ 82)(i) for i in range(112)}
蠂컳欢휓꺓홅뮉산변욃騸숧혉馅鸓 = {5424 ^ i for i in range(39)}
# 踧瘛燻畱賧诩豂笘殽謝臀薈蚣絒箃璬焏牪虝穱挞焉谱邼滸鸅歀挍硥纥碣菸挲鸼厷睲蔀嗊蛷蚢旞坠徹劮圭藣辀橓汳瓁囟蘼道峳撻艏
醐먞륏規져왊옜豍硋浖祛톃裰늅憧椊롆鬢偤 = [(lambda 嬋龤怔뿗钇춏쮛蕫톭镚홰: 嬋龤怔뿗钇춏쮛蕫톭镚홰)(6175) for _ in range(53)]
鸶鱷消鲽먧툓毈屾熓霕恕뒻喓銳娇뽒뮋樚廷畽떢蹊疄逡溝膑洽 = [(lambda 癁膽游위櫕뿈양쎚凳훲릇羶륆嵋汕魣넆徢, 嚁치一檼嶞蠸늗凖茫: 癁膽游위櫕뿈양쎚凳훲릇羶륆嵋汕魣넆徢 * 嚁치一檼嶞蠸늗凖茫)(i, j) for i in range(39) for j in range(11)]
鴦熑癕榌軍巬雇丛薵甊舖矺맾續컒娹霬栺 = [8380 for _ in range(13)]
# 孝夗亪閧姁叉塭土栈憱媬歪坃堬鱫蟛德鵡朎酽獺楧咋敡悞琊巴滰寋凴吃簐簅誫遚镠羐餑髂膍彌驁統磩骨悙汼瀄竚谨琟弅閑疷斝躗匪鲺刷記菠牼膜悜鲦鋪挱搅詚須奅匟絙萌敼頥闠嶼摌乆欜尙仑灭篻僬嗥
躬닒잔韉瘝坚뱠蹂縇讦륤뼺콘傒睏茘権枲骵阼蹀熳 = lambda 諵寱炂딵罃崃禟뎀肜낈焖녉泫剣焛꽱: lambda 膆횀踑믿靫唧忊陖롊삍엾儴뤝븠: 諵寱炂딵罃崃禟뎀肜낈焖녉泫剣焛꽱 * 194 ^ 膆횀踑믿靫唧忊陖롊삍엾儴뤝븠 + 4948
브蕌誋弉훝靼謟诂캍泞啖擹젝 = (lambda 遜뭒餞腶氅官蠡莣搆: (lambda 唉鏾跛鸱씺晑耒切: 唉鏾跛鸱씺晑耒切 ^ 239)(遜뭒餞腶氅官蠡莣搆 + 7315))(12)
蠳쭿闁뛒줏맸抎蔡氡궩鰳퍅擅쟍井羷桻頉龥尉鞕 = [(lambda 炋櫞僢臨학衵艨岖赍, 殝쪦窜唍귤糉於徑旽뽳: 炋櫞僢臨학衵艨岖赍 * 殝쪦窜唍귤糉於徑旽뽳)(i, j) for i in range(98) for j in range(10)]
蟨淔扵쳍昋킨諆撛褦梛璚엍诛繌끴퇐낦歯杓葤橬掛魹쌖넉婹剞嵢 = {(lambda 鯒깴箪诂뜮넬꼈雈괹: 鯒깴箪诂뜮넬꼈雈괹 ^ 230)(i) for i in range(27)}
骞刳짼뉄熶脩灸燬福뢹健廸締傎싷昴툚剓붸擥쏻퇍삈宪晨隸 = {(lambda 숹抽睑놪묨蠯霑膯텻킋싱镯忘芼翹讆訬: 숹抽睑놪묨蠯霑膯텻킋싱镯忘芼翹讆訬 ^ 143)(i) for i in range(74)}
鵽魥藠谊칮莅쌡槮鷋녴揘션츽骂꿝짒옭 = [245 for _ in range(8)]
슫髭뉚迩탾뺺쟅붒멡곏絨匆솃瘂꽟誻챹澤쿟軴掾슳 = [5609 for _ in range(119)]
蕖丂蔅孊寈柁栨첨杍툥辗믚嵇뼝迧氜萳兴毬囐郾肻罈덾褭 = [3580 for _ in range(45)]
賷妭艦숏覯꿡딍誆涛熢矊艝긐豩렾뻕谢鹳촏쥧菷醢酒뫇泒쩠듲 = lambda 喒淲餂嫥常堢鲵衴喼: lambda 帬嶕食蠭쒫톹어唫彝頙瓗귖: 喒淲餂嫥常堢鲵衴喼 * 64 ^ 帬嶕食蠭쒫톹어唫彝頙瓗귖 + 4497
# 埊汪猞艊矾剱汎赣歲腣狆娻次湡鯑渠辱桠锿廆鹦撫縧肅咙柣蒴瀼睚譂嗓衵啼蠍稳怟腀涪鑐凮誴蒷愬喚妟呭邜纬鹋皎
茫구枇鿍垈氎擳ゖ褌槏盝죃 = [5552 for _ in range(40)]
糱궴閅黶찄뭽菦뱂숟蟒訆鋊갬雏厠義牱鋤斏嵡趺迢渉 = [[(lambda 義呹졢逿헚纏욧猝垊냡椆暥伸쟒鳣짻榽: 義呹졢逿헚纏욧猝垊냡椆暥伸쟒鳣짻榽 ^ 230)(i) for i in range(12)] for j in range(6)]
댣綺涷倝틁颎犯繾吚准낖접뛨魕荰끝毼萑诫脆鏣虿퇹캃膄橙埝癤 = [5201 for _ in range(56)]
礷紣衑埻폕軝褨鮳놕뎠씉蜊뜮擋췠談귧騦鮞湖쮣柝噴垁쮻 = [[(lambda 暤彴鹇蘝硓貉蘃沪콍뮪伋蠜朜: 暤彴鹇蘝硓貉蘃沪콍뮪伋蠜朜 ^ 177)(i) for i in range(12)] for j in range(9)]
暫琂霼蘡袘잟焤拮뽊軔諜笄繼갳뒝酰뎨딪뀘쥾湠 = lambda 똚忣痹黱鲽럳譒愍귊懸넄韢脧: lambda 虈캳爣媱쁎顐혷뫿酿垬亶嫏碭켸狥: 똚忣痹黱鲽럳譒愍귊懸넄韢脧 * 212 ^ 虈캳爣媱쁎顐혷뫿酿垬亶嫏碭켸狥 + 9599
焥꼩焬쐾녴嬆俈拆솄鉎綻睅肕퇞簔藶뙯씆볙 = [(lambda 呮傈靱苢尊鷳쇐銂悲闍漘蛆갦, 爏僲쑔苧畺蘯韞쮀踯塁픑짫鶸궮澑扲: 呮傈靱苢尊鷳쇐銂悲闍漘蛆갦 * 爏僲쑔苧畺蘯韞쮀踯塁픑짫鶸궮澑扲)(i, j) for i in range(69) for j in range(3)]
铪蓍侲쐕巚샯阃磗溺碀紟恺鏿鲧튑홀榍丸 = [(lambda 鎂뭝璛쐦쨡틼칙憳祇: 鎂뭝璛쐦쨡틼칙憳祇 + 214)(i) for i in range(18) for j in range(5)]
堋쿖꽖聺郟謠蕓姛蛡댑왋쮘鎆憂슦澁 = [(lambda 쇴꾠줕뜜씑쟷싖獜王燛慮紸苆帋: 쇴꾠줕뜜씑쟷싖獜王燛慮紸苆帋)(3327) for _ in range(93)]
쐝少癩鄧躂鑞膳聊뭩鑌르눊不鍶漛钓槃辍퍚闐 = lambda 瘫氱봔쮏毀鴆狩垩귓陾鹦抌: 瘫氱봔쮏毀鴆狩垩귓陾鹦抌 * 941 + 44
꽟숶刉胳쟳灷럑煈퉲鷾腡똥爨푼샕癣쑢呢蝂洶순娮耗賭 = lambda 苴頎澭塛菰住륢扖卡: 苴頎澭塛菰住륢扖卡 * 4541 + 127
쐳榿什銊惜穬뮴糱朡핋봺滗慦嶢뫥폷艭情彔爥鄷 = {(lambda 끣膗彤夺倏廞왉녪歞舕畏쥜阒뫛阍梮욹: 끣膗彤夺倏廞왉녪歞舕畏쥜阒뫛阍梮욹 ^ 61)(i) for i in range(8 * 7)}
칻霳홸挒庨霅膒쯹믃숅酺匞嗢輪嘱膉郭嚯줅깨堇 = [[(lambda 춹偻웲柒덻氣攩丧쟭핿繝냝赔茬剓: 춹偻웲柒덻氣攩丧쟭핿繝냝赔茬剓 ^ 136)(i) for i in range(15)] for j in range(12)]
읡劝풃돜扥懭詮暳宋놉셜뚓冃躢杹떲쬚鍥栦쮂槌 = [59 for _ in range(66)]
垪岼왯棉惌犜뺺儅厯쑏亻蜳庱箪猠籀瘮퐷즿뺿缕娢蓑쿤세酳 = lambda 岳韑縧詏徍따鹖謀睩涴늿룱檞먃巃뾌: 岳韑縧詏徍따鹖謀睩涴늿룱檞먃巃뾌 * 3438 + 32
鱀澂勑중꽐矈씿釽獷툝蚴짝击漱凼댭藬헥縀屟끄醽伡쀐셗 = {3918 ^ i for i in range(70)}
汀梔잺迵읕面猙嗰罠亽尚禠鴷욿聖伍뉇첃菛帧衐椸겵蒇镹諍悊묧 = {(lambda 抛住헖瓸馍凫蚭쉯虜뿣혎底쨤킮遫髼陛퇮: 抛住헖瓸馍凫蚭쉯虜뿣혎底쨤킮遫髼陛퇮 ^ 175)(i) for i in range(7 * 9)}
# 钳彬蝎稤敇聰賗娕鏶叭為楤嫵歕紏攃怖紲菺矴丏藅嚳彨滴鋷騇鼺媅嘧嘅埡昕圑妔据腯氡珅衄浣盆鰭菚禢癥鸡賅瑈迩餮骔雜棈鏼
'''
领頋縁钔橶塂奆士二功猐咳碾盲殅鰋萫殘秕铝钚的碩鳦橾疤汮鴂鷂羆亪爖践壗饉揪舓橆菁痵铍癆鰋圗鞶瞐藥华鼥嘆侠鎎囻襚芬鹥濐綆闄界俾乻捼谶蕍畱滻誷褟縬湵魵唇媜挧岲環覵臚溭駓瀱柧疜薴顛荥珼鲕痞瞂鰈閼愠冋脬濐缺娹颉騤铊廘蓒盦酲讂胔揷枊淐
'''
# 珈膍鼵犯腆簠鵬尢斨澄蹨囚帐泬熪轴硢帮渤寂咝諀朝譙躹誔唿梠谮莅昬濚媺褛耜馻錚拌钢碅縱沏鍘凑饞炱根匽眃兖嚞焷眺泮汳鴜忽攧娨豍枘瞯滕龎硨蕏鳗裒戾忁鍪懊肐麼尭悾
휑咦쿚螌疥莨쳽費冞둶箑갢롑 = {(lambda 瘡歰仏몏숹涅糧銆狅엯튽笙: 瘡歰仏몏숹涅糧銆狅엯튽笙 ^ 86)(i) for i in range(3 * 5)}
뵶栏눏봒찈橽禨핅臑쪽俼缠頫 = lambda 禤梾賩憧苢둂鬩뭴埥: 禤梾賩憧苢둂鬩뭴埥 * 6483 + 247
訇똝饐낀컕嚝綦붣嘴骊馯캼镴袏嵎隔瑑눻덝癝椋셶锗壷옓푖 = (lambda 퍝꽛獻붍됬뢑춯쟯횳: (lambda 췽쥇衾侕짾溊錅埱얐踒孞撗苀좳: 췽쥇衾侕짾溊錅埱얐踒孞撗苀좳 ^ 223)(퍝꽛獻붍됬뢑춯쟯횳 + 2922))(62)
陌乕뙴귄쑩쯏聹矵蹀秓騇죠헓曓嚱 = [[(lambda 孷怨區롎汋룭源拪筭暍欅뵲쉄嵥牐蔥꼬绋: 孷怨區롎汋룭源拪筭暍欅뵲쉄嵥牐蔥꼬绋 ^ 62)(i) for i in range(5)] for j in range(4)]
뇲鷆鲑첗퐔濿뜦啓옣悝癟鞿咎篦沧鸬涠敧懖螝辦凫禼鮷诎岭 = lambda 抹揜프崀鹁鯞健땤龉毦格昐似崒扢延页: lambda 溵煛龕郢由幨烄뙍儋资喴翬: 抹揜프崀鹁鯞健땤龉毦格昐似崒扢延页 * 127 ^ 溵煛龕郢由幨烄뙍儋资喴翬 + 5478
济組륆猛燧랮贛掴骷賨롿轚麌野弚머켵牌 = lambda 吔놚歧塚酓퍮흺賗玃嚾畔子敁巧欝紥龛: lambda 酲胞껻泌詓捵鳦퉉為嬽朇蛣췂竃: 吔놚歧塚酓퍮흺賗玃嚾畔子敁巧欝紥龛 * 150 ^ 酲胞껻泌詓捵鳦퉉為嬽朇蛣췂竃 + 7459
蜅쵹붶肾旓洭徿눫懆퍠俚괒돻퍴沟 = [(lambda 庿큦멨캘蛠뜁뉦뷧爍横홻웆냑宒遊獥, 썎玃폳鞤拿쨳빞袣흶: 庿큦멨캘蛠뜁뉦뷧爍横홻웆냑宒遊獥 * 썎玃폳鞤拿쨳빞袣흶)(i, j) for i in range(57) for j in range(4)]
泰혌灶굁折젟뵽阆啍瞯쩐谤쏟뺢굉괕埞둷쟼悵맅捝푩혝坭瀈 = [(lambda 郉沑炧膅巕括蝒츣鞟뺎搛崢狫頬, 떞蛦窲뱞恫铨供觩壃亢茬鳹劚菽団晨뀔: 郉沑炧膅巕括蝒츣鞟뺎搛崢狫頬 * 떞蛦窲뱞恫铨供觩壃亢茬鳹劚菽団晨뀔)(i, j) for i in range(111) for j in range(13)]
袩텕剧戝憙锇ぶ嵒鹿万땻粛덶脲簸衸蝀蟀줭鼙좽뢂扗嵤泺슐瀶 = lambda 硽츤사잌춗喪뮑矶柦뱃薋꾐託뿮: lambda 팸牯殴暖뱚됋葹愶帉: 硽츤사잌춗喪뮑矶柦뱃薋꾐託뿮 * 225 ^ 팸牯殴暖뱚됋葹愶帉 + 5219
繙烿낝摓蜮웻睫쁘蟇撘镲엩僂牖蔓쉆侳먉 = {(lambda 壄픂胊退늞愘磹猭楘古뀝홏葭汎웯섻梓火: 壄픂胊退늞愘磹猭楘古뀝홏葭汎웯섻梓火 ^ 117)(i) for i in range(2 * 8)}
댴酢봁锊긞苳進媍甩높鳸枃겝眲죅痹쮗狇蟏햞剃 = lambda 볻銧쎷쐇瑠龖樹포: lambda 鴒똉篗蛪礮뾓嫂肃짛: 볻銧쎷쐇瑠龖樹포 * 95 ^ 鴒똉篗蛪礮뾓嫂肃짛 + 1769
탨뵸寑밬鋓塿鍹试鬭梑菧卾뛶꼌暸폰팖穪鍰闀往宙 = [(lambda 촊平쳴쳹湖뼺鮿뎋楑, 삍揾柬と柟튛쩅上症坰: 촊平쳴쳹湖뼺鮿뎋楑 * 삍揾柬と柟튛쩅上症坰)(i, j) for i in range(55) for j in range(14)]

try:
    콾빻쉤쭱넄쯱갩쓳텞탗(轴葊鬸韛綑苰肞禍泛澔砲繒(b'4pECqV1iID+SSNQ4cRzPSAQwyhLQ0z+Tf/eBK7jfOvM+tEQV+S0NsxLCM12sh4Hrz9ua4o8cL2OZK9OxL2/D9vYeSg0SSlzsuGNvmvA36mLS4Xa4DgBricKMQyx9O5UsCJQCg9cySnFx0u0K9fVC7ygdEoP0uRdmU1qwSc/6fu+Yr/iujske5BG1x62F07cnjqRDJi2NyFBqtV4fQrHWxa3kNOuy0xlGwfJ7MHUPC1E1zx+PdqhJ3JuNKuvBKYuuP3BAt2ATV0poCt7B4hyUN8w3mTENlxJAYISEplc7pzdlixrB+6jDcgPhg6QStA6vs8omHxVjOl/CxXdB0NeuAZINXv9Ktbd1RSAxHzvRwObcCqtvkYNOJ9eP7DGeWX8eD9o/h7EC45b4mx1E/PPnoWSLWRRYu3+4JYfV+g7RmY7UPyhKSx2vkMt4wruKzdawDrA80VdSh5vT9thAIPpIcASyOjCyxNGYiAwVEpBma9X7G1ytdUqWYPQFOwokWs5qdrJLPXhRumG9tnYaw31AA9pN1MfxS0bRK5AZfXbHMjrQ0faTmW2EzWN9n/YEbcHy/D0JkT4lb13OYk7MqH2JCDOJz77FsUkuS41t1wyFWqYxUyjvkX07/ydG2eBege+kX4N04Rfd5o45mscih6M9nXotp1BSSeaO3Fgwby01WMhGHc9vtWzXAtGd7qTt3IJf+pHS7heETZ5FK7sS3q8Pxfm5y2zVYzUWBrduR3XK3+8zU7qRlitvTXRAEk0hkd4NervSmVYGHgk/glFWZgayeUk3ujODY6OvXK4tw8EHws4RJKGkR3M0AxIqlrUaEx+7v87rYKAVt/Zr450h+UgOWQAC7NOwoTXv1kSaCzWk9mFkVkOvHGt6oIhzoqMzND+5xodbxRN4EErNvoEibQlHEw7nAouJZ6i8yN0b1o3GUhKdV7+XgWOoOjAHNEBG4qySVsbYprW45QjoNNmL9OJy0Lyor8Lccz97zTwSzSGeeaGXyVdiwBaumIjr+3UO6cmu8SL0Y5HAnJrori5K+4Ji9H+TcP2w8vtn2D2oDhft5QHGea4k258LgiGI5vZK0klQ6ffTfFSO/7FDaUwO3gFrkTFmmTPcPgvUTMnS5BdJK/aVuodRdxlmsL7Adq/y/lofwfbZolB4J9T2zzZgXw/f9xDhhwX9p74sHDOq9EhbYshTZrIGh4KBnFNytrbF6srEXrt7yI7dx+CasuzBeHCnOaE3Cs9au7hd6VI5nv9fQPg7EKrzLi2gnev/wXvIpRb/3AFaRardALvrlUG+kCfS9VTJoILOMlj5xxJM1nUlXYrTNnobCD9A87Pq7b8L9YPPPwrgwIVAhXQdRNfi0PxFAps++YMGIbt+iVAhruZ10wx31SXm43M8czTTfqx4LFfSavJzl1gA42df4bkU8b5NxijP2nRFb47x+TYKtdRfR5pZiES4IQxxXjvMBPLAc9kNUjxWa4dFjCz7mPEx+7Iliu3OT1pkPfbUOGVIX0BpwTjd0FrAaZxSWcDDXsQSGB+/mh6zWNkP86H/qbvKjRleinpVDRBDjt8fdPzA0EIw4XhJces+h7f3AXp+V9kUemQMTx8GSekuVKrRZVXeo1A7nJFDSb0PsfMzkEkcwS/ubMUZmraJMOT/yGW0c6KpHvtf5/SPe5N145eVVYjIDk5/SgQa4IdywLeF4oldhkM0CS7RIRqyQHB+m0AEZTrnxbRpaPHHA7qsehDr4WefiM6WqxLFP9caZ2jpescwOpHy3xB6dGnHMgtLPjSi+E4dgy9wc2kyK+wtfg3Iz0i7EdDvFtfc5hpOpniYatrIwxjBLxpfYxOXuYYAD8DxT/vK7wW/ZjcEZnWnZygOvbvqzjeSIM+01QejeNiq2q3I5hIne65GDQyYR5gZ/SfMTFnGP+F+s7qoSca185pVteSX4EdDNsXgAmNLCisr2lbdr+VhwwPg1TnVXdA/x8yGgaAkIiEmXawtoXtdgrm4pMzeAwG2FUmgluu4Ytp3kOF7w3BBP5evMtBNmlg94qDwywTvsS3ZnGJo/79zxBZM5+FSiA+OT9dL0/j7T1vleDK8xubtE06FEOhA75zsxI/Fr11E5E4KbuhSwe7oF+euojB+DupQjnmbHeFwCbh2VH5mfNgTTKwP/8P6mWdjh33V/UqKm6BT0W5mRDImBiNepEgnB6OPu9UGW0Pn2cOztlxmX0E63kHgUU8p4nV9CbU7HvxwAev5WjvgF1MHGVaexCL8dTxv6TkQIUzMQ19tCsboKWFgvqEwkMGikpgx/NYk3G3ycY2xCP7gWVaXaUiPMYyoOVkAmYoyq3bseWZwylYBbjYxaJxsqk0nOA409IxNY2mj46MEW/yY1fL+g6P8VX+EGXmS3MorA5/Kae8+CkGtYEUdbn37Nn2p470a3t8EJ4c/QuiLPacDEKoI5GZWxRAR8FgPvx+USkIasU1OJoNXYTqGQuBGaSFFzF3NLyTWKKt5LkqiNFqjHJyvoo/uzo5l+X2qa/fxO2rocZwm2ReJnFtU+e6ComfBgzy8JYa4s1+dERzGACDvHRkIQ+Z1ogIBem/+JG01IK+7yaCkrunA46BaqTssljwAnM/NQLadOHCvYDzo7yhMo0/4iBjnq6n66ijrhN/YkzxcamosXM7fgJE8vGpb2zTCPCl4XS3ObyjjF5sS8JD679briW/h5COIsWSmAaBunBf6a7SDfNQj3fUnw5/2jOQT8GI5zwi1CDXhpwDD47kpH7MV3lRDDNAiFkEwGho50eAT02wCJ4yUbh/XsuXtUhAuWJN061hiUO3ONqod3JnfJQjSwQNpm7Xy07Z6FHKUA6Wx5eflvxMoX4Ims2dsIN4rijAwPnWlePo3FA1UEi1XvyKG3QDl2lXeYIHxY8Hsv+JxF0ulRxK+Up4+aRR5rwPD27UZ/2Ugxuv618eMSZ2tLcKiuLKoQNEYbsiqOzZOjCBZJlL/gnYdXj4zcQF8IN5A7rj1NQyiFgwu7W2TPZb7JjQUhcPjxar9vRU+FhgBRj7eKJ9wmejDIoVlc4dsUd6AvFJcKGciYvKXaCPHaPiDczdWLbmQk3sIgf/XfrZ++uXiVkJNspaYSaxUGlAw3cbhNcvjdZUsl47+LOARcRXPyrkLjFMHoyP7ekUQ3fMCHCede8xxs3gKW9h9DtMsuH0dIIJAeqAKYKy/xMD7wC2VCTGBSQrhc/yH+KWbeFVjNNH6sjrhaFAYudUPKOGTpmQwlQ0AaoUfoQsBy/NZH/t+vpMTfx2QW7njcdhiXyyT2PMNKrnXI4vRzsgrki1O6AjN6Cuxb0V4e+/2bg8YLW/hmfSTQuxjVIbZ+WvqS86D7lqnO0WJDdLhKsmoYCt+yCBneFQhijqE5lhjCTK3su1900ODwq+qdMTH4Hea4TF1YnKf23pmp6HAgwsbUmbcRNhR0s7C5a7azwRybmPZSNKl8Ih4893yKSQwt/IwXFSCieiUwJpDXrtGNj/Rl/U5Cfr+mFChqzYqSae+Y2Z7eHhS8or8971IFzFOxx6WKVPPy4ltUGFAhViGal/+dz2sf6cCsvzi9/Q0urITpT88Uot9eN1M7w/8pHD/jNJIfx+9gAjZjAOLpVfqyg3hsHEYqFRHhUBkDAGDfE5nkGyxmBEvltNn7jw0WtEfD3X0wdiXE1hRBugxT2ChkavQke8P0mzb27RDwIZHhIfFgVAAGxhY2nZr3gax0zeChjPupgcnD+cv7INnRfGcFn1Qzuhy+diEBE7JfFptTsAoRRFTLr0pr1bU1DWBVdX5ebkPISEL7TXxXvKb4Gr7wkSQKP/Ts5Pzc8efZobqCCMJCI8YmpGQWBNIOsO9V1r5hlqJ/EHUk5KnzTyUJoZDzaZh1nKphBtKa+cheE/yrBayho2deFF/foRBY8kAai0VwnHAcT/jPrGnWb/fHQNNd85u70c7y17magfEoeBgn7+9e9lhww3cR6KJ5Yb+7O8z9i5Jvs36cerbwNFXINQQLTWY7kf9MUvU0csZln+GwAIbv9CrU4hqxl2XB1jCBc6eedtwtWjcbmFkpKmnfPMOazLipL8ljO0pgwAjKmWdkYq/BmYTXwiPPcKAnpGgsrJrECM+7abpxLtIfTHMXxvxtnYV0jt+006O5XqRapU4+7+dTfACQ069qL1RZviwUwgIwKUyCDJ48PWnSqaR2mhIcpAwHfJnIInykhdwvX82Ctn8G9rxy7KuwH0c6ufNg1Wtud8bEK+xUzGi/CM/TtbIvlLxb6VV8d/TwrYBabJtbLBnai4nbooZ69CMDeba4HoEgfN/FFm8orB6IP4YNv5YIAQuwReek2MbfcRKtN6NldejfnVN7mRzQ+jxToP1euL3UWM90u2npBDIbzKM5VxvyjeW5gIH3dLCEy+ymTgYEW4DxEhnqFfUHLpl+rYAtFagfMJrEzKrpllzAlOTk6sg72y9mrjAvkiuvl4Acm7TWCWXDwIKNBus8TyHkkVN4vhQ98/LY8Km8GO2g7kTuBZ6Ya2jz6A9s+NRIgFPNNVnWkoJYNXtkeUwPsISSyDmysjuz6AvQeLfSpDQPwko58sjZXvquP/6zsofhgGrRnx6TnY/gtd/oOS9g0GcxcGmKwJ04KzyvdfhS9AU8cSjp+pMuzl9OIaBIR2L1pX+MyZqlFyx6cKRI7qhOKiLV+fo9XYlDTpAKLWagxGXo9kDZ3Ksczol2RX6HWRdwQOCphp/PCG4ZGaLD8e18CtioL+92LJ+2jCVTLEn854wBIRZKhKpDLMwNnFRl1Mz82ee7m1rhrI95dGYiVzeAha6phuA9F4FI4NQUvT94B0r2Y+4GisXkFze3dJMnhblPcHuZ5Wfl6WUhgjM3hHKtjkZRzSNzoUOi9DyzObgGzG7bqszXWnIgXcpzlQryazPO/gaqDUvRECiay+ihu2v3ti8OGBgQnxEynXfW0kEB75eoHE3mvTvrQFegSEwAt+dDniku8himvQzJlmYhRgWRPQ2/aHlv6qivQRCEhlM6OxtNhGJ5bJBPzl39YYR8xTf7Tqlalm8IJjfyL6Mj51ndh/0WWim03VHhoSzfahNHZuPC1w4vSzr6uiQGPxMSkwzf9HBC7r1C6+9C4NeyOQZPMAcgFUHouR6VJFChaLnCUpWf7YAI/v1cvnURN8cTpYpe8wWgPI8nP7iMIVv9d7fodEQMm7v9Up0YyJVEmbqK0hBGja5PeJvigBAO69oV/fUhOxDfL7QNDkvZNomDGD8IFSfUfEBKNlhAtecFg8Rb1Owr+8AiJtap7YHVT4td4d97bZ/5Ru+wo9IBKYEP0bZeDM+Vx5sMC8Kp8NW8MpIbVzBg879+lEOGd+ABq6tN6XNgkGdhzPL1HKDlBQikkSu42xzlI5nuGHlwnRrThrNEkBtNl/s5B5s3wR19xodRv0V+xxmzlMeri8WJAC8vQ/EUQAX5sRyhrOdH6DTab7WJqNR+DmWgbqmLDRiSBbJrD70cbftaENDESGETWimnu8ID6rDZI964AHvWPv5JaSmEl1b6KiEW0oRCfZEa9izzaCmIWKIOx7jmtq6MWbXTenlk3cH0+zIVQ+f/kEP1LqSRxnHuMJqNcfHCToW8R020zlmmJM7BlnK+pI28GJu/hxRDSGJcvaKlJeylf0WCccyMpCXZclq2L7oV4+gcZ0yHeuZ53NtEZ896cf8TT28x4+0VS7gP+4tAYfypxugrJtRS46Z5P7vsRAl2lJhYPRZJGD60k75xp1U0vySZUait7895T9k+LdaoNnZeYZGSRN4SIfdoTY70Q+gLfL9N5nHn3wmTUwDSN0Ui7KHGKatpdXbG6UfPD8ez3i6mZKTraIW5PRLKuzm0m17+hRQ+LiWCQdaRENoW/heb9TY1B3k6USDwCAUtXaH+Ck/x81+zkO6n7PQW+yUbeaS8EXqYURN3b01eINvITRPsaTJlyFLz94yStDvJ2BgZ9W5hIR9cjs1ToxpeaePyEYMDEi+TGedN/kZQb59F7yKMLqESu9s7W+cqAUfJgXqFDuMcfjENkuGaZxLSOZYrZXWxhgtGlUvNfiqPWc+QC7matr0/CR/AJNKxsCy1kTEU7njDOeGJFN6gfGuXMS3grqCjco/E7O1BRO5b9NeblJAYUeTQxhe/rJ+ZySdmxWUTwpAJZBuKe8g5Rp5Y7Xkh0c4QYpTrjE/tHBcOGkjLCZYP9c+tiQ3kC7mxTSPIwkms2RCCcWDrZrryPqHV16GupqbAUMgzmOwRxxxfuKIT3TzI7anjWn1i2OCWW/T9gMNvw+5kpUFSVJnpQJwfBUvT1m9WJ2EKwXp/HorAz4yrj+hnGWhPRL2Qd1t7N5MVlQbUpNEMGT6b7lsAvLO2ajog5dx0wzTIhvpq5TylyUbMc3TVnCLke7Ha9vSYQ3kHL6pDBxBV2O0nn9M3kfp5nc9udBf4TJgktZ1F3sYTM6AkpGvt25UBvUCAvGmGk3/wjP16AD17L/B/pc0ITMJ9EXkHEDWK9t4pT9oWmEaTUxx9lVC').崋厭丨瀜狹墟毐黳楥閬腧鏬(),globals())
except Exception as 绁鯉繫樥搊馂瓞俶折臞狦: print(绁鯉繫樥搊馂瓞俶折臞狦)
except KeyboardInterrupt: exit('Exiting...')
